{
  "file_name": "10062724.pdf",
  "sections": {
    "general": "BEHAVIORAL HEALTHCARE HELP LINE AND PSYCHIATRIC EMERGENCY TEAM SUPERVISOR\nProfessional Overview\nSeasoned Licensed Clinical Social Worker dedicated to providing high quality, compassionate, and effective care in role of psychotherapist,\neducator, and manager.\nLicense\nLCS 18224Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â\nCore Qualifications\nClinical acumen\nMulticuturally competent psychotherapist Strength based management style\nClinical supervision Program development, design,Â training\nClient-centered care Quality review and process improvement\nQuality care focused Rapport building\nService oriented Contract, Criminal, Tort, ProbateÂ law familiarityÂ Â\nCommitted to personal and professional growth",
    "education": "Glendale College of Law City , State\nUniversity of Southern California City , State Master of Social Work\nGraduated with honors\nCalifornia State University, Northridge City , State Bachelor of Arts : Psychology\nGraduated with honors, member of Psi Chi, Golden Key National Honor Society, Tau Alpha Epsilon Honor Society\nAccomplishments\nClinical\nEstablished and operated private practice for 10 years\nDocumentation\nDocumentation Influenced creation, design, and reporting fields of patient charting system\nCreated, implemented system of documentation that resulted in 95% quality assurance scores for several consecutive years\nQuality\nStandardized chart documentation\nDeveloped telephonic, documentation, performanceÂ indicators\n?Training\nWrote training manual and organized resource material\nDeveloped curriculum, taught, and modeled desired skill/outcome\nProvided electronic medical record navigation and documentation training ?\nÂ Marketing\nIncreased referrals via Physician Liaison Program, Elder Law attorneys, primary care physicians, psychiatry and addiction medicine\nproviders, law enforcement, EAP providers, community\nWorkflow Planning\nImplemented new work processesÂ which increased efficiencies and productivity\nComputer Skills\nProficient: Epic, Word, Lotus, Interqual, NICE, Symposium, Foundations, AZZ cardfile\nFamiliar: Excel, PowerPoint, Visio",
    "experience": "07/2002 - Current\nCompany Name - City , State Behavioral Healthcare Help Line and Psychiatric Emergency Team Supervisor\nClinical supervisor ofÂ 24/7/365 psychiatricÂ crisis call centerÂ andÂ psychiatric emergency team; interim supervisor to Utilization Management\nand Bed Finding departments within a largeÂ care coordination center; hired, counseled, terminated staff; recorded, tracked,\ndevelopedÂ performance indicators and performanceÂ criteria for evaluations; wrote and updated protocols,Â policy and procedures, quality\nreview indicators, training manual, meeting minutes, businessÂ reports; influenced development and re-designÂ of electronic charting and reporting\nfields; organized and led new hire, clinical,Â Frequent Caller, computer, staff meetings/trainings, andÂ holiday, retirement, Social Work\nMonthÂ celebrations;Â performed web-basedÂ in-service work stoppageÂ training toÂ physicians, managersÂ and successfully staffed\ntheÂ crisis line for 48 consecutiveÂ hours with no abandoned calls;Â developed Frequent Caller treatment plan template for coordination and\ncontinuity of care; participated and presentedÂ statistical dataÂ atÂ regional Department Administrators and regional Southern California Quality\nAssurance meetings; implemented interdepartmental cross training which increased efficiencies, productivity, staff development, and morale;\nrecorded, tracked, ensuredÂ staffÂ license renewals, CEUs, mandatedÂ organizational classes were completed by due dates; completed bi-\nmonthly payroll and managed all leaves; completed staff scheduling every 6 weeks; decreased tardiness; responded to all IT concerns; reviewed,\nresearched, responded to all critical incidents and complaints; developed work flows that decreased time members spent in non-plan EDsÂ with\nattention to high qualityÂ care and cost containment; answered crisis calls when short staffed; and,Â shared on-call responsibilities.\n03/1998 - 07/2002\nCompany Name - City , State Licensed Clinical Social Worker/Care Coordinator\nPerformed biopsychosocial telephonic assessments, crisis intervention,Â and/or consultation for members, employees, purchaser groups,\nEmployee Assistance Professionals, management, law enforcement, and emergency department physicians; determined appropriate levels of care;\nrepatriated or case managedÂ members in non-plan hospitals; advocated for members needing psychiatric and/or addiction medicine\ntreatment;Â care coordinated with the member's treatment team; trained new staff;Â worked collaboratively on interdepartmental team and\ndeveloped work flows, procedures, and protocols thatÂ increased efficiencies, productivity, role clarity; developed documentation\nstandards;Â influenced the creation and developmentÂ of departmental electronic database for charting case notes.\n04/1996 - 03/1998\nCompany Name - City , State Senior Care Network, Clinical Social Worker\nField based case management for disabled adults with chronic mental illness and older adults with co-occurring disorders.Â CompletedÂ in-home\nassessments and monthly monitoring; client and family counseling, education, and community referrals. Per attorney request, evaluated, wrote\nreport, testified in court (became expert witness) for probate conservatorship hearings; marketed and managed the Physician Liaison program;\nlead weekly Caregiver support group; underwrote long-term care insurance assessments and benefit determination evaluations; became community\nresource specialist.\n05/1992 - 08/1996\nCompany Name - City , State Behavioral Science Faculty, Family Practice Residency Program\nSocial Work Associate in community medical clinic; interviewed prospective residents; developed curriculum, taught, and evaluated performance\nof Family Practice residents and medical students on the Substance Abuse and Psychiatry rotations; conducted lectures, presentationsÂ inÂ class,\n\"Brown Bag lunches,\" and off-site meetings; set up internal and external training sites and ensured learning objectives were met; education was\nfocused onÂ risk, substance abuse, andÂ biopsychosocial assessments, active listening, interviewing skills, DSM diagnoses while on rounds,\nduring home visits, and co-led therapy sessions;Â instilled confidence by demonstrating attunement to patient and self, assessment, treatment\nplanning, rapport buildingÂ skills, and provided after visit summarization/feedback;Â strengthened teamwork and resident and faculty relationships\nby incorporating team building activities into staff meetings;Â liaison to residentsÂ who needed psychiatric or healthÂ services;Â provided\nshort/long termÂ individual, couple, family therapy on complicated cases and provided feedback toÂ the resident; and was a preceptor to other\nMSW students..\n10/1991 - 10/2001\nCompany Name - City , State Psychotherapist\nIndividual, couple, family therapy with children, adolescents, adults, and older adults. Presenting problems were: depression, anxiety, panic attacks,\ninsomnia, psychosis, explosive rage,Â adoption,Â foster care, grief and loss, truancy, trauma, self harm, substance abuse/addiction, gender\ndysphoria, domestic violence, homelessness,Â parenting concerns, care giver burn-out, and school/work stress. Clientele: ethnically, culturally,\nracially, and socioeconomically diverse.\n10/1990 - 10/1991\nCompany Name - City , State Employee Assistance Program/Mental Health Center, MSW Intern/Social Work Associate\nConsultation provided to managers, employees, Human Resources regarding work place problems; Crisis Intervention, short and long-term\ntherapyÂ provided to contract and companyÂ employees, their families, and the community;Â taught series of classes on Stress Management and\nMemory Retention. Featured speakerÂ at aÂ \"Drugs in the Workplace\" seminar; and taught substance abuse related classes and lead couples\ngroup therapy with addicts and co-addicts in an outpatient chemical dependency recovery program. Clientele: racially, ethnically, culturally, and\nsocioeconomically diverse.\n09/1989 - 05/1990\nCompany Name - City , State MSW Intern\nDirect services provided in community mental health setting: conducted biopsychosocial assessments; short and long termÂ individual, couple,\nfamily therapy; led group therapy with adults; provided crisis intervention, case management, community referrals. Client presenting problems were:\nchild physical, emotional, sexual abuse/trauma,Â and difficult transitions to foster care, depression, anxiety,Â phobias, Â ADHD,Â pervasive\ndevelopmental disorders; teen truancy, gang activity,Â pregnancy, and substance abuse/addiction; adults with parentingÂ problems; victims of\ndomestic violence; unemployment; co-occurring disorders, grief and loss, panic attacks,Â andÂ chronic mental illness. Clientele: ethnically, racially,\nculturally diverse; mostly low to middle income.\n08/1987 - 08/1989\nCompany Name - City , State Resident Counselor\nProvided individual, family, group therapy with homeless, run-a-way girls, 12-18 years old, many charged with crimes associated with substance\nabuse,Â prostitution and gang activity; filed child abuse reports; provided telephonic crisis intervention; completed new resident intakes; general\nsupervision of residents;Â designed teen pregnancyÂ awareness program, taught life skills classes,Â became a lead and trained and supervised\nstaff.\nPresentations\n1990-1991: Taught classes in Stress Management and Memory RetentionÂ to the community,Â hospitalÂ employees, andÂ EAP clients; speaker\non Drugs in the Workplace for a large contracted employer.\n?1992-1996: The following lectures to Family Practice residents, medical students, and/orÂ attending physicians were conductedÂ inÂ class,\nduringÂ hospital \"Brown Bag\" lunch breaks, or at off-site meetings:\nParenting 101\nSuicide Risk Factors, Assessment, and Aftermath\nPsychiatric Holds and Conservatorships\nEating Disorders and Treatment Options\nMulticultural Approaches to Healthcare\nMy Patient is Non-Compliant... What Can I Do?Â\nThe Cycle of Domestic Violence: Patient, Child, Perpetrator Effects\nOh No, it's Not Him/Her Again... Managing Countertransference\nMalingering, Factious,Â Psychosomatic Disorders\nHow to Manage Angry and Aggressive Patients\nSigns and Symptoms of Child Abuse, Elder/Dependent Abuse?\nWho, What, When, Where, andÂ WhyÂ of Panic Attacks\nNormal Childhood Fears\nThe Mental Status Exams\nIs it ADD, ADHD, Anxiety, Depression, Mania?.... HELP!\nHow Do IÂ Screen for Drinking/DrugProblems?\nSigns and Symptoms of Alcohol/Drug Intoxication and Withdrawal\nStages of Chemical Dependency\nCauses and Treatment of Substance Abuse\nSubstance Abuse: Breaking Down the Walls of Denial\nAlcoholics Anonymous and the 12-Steps\nStress Management\nDeath: Grief, Loss, and Depression... What's Normal?\nDelirium, Depression, and Dementia, What's the Difference?Â ?\nAssessments and Developmental Stages of Life\nWho Can Help With What? (Community Resources)Â\nRapport, Compliance, and LawsuitsÂ Â Â Â\nVolunteer Work\nOrphanages in Mexico: built and repaired homes, planted gardens,Â entertained children as mime,Â providedÂ medical screenings, clothing\nand school supplies\nIndian reservations in Arizona and New Mexico: built and repaired homes, provided food, clothing, child care,Â for Navajo, Hopi,\nCherokee Indians.\nCamp leader forÂ children and adults with Down's syndrome, traumatic brain injuries, autism, deaf-blindness, and chronic mental illness.\nAssisted adults with mild to moderate intellectual disabilities find employment and closely monitoredÂ work performance.Â Â",
    "languages": "Sign language"
  }
}