{
  "file_name": "10100240.pdf",
  "sections": {
    "general": "CARPENTER APPRENTICE\nProfessional Summary\nFormer construction and carpentry worker committed to high-quality workmanship and safe environments. Over 4 years of hands-on experience\nworking with remodeling projects in residential and commercial construction. Dedicated work ethic and exceptional attendance record. I am\nmotivated to learn new trades and skills. Interested in growing career and fostering leadership capabilities. Professional Construction Laborer with\nexcellent interpersonal skills. Works in timely and efficient manner to see tough jobs through to completion.",
    "skills": "Cabinetry\nMaterial prepping\nConstruction drawing interpretation\nCarpentry techniques\nOral and written communication\nMaterials handling\nNew construction and renovation\nDrywalling\nSafety and compliance\nWork History\nCarpenter Apprentice , 10/2017 to 09/2019\nCompany Name – City , State\nAssisted with movement of materials and equipment to job sites\nWorked with master carpenters to install decks for both residential and commercial customers\nInstalled and repaired woodwork, millwork and cabinetry under supervision of master carpenter\nKept job site cleaned up properly and all debris disposed of in respective containers\nInterpreted specifications and construction drawings to understand tasks necessary to complete each job\nAccepted feedback from foreman and journeyman carpenter, implementing suggestions into later work\nObserved all OSHA and corporate safety regulations and procedures\nLed variety of projects from start to finish, including garages, residential homes and additions\nRepaired roofs and flooring and remodeled bathrooms and kitchens to complete projects in satisfactory time\nEffectively used all fasteners such as nails, screws, pneumatic nailing systems, concrete anchors, powder-actuated fasteners and framing\nconnectors\nProactively managed projects to obtain 100% customer satisfaction for all custom work\nInstalled interior finish items, including wall protection, doors and hardware, toilet accessories, cubicle curtain tracks and TV brackets\nInstalled drywall, ceilings, trim and fabricated replacement trim and moldings\nConstruction Worker , 08/2016 to 09/2017\nCompany Name – City , State\nSupported customer preferences with basic carpentry work such as installing wooden floors and crown molding\nConsulted with customers to understand desires and help each owner meet individual property objectives\nGathered and disposed of work site debris to remove safety hazards and boost team productivity\nMonitored materials inventory and requested items for restocking for each job\nLoaded and unloaded building materials used for construction\nSafely operated mowers, chain saws, electric clippers, sod cutters and pruning saws to clear construction sites, roadbeds and access roads\nErected and removed temporary structures such as trench liners and scaffolding to meet team needs\nEnhanced team efficiency and multitasking abilities by effectively using hand tools, power tools and equipment\nGathered waste and trash from job sites for placement in refuse containers to keep job sites clean and organized",
    "education": "High School Diploma : 04/2010\nBuffalo High School - City , State\nCSHO (Certified Safety & Health Official) , 01/2020\nTEEX - City"
  }
}