{
  "file_name": "10176815.pdf",
  "sections": {
    "general": "AVIATION ELECTRONICS TECHNICIAN",
    "summary": "Seeking a challenging position where my existing skills and experience contribute to your company while expanding my technical abilities.\nHighlights\nProficient with maintenance tracking software, Prezi and Microsoft Office Programs such as Word, Excel, PowerPoint, Outlook, Adobe,\nAccess, Auto CAD, Commercial Multi-Engine and Single-Engine Pilot, Airline Dispatcher Certified, FAA Class 1 Medical, MATLAB,\nlabVIEW",
    "experience": "01/2013 to 01/2015\nCompany Name\nUsed the instructional design process to plan and develop online courses in partnership with faculty SMEs, then building courses using a\nstandardized template in the Blackboard LMS environment.\nUtilized a variety of technology tools, including Canvas, Blackboard, Respondus, StudyMate, TurnItIn, SnagIt, Camtasia, HTML and\nothers to create instructional media.\nFacilitated in the transfer and development of online courses from Blackboard LMS to Canvas LMS.\nCollaborated with remote faculty to prepare high-quality, interactive online courses, for academic and non-credit delivery.\nConducted quality assurance reviews of courses and other instructional materials Edited and organized electronic information to create high-\nquality course content that is suited to the adult online learner.\nWorked with Blackboard System Administrators to troubleshoot issues with online courses in the LMS system, prepare for system\nupgrades by testing the LMS on staging servers.\n01/2008 to Current\nAviation Electronics Technician Company Name\nTroubleshoot radar systems, communication systems, navigation equipment, radar altimeter warning systems, instrument landing system\nequipment, electronic support measure systems, electro-optical sensors (IR turret), search radar and synthetic aperture radar.\nTest electronic circuits using commercial and industry-standard equipment, such as oscilloscopes, digital multi-meters, logic analyzers, DAC\nconverters, spectrum analyzers and signal generators and time delay reflectometers to isolate faults and defects.\nWork side by side with Quality assurance as a collateral duty inspector, responsible for writing quality deficiency reports, technical\ndiscrepancies and engineering investigations.\nMaintain and repair in-flight navigation and detection systems on aircrafts , radar systems, radar and tactical displays, IFF/SIF equipment,\nradar altimeters, Doppler navigation equipment, radio navigation systems, analog computing devices, electronic countermeasures equipment,\nlaser and fiber-optic infrared devices, digital recorder systems and aircraft digital systems, use basic RF electronic test equipment and\nspecialized system test equipment.\nCompleted maintenance action forms, keep an inventory of parts and supplies, maintain a technical library and perform avionics corrosion\ncontrol.\nTroubleshoot and repair antisubmarine warfare sensors, electronic warfare, data link, fire control and tactical displays with associated\nequipment, UHF and VHF receivers and transmitters, made repairs on antennas, repair and install electrical connectors, inspect and install\npressurized equipment, waveguide components, avionics gaskets and seals, calibrate test equipment, interpret computer languages and\ncomputer equipment.\n01/2003 to 01/2007\nAviation Electronics Technician Company Name\nWorked in the Navy's largest intermediate maintenance department providing component level repair exceeding 260,000 components\nannually and valued at $557 million.\nIncorporated and ensured strict attention to detail in repairing electrical aircraft systems using commercial and industry-standard equipment,\nsuch as oscilloscopes, digital multi-meters, logic analyzers, DAC converters, spectrum analyzers and signal generators all while contributing\nto 55% percent reduction in backlog.\nAnalyzed and resolved intricate automated test equipment problems and debugged complex computer generated data all while supporting\n19 F/A-18 squadrons and 11 aircraft carriers.\nAssembled, checked, handled, inspected, maintained, operated, reprogrammed, repaired and processed over 2,900 maintenance actions\nannually on classified F/A-18 specialized repair assemblies all while maintaining a 95% ready for issue rate.\nUtilized technical manuals, wiring schematics, block diagrams, electrical schematics and drawings to rapidly isolate malfunctions in system\nwiring, sub assemblies and other components.",
    "education": "May 2016\nBachelors of Science : Aeronautical Science Applied Meteorology Embry-Riddle Aeronautical University ï¼​ City , State GPA: GPA: 3.23/4.0\nAeronautical Science Applied Meteorology GPA: 3.23/4.0\nMay 2008\nAssociate of Science : Electronic Engineering Technology Tidewater Community College ï¼​ City , State GPA: GPA: 3.85/4.0 Summa Cum Laude\nElectronic Engineering Technology GPA: 3.85/4.0 Summa Cum Laude",
    "languages": "Bilingual fluent in Spanish and English",
    "skills": "academic, Adobe, Articulate, attention to detail, Auto CAD, basic, calibration, Canvas, content, credit, delivery, electrical schematics, English,\nforms, HTML, inspect, inspector, instructional design, inventory, labVIEW, laser, logic, materials, MATLAB, Access, Excel, Microsoft Office\nPrograms, Outlook, PowerPoint, Word, radar, multi-meters, Navy, communicator, navigation, organizational, oscilloscopes, problem solver,\nquality, quality assurance, radio, recording, repairs, repairing, schematics, servers, signal generators, fluent in Spanish, technical manuals, test\nequipment, Troubleshoot, troubleshooting, UHF, upgrades, VHF, wiring\nAdditional Information\nActive DOD secret clearance"
  }
}