{
  "file_name": "10281555.pdf",
  "sections": {
    "general": "CONSTRUCTION SITE MANAGER",
    "summary": "supervising and overseeing the direction of the project (or a package), ensuring that the client's specifications and requirements are met, reviewing\nprogress and liaising with quantity surveyors to monitor costs\nliaising with the client, other construction professionals and, sometimes, members of the public\ncoordinating and supervising construction workers\nselecting tools and materials\nmaking safety inspections and ensuring construction and site safety\nchecking and preparing site reports, designs and drawings\nmaintaining quality control procedures\nfinding ways to prevent problems and to solve any that crop up\nassessing and minimising risk\nwriting reports and keeping on top of paperwork\nhelping to negotiating contracts and securing permits and licences\nAs construction managers work on site wherever that site is, be prepared to relocate or face a longer commute as and when required.",
    "skills": "Good communication skills Networking ability\nProblem solving skills Lead development\nDecision-making ability Product expertise\nCommercial awareness Crisis communications\nAbility to motivate other Marketing\nTeamworking skills Blueprint reading\nGood knowledge of building methods and regulations Regulation and compliance\nCustomer service Excellent driving record\nAccount management Detail-oriented\nBusiness-to-business background Good mechanical aptitude\nCapital planning Production line/assembly line forklift experience\nStaff training Good verbal/written communication skills\nContract negotiation Establishing goals and setting priorities",
    "experience": "Worked closely with construction teams at a variety of work sites.\nResponsible for daily reporting on production equipment, including parts produced, downtime minutes, and any quality concerns.\nBlueprint Reading\nRead blueprints, work orders, and production schedules to accurately determine job instructions and specifications.\nProblem Diagnosis\nUsed operational knowledge of systems, parts and components to solve problems that arose during constructionÂ\nInspection\nInspected electrical systems, equipment, and fixtures to identify safety hazards for replacement or repair.Â\nProject Planning\nProvided project controls, cost estimation, and other business support services to technical line management.\nSafety Audit\nLed monthly safety audits to monitor employee behavior and ensure safe compliance with company policies and safety regulations.\nDocumentation\nReported and documented unsafe conditions, equipment and/or injury.\nMilitary Experience\n12/1990 to 12/1994\nVisual Communications Company Name ï¼​ State\n12/1994 to 12/1996\nSafty trainning Petty Officer Company Name ï¼​ City"
  }
}