{
  "file_name": "10466208.pdf",
  "sections": {
    "general": "PHARMACEUTICAL SALES REPRESENTATIVE, WOMEN'S HEALTHCARE SPECIALIST\nProfessional Summary",
    "skills": "Account Management, acquisitions, ADMINISTRATIVE, contracts, clientele, customer satisfaction, customer\nSsatisfaction, decision making, DOCUMENTATION, EVENT PLANNING, inventory, TEAM LEADERSHIP, LEADERSHIP, Director,\nmanaging, marketing plans, marketing, market, mergers, communicator, organizational skills, problem-solving, PUBLIC SPEAKING, recruitment,\nrelationship-building, REPORTING, Sales, STAFFING, strategic, strategic planning, team player\nAdditional Information\nExperienced, multi-faceted business professional with ability to quickly generate business results. Seeking a position with Abbott for the\nTerritory Sales Position in Tacoma,WA.\nAdept at attending job related conventions and managing special company events to attract candidates. Top-notch skills in relationship-\nbuilding, problem-solving and decision making. Open and clear communicator with collaborative and hardworking style. Membership\nEnrollment Director excelling at customer satisfaction and retention. Flexible and hardworking in deadline driven environments. Energetic\nteam player with top launch organizational skills.\nIntensive 3 Week training program in Radnor, PA",
    "education": "Bachelor of Arts : Business Administration And Public Relations , 1995\nHeidelberg College - City , State\nWork History\nPHARMACEUTICAL SALES REPRESENTATIVE, Women's Healthcare Specialist , Company Name – City , State\nDoubled membership in an environment where acquisitions and mergers by National chain accounts directly affected potential membership\nrecruitment.\nInvestigated and resolved customer inquiries and complaints in a timely and empathetic manner.\nResponded to all customer inquiries thoroughly and professionally.\nProvided an elevated customer experience to generate a loyal clientele Resolved all customer complaints in a professional manner while\nprioritizing customer satisfaction.\nSet up and explained new membership contracts.\nEffectively communicated with and supported sales, marketing and administrative teams on a daily basis.\nAssisted in creating pre-season marketing plans to support department and divisional Strategies.\nCommunicated with vendors regarding backorder availability, future inventory and special orders.\nDeveloped Account Management Program that focused on maintaining existing account base while using referral and reference systems to\nattract new accounts.\nOrganized new member marketing program including identifying potential target accounts, developing high touch outreach plans, incentive\npackages, and growth Objectives.\nSuccessfully managed acquisition of a New England Association and increased membership by 50% within the first two years.\nAsked appropriate open-ended questions to discover prospects' needs and requirements.\nRepresentative of the year 2003 Successfully launched new products and rapidly gained market share.\nMaintained an extensive knowledge of competitors, their offerings and their presence in assigned territory.\nServiced accounts on a regular basis to propose new products or services and maximize revenue.\nIdentified and qualified accounts to assess market potential.\nConsistently hit and exceeded quarterly sales goals.\nIdentified and analyzed key competitors and related products.\nContacted customers as soon as issues arose to immediately find resolution before the problems escalated.\nCommunicated regularly with territory, regional and strategic managers for daily support and strategic planning for accounts.\nSuccessfully sold brand name products, while competing with the generic medicine.\nCommunicated regularly with territory, regional and strategic managers for daily support and strategic planning for accounts.\nVisited customer locations to determine needs, set up contracts and provide training.",
    "certifications": "PROVEN ADMINISTRATIVE HIGHLY ORGANIZED LEADERSHIP SUPPORT EVENT PLANNING ENTREPRENEURIAL\nCONFLICT PUBLIC SPEAKING MINDSET RESOLUTION PROJECT STAFFING TEAM LEADERSHIP REPORTING AND SELF\nDIRECTED DOCUMENTATION OUTBOUND CALLING PROSPECTING"
  }
}