{
  "file_name": "10694288.pdf",
  "sections": {
    "general": "HR BENEFITS/LEAVE COORDINATOR",
    "summary": "13 years of Human Resources experience and 27 years of administrative experience working in various settings *Professional, detail-oriented,\nexcellent time-management skills, team player, open and honest communicator, effective at maintaining confidentiality and multi-tasker.",
    "skills": "Benefits, consultation, Content, counseling, editor, HRIS, HR, insurance, all Microsoft, Navigator, newsletter, Page, Assist patients, payroll,\npayroll processing, Personnel Management, phone system, policies, reporting, research, phone, website",
    "experience": "December 2016\nto\nCurrent\nCompany Name City , State HR Benefits/Leave Coordinator\nProvide consultation and assistance for all employee benefits.\nAssist Retirement/Benefits Manager in counseling employees on retirements as well as generate retirement calculations.\nAssist Retirement/Benefits Manager with retirement trainings.\nPromote and coordinate all aspects of the Highlander Wellness Watch program.\nAdvise faculty/staff regarding leave policies and procedures.\nInterpret and apply policies, procedures and guidelines.\nDevelop and present leave trainings for employees and supervisors.\nContent editor for the HR newsletter and HR website committee.\nAnalyze and reconcile leave discrepancies.\nProcess and maintain Workers Compensation claims, short term disability claims and FMLA requests.\nCoordinate return to work for employees on short term disability, FMLA and WC.\nMaintain OSHA logs and reporting to include OSHA 301 and OSHA 300A reports.\nProcess employees leave corrections.\nProcess leave share requests and coordinate payments with payroll.\nCalculate leave payouts for separating employees for payment.\nProcess reports in Banner (HRIS) to ensure leave policies and procedures are being adhered to and applied in regards to FLSA\nregulations.\nPerform leave audits.\nProvide programmatic support to employees and supervisors for the on-line leave reporting system.\nAssist with other HR duties as needed to include job fairs, benefits fair, etc.\nMaintain confidential and sensitive information.\nNovember 2008\nto\nNovember 2016\nCompany Name City , State HR Leave Coordinator\nAdvise faculty/staff regarding leave policies and procedures.\nInterpret and apply policies, procedures and guidelines.\nDevelop and present leave trainings for employees and supervisors.\nAnalyze and reconcile leave discrepancies.\nProcess and maintain Workers Compensation claims, short term disability claims and FMLA requests.\nCoordinate return to work for employees on short term disability, FMLA and WC.\nMaintain OSHA logs and reporting to include OSHA 301 and OSHA 300A reports.\nProcess employees leave corrections.\nProcess leave share requests and coordinate payments with payroll.\nCalculate leave payouts for separating employees for payment.\nProcess reports in Banner (HRIS) to ensure leave policies and procedures are being adhered to and applied in regards to FLSA\nregulations.\nAssist with coordination of CommonHealth wellness program.\nPerform leave audits.\nProvide programmatic support to employees and supervisors for the on-line leave reporting system.\nAssist with other HR duties as needed to include screening job applicants, new hire orientation, exit interviews, open enrollment for health\ninsurance and flexible spending accounts, job fairs, benefits fair, etc.\nMaintain confidential and sensitive information.\nJune 2004\nto\nNovember 2008\nCompany Name City , State Personnel Transaction Specialist/Human Resource Assistant\nProcess new hires, transfers, promotions into Banner and PMIS systems.\nPerform audits for payroll processing.\nProcess short term disability claims and FMLA requests.\nProcess leave share requests.\nCoordinate docks with payroll.\nPerform other duties and tasks as needed.\nMaintain confidential and sensitive information.\nAugust 2002\nto\nJune 2004\nCompany Name City , State Communications Operator\nRefer patients to appropriate areas for treatment.\nAssist patients with questions and concerns via phone or walk-ins.\nAnswer incoming calls on a seven-line phone system.\nPage doctors in a timely manner.\nUpdate call schedules as changes occur.\nFile.\nOverhead all codes in a timely manner.\nMaintain patient confidentiality.\nEducation and Training\nBluefield College City , State Bachelor of Science : Organizational Management and Leadership Organizational Management and Leadership\nNew River Community College Associate of Applied Science : Business Management Business Management\nActivities and Honors\nSociety for Human Resources Management (SHRM) Colleges and Universities Professional Association for Human Resources (CUPA-HR)"
  }
}