{
  "file_name": "10748989.pdf",
  "sections": {
    "general": "LIGHTING DESIGNER\nProfessional Summary\nComputer savvy and proficient with design tools for Architecture and Electro-Mechanical Design [Job Title] who continually searches for new\ninspiration and stays savvy on current design trends. Proficient in Adobe InDesign, SketchUp and Rhino. [Job Title] whose multi-faceted specialty\nranges from design of accessories and furniture to lighting design. Motivated Visual Merchandising Designer involved in all stages of design from\nproduct inception and development to production. Results-oriented [Job Title] who delivers cutting edge and creative designs within strict time\nframes. Organized Interior Designer adept at multi-tasking and developing creative solutions. Successfully coordinates with vendors and manages\nconstruction teams with ease.",
    "skills": "AutoCAD, Cadence, Client, Documentation, Drafting, Estimating, Leadership, Team lead, Lighting, Materials, meetings, Motorola, presentations,\nPress, Project Management",
    "education": "Bachelor of Fine Arts : Interior Architecture 2013 The University of North Carolina - City\nInterior Architecture\nBIM and Design Graphics coursework\nContinuing coursework in Sustainable Design\nArchitecture coursework\nColor Theory and Perspective course\nHistoric Conservation & Adaptive Re-use Sustainable Design Practices Energy Efficiency in the Building Envelope : - Historic Preservation\nsustainable design practices\nenergy efficiencies in the building envelope\nAssociates : Applied Science Architecture Technology Wake Technical Community College -\nApplied Science Architecture Technology\nRecipient of Home Builders AssociationÂ Scholarship\nRecipient of MeritÂ Scholarship\nBuilding Construction seminar\nBIM and Design Graphics coursework\nArchitecture coursework\nOfficer of Architectural Club\nConstruction Materials & Methods Building Codes Solar Technology Civil Engineering Construction Estimating Project Management : -\nDrafting Certificate : Electrical and Mechanical 1980 Island Drafting & Technical Institute - City , State\nAccomplishments\nLighting Design for Rex Hospital and Duke Stadium Press Tower"
  }
}