{
  "file_name": "10751444.pdf",
  "sections": {
    "general": "PRODUCT DESIGNER\nProfessional Summary\n4-5 years engineering experience and 1-2 years working experience. Able to work independently and under pressure, detail oriented, excellent\nproblem solver, Innovator. Efficient Mechanical Engineer leveraging a strong technical background in bringing products from the laboratory to\nmass-manufacturing. Mechanical Engineer with [Number] + years of training in varied industries, including manufacturing and high-tech\nenvironments. Creative manufacturing engineer. Lead team member on process redesign for [Describe product] . Design engineer who has worked\non [Number] new products, including the [Product name] recognized for industry excellence.",
    "skills": "3D, 3D modeling, AutoCAD, broadcasting, budget, C, cable, Chinese, com, hardware, content, controller, data analysis, Dec, decision-making,\ndesigning, product design, English, fashion, focus, Fortran, frame, Graphic, Lathe, Linux, director, Maple, materials, MATLAB, mechanical,\nMechanical Engineering, access, Mill, modeling, navigation, printer, processes, profit, speaking, Python, Quantitative analysis, reading, read,\nresearch, safety, Simulation, sketching, SolidWorks, statistical analysis, Statistics, phone, translating, transportation, video, Welding, wiring, written",
    "education": "Master of science : Mechanical engineering Robotic & Manufacture Current Columbia University in the City of New York - City , State\nSep -2015 Dec Mechanical engineering Robotic & Manufacture\nCoursework in Advanced Mechanical Engineering\nCoursework in Drafting, Computer-Aided Design (CAD) and Computer-Aided Manufacturing (CAM)\nBachelor of science : Mechanical Engineering 1 2010 North Carolina State University, Raleigh (NCSU) - City , State\nGPA: Magna Cum Laude GPA: 3.5 GPA: 3.63/4.0 Mechanical Engineering Magna Cum Laude GPA: 3.5 GPA: 3.63/4.0\nNorth Carolina State University -\nGPA: Magna Cum Laude Magna Cum Laude\nAccomplishments\nListed in the dean's list for three semesters during Junior and Senior Year · Chosen to be on the cover of NC State freshman admissions\nbooklet · In the process of receiving the Professional Development Certificate · NCSU Chinese basketball team player.\nMath and physics club member · Control and Mechanical Team member of NCSU EcoCAR2 · Took the global training class at NC\nState University · CUSA member (Chinese undergraduate student association)."
  }
}