{
  "file_name": "10909720.pdf",
  "sections": {
    "general": "MASTER TEACHER\nHighlights\nHome schooling knowledge Strong communicator\nCalm and patient Toddler and preschool curricula\nCertified in Early Childhood Education Classroom management\nHead Start programs Classroom management",
    "skills": "I have a lot patience, I communicate really well with children, I can usually calm a stressful situation quickly.",
    "education": "Early Childhood Education 2000 San Jacinto College ï¼​ City , State , USA\nCoursework in Child NutritionChild Abuse Awareness trainingCoursework in Emergency PreparednessCoursework in Behavior\nManagementEmphasis in Child Development\nHigh School Diploma , General 1991 Beaumont High School ï¼​ City , State , USA\nEmphasis in Child Development",
    "experience": "Master Teacher Sep 2010 to Apr 2013\nCompany Name ï¼​ City , State\nConducted small group and individual classroom activities based on differentiated learning needs.Encouraged students to be understanding of and\nhelpful to others.Observed students to supply teachers with feedback regarding potential learning blocks and opportunities for support.Physically\nand verbally interacted with students throughout the day to keep them engaged.Supported students in developing strategies for individual needs\nand classroom group dynamics.Organized field trips to local parks, fire stations and zoos.Helped prepare daily lesson plans for activities and\nlessons.Implemented emergent curriculum to encourage student participation.Supplied one-on-one attention to each student, while maintaining\noverall focus on the entire group.Wrote daily and weekly lesson plans.Administered minor first aid to injured students.Applied the positive\nreinforcement method to redirect negative behaviors.Promoted language development skills through reading and storytelling. implemented family\nstyle meals. conducting parent/teacher conferences. and kept personal profiles of each child.\nTeachers Associate Aug 2004 to Nov 2009\nCompany Name ï¼​ City , State\nPromoted language development skills through reading and storytelling.Applied the positive reinforcement method to redirect negative\nbehaviors.Conducted small group and individual classroom activities based on differentiated learning needs.Assisted 5-6 children per station during\nsmall group learning periods. Organized field trips to Encouraged students to be understanding of and helpful to others.Observed students to\nsupply teachers with feedback regarding potential learning blocks and opportunities for support.Physically and verbally interacted with students\nthroughout the day to keep them engaged.Helped prepare daily lesson plans for activities and lessons.Implemented emergent curriculum Supplied\none-on-one attention to each student, while maintaining overall focus on the entire group.Physically and verbally interacted with students throughout\nthe day to keep them engaged.Communicated effectively with educators from various grade levels.Wrote daily and weekly lesson\nplans.Administered minor first aid to injured students.to encourage student participation.Organized field trips to local parks, fire stations and\nzoos.Maintained daily records of children's individual activities, behaviors, meals and naps. Established a safe play environment for the\nchildren.Distributed quarterly educational assessments, similar to report cards, to each parent.Developed professional relationships with parents,\nteachers, directors and therapists.Observed children for signs of illness, injury, emotional disturbance, learning disorders and speech\nproblems.Maintained daily records of children's individual activities, behaviors, meals and naps.\nTeacher aide Aug 1999 to Mar 2001\nCompany Name ï¼​ City , State\nPromoted language development skills through reading and storytelling.Applied the positive reinforcement method to redirect negative\nbehaviors.Conducted small group and individual classroom activities based on differentiated learning needs. Organized field trips to local parks, fire\nstations and zoos. Assisted 5-6 children per station during small group learning periods.Encouraged students to be understanding of and helpful to\nothers.Observed students to supply teachers with feedback regarding potential learning blocks and opportunities for support.Physically and\nverbally interacted with students throughout the day to keep them engaged.Supported students in developing strategies for individual needs and\nclassroom group dynamics.Helped prepare daily lesson plans for activities and lessons. Implemented emergent curriculum to encourage student\nparticipation. Supplied one-on-one attention to each student, while maintaining overall focus on the entire group.Communicated effectively with\neducators from various grade levels.Wrote daily and weekly lesson plans.Administered minor first aid to injured students.Maintained daily records\nof children's individual activities, behaviors, meals and naps.Established a safe play environment for the children.Created and implemented\ndevelopmentally-appropriate curriculum that addressed all learning styles.Distributed quarterly educational assessments, similar to report cards, to\neach parent.Maintained a child-friendly environment with access to outdoor activities.Completed all required documentation for the National Head\nStart program.\nExtra-Curricular Activities\nI ran the nursery at my church for a yea and then taught Sunday school for the older kids for another two years .\nI also helped run an after school \"get your homework done here\" program the community started where kids that didn't have help at home could\ncome to us and get help with their homework or for the younger children the parents could enroll them and they would come daily after school.",
    "summary": "Talented early education professional with diverse experience in planning and implementing various activities for promoting physical, social,\nemotional and intellectual growth of children."
  }
}