{
  "file_name": "11616482.pdf",
  "sections": {
    "general": "GUEST TEACHER\nProfessional Overview\nA detail - oriented, high energy Social Science Teacher with the ability to motivate students to work at optimum levels while maintaining a\ncomfortable, creative environment, and keeping a clear perspective of goals to be accomplished. Experience in helping students broaden\nperspectives through aligning subject matter to present day experience and events.\nCore Qualifications\nCreative lesson planning Differentiated learning\nExcellent relationship building skills Positive and encouraging\nExperiential learning Able to work independently and as a member of a team\nInterpersonal, oral, and written communication skills Curriculum lesson plan development\nAccomplishments\nSecondary 7-12 Social Studies.\nIssued: 11/17/15.",
    "education": "MBA , Business 2006 University of Nevada ï¼​ City , State Business\nBachelor of Science , Education Social Science Emporia State University ï¼​ City , State Education Social Science",
    "experience": "Guest Teacher Jan 2015 to Current\nCompany Name ï¼​ City , State\nManaged classroom responsibilities and maintained continuity of the learning process.\nIncorporated cooperative education and role playing activities to establish a relationship between course material.\nand student's life experiences.\nEncouraged critical thinking skills through the use of challenging debate.\nNational Account Manager Jan 2005 to Jan 2014\nCompany Name ï¼​ City , State\nPromoted to develop deeper HQ & regional relationships and grow gaming and lodging business channel.\nManaged the relationships between Starbucks Coffee and MGM International, Caesars Entertainment, StationÂ Casinos, Intercontinental Hotels,\nHilton Hotels.\nCredited with Starbucks Coffee store growth along Las Vegas strip from zero base to present day $105mm annual revenue.\nBuilt strategic alliances with internal and external teams that resulted in sustained revenue growth over 14 Yrs.\nRegional Sales Manager Feb 2000 to Jan 2005\nCompany Name ï¼​ City , State\nLed internal cross-functional and external teams to ensure franchise store growth and timely store openings and execution of foodservice\nagreements for regional business in California, Nevada and Arizona.\nEstablished lodging and gaming as a viable business segment for Starbucks Coffee Company.\nAccomplishments Leveraged corporate executive relationships to launch customized, franchise stores for high profile casinos and lodging\nbusiness partners.\nExpand customer and product base beyond franchised locations to eventually secure corporate distribution mandates resulting in excess\n$105 million in ongoing annual revenues for gaming and lodging segment.\nIncrease number of license stores along the Las Vegas strip from 1 to 51 high volume locations.\nPresented comprehensive instructional seminars at regional and national meetings.\nTopics included site selection, product placement from a branding perspective, building a business case to show ROI, contract compliance,\nand identifying new distribution opportunities.\nLed internal cross-functional and external teams to ensure franchise store growth and timely store openings.\nEstablished lodging and gaming as a viable business segment for Starbucks Coffee Company.",
    "publications": "Oral History\nwww.lawrence.lib.ks.us/oralhistory/nether.html Â\nPresentations\nCorporate Culture\nhttps://www.youtube.com/watch?v=TAtH6y7ebDo\nMemberships/Scholarly Societies\nFraternity\nwww.lasvegasnupes.com/curtisnether.html Â",
    "skills": "branding, business case, Interpersonal, oral, critical thinking, functional, lesson planning, meetings, Microsoft Office, Outlook, relationship building,\nseminars, written communication skills"
  }
}