{
  "file_name": "11650031.pdf",
  "sections": {
    "general": "HYDROBLASTING TECHNICIAN 1\nCareer Objective\nAn enthusiastic, team oriented and polished professional seeking employment with a company that values a proactive attitude and solid ambition. I\nam seeking a rewarding career allowing me to contribute to the growth of the company by increasing productivity and ensuring employer's key\nobjectives are met.\nSummary of Skills\nCarpentry Excellent Leadership skills\nBuilding Maintenance Customer Service Oriented\nEnvironmental Coordination Efficient Time Management\nAdherence with all Safety Regulations Effective Problem Solving",
    "experience": "Company Name June 2014 to Current Hydroblasting Technician 1\nCity , State\nProperly operates hoses on vacuum trucks; hydroblasting guns; and manipulate controls on robotic equipment. Prepare jobsite for hydro\nblasting. Monitor hydroblasting operations.\nPerform job duties in a safe manner, in compliance with policies, procedures and practices. Wear personnel protective equipment (PPE) as\ndefined by state regulations.\nCorrect deficiencies that may cause accidents, injuries, lost productivity or harm to equipment or that are inconsistent with client's\nrequirements. Assist with hydroblasting and tank cleaningÂ in various refineries.\nCompany Name November 2012 to June 2015 Construction Assistant\nCity , State\nPerformed prep work including masking, sanding and filling holes. Interior and exterior painting.\nBuilt and placed plywood/wall systems; installed doors and windows.\nConstructed concrete forms, poured concrete by pump and bucket barrowed or shoveled. Utilized jack hammers, compressors and power\ntools for daily task.\nCompany Name June 2012 to Current Building Maintenance\nCity , State\nPerform general building maintenance to include but not limited to theÂ building grounds, landscaping as well as pressure washing.\nUses various hand and power tools to repair faucets, plumbing and lighting fixtures.\nRespond quickly to emergency situations and customer concerns.",
    "education": "Knowledge-First Empowerment Academy August 2016 High School Diploma : General Education",
    "certifications": "Basic Plus Safety - July 2016\nTWIC - April 2012\nNCCER - June 2010"
  }
}