{
  "file_name": "12021752.pdf",
  "sections": {
    "general": "SENIOR INVESTMENT BANKING SALES ANALYST",
    "summary": "To obtain a sales position utilizing my sales, leadership, consultative, and strategic thinking strengths.",
    "experience": "Senior Investment Banking Sales Analyst\nMay 2013 to Current Company Name ï¼​ City , State\n2014 Quota Attainment - 195% Outside sales of Investment Banking solutions including financing, mergers, and acquisitions Closed over\n$70 Million in strategic Investment Banking solutions to the renewable energy vertical Strategically partnered with investors, developers,\nbusinesses, and municipalities to close and accelerate deals Project managed entire sales cycle from finding and qualifying the opportunity, to\nsecuring financing and government incentives, to reviewing due diligence and closing the deal Collaborate with internal execution team to\naccelerate sales by working on deal structuring and transaction cost management.\nInvestment Banking Sales Analyst\nFebruary 2012 to May 2013 Company Name ï¼​ City , State\n2012 Quota Attainment - 167% Outside sales of Investment Banking solutions including financing, mergers, and acquisitions Closed over\n$40 Million in strategic Investment Banking solutions to the renewable energy vertical Strategically partnered with investors, developers,\nbusinesses, and municipalities to close and accelerate deals Project managed entire sales cycle from finding and qualifying the opportunity, to\nsecuring financing and government incentives, to reviewing due diligence and closing the deal Collaborate with internal execution team to\naccelerate sales by working on deal structuring and transaction cost management.\nInvestment Sales Analyst\nJanuary 2011 to February 2012 Company Name ï¼​ City , State\n2011 Quota Attainment - 240% Responsible for building, maintaining, and sales related to a $10 Million Managed REIT Hedge Fund\nConduct quarterly credit analysis and reviews for company and investors to build successful long term partnerships Created detailed\nreporting and compliance reporting including financial statements and fund performance Implemented Global Investment Sales and\nPerformance Standards across the firm.\nRegistered Investment Representative\nMarch 2009 to January 2011 Company Name ï¼​ City , State\n2010 Quota Attainment - 180% Responsible for assisting in sales and research for multiple hedge funds Created weekly portfolio attribution\nreports based on asset type and REIT operating sector to assist with securing new clients Enforced compliance of internal code of ethics\nSupported portfolio manager's investment thesis by analyzing and concluding that REIT preferred shares outperformed common shares\ndirectly after equity offerings in the beginning of the second quarter 2009 Surveyed over 330 properties and projected revenues for future\nperformance.\nOutside Sales Representative\nJune 2008 to April 2009 Company Name ï¼​ City , State\nResponsible for booking over $100K in revenue.\nFull-service tour operator specializing in trips to Mexico as well as College Football game day trips.\nArranged travel for over 100 clients and successfully negotiated multiple sales and marketing contracts.\nDoor Knocked and walked up to people to drive sales.\nFinancial Analyst\nDecember 2008 to January 2009 Company Name ï¼​ City , State\nCreated $3.4 million Real Estate Development proposal for a multi-family residential community in San Antonio.\nCreated an asset-level pro-forma and financial model to achieve target IRR's of 18% or better.\nCompeted and defended proposal in the National NAHB Competition in Las Vegas.",
    "education": "Bachelor of Science : Finance , December 2009 Arizona State University, W.P. Carey School of Business ï¼​ City , State GPA: Magna Cum\nLaude, Dean's List, Tempe Diablo's Scholarship recipient Finance Magna Cum Laude, Dean's List, Tempe Diablo's Scholarship recipient",
    "interests": "Endowment Fund Chair Outstanding Graduating Senior Raised over $1,500 dollars through fundraising and business sponsorships Participated in\nnumerous community service events like Habitat for Humanity, Project Cure, and Ronald McDonald House President Barack Obama Scholar's\nProgram Mentor, Student mentor to President Obama Scholarship Program recipient",
    "skills": "acquisitions, closing, contracts, credit analysis, clients, due diligence, equity, financing, financial, financial statements, funds, government, Investment\nBanking, marketing, mergers, Outside sales, proposal, Real Estate, reporting, research, Sales, San, strategic, type\nAdditional Information\nDelta Sigma PI: Endowment Fund Chair Outstanding Graduating Senior Raised over $1,500 dollars through fundraising and business\nsponsorships Participated in numerous community service events like Habitat for Humanity, Project Cure, and Ronald McDonald House\nPresident Barack Obama Scholar's Program Mentor, Student mentor to President Obama Scholarship Program recipient"
  }
}