{
  "file_name": "12351749.pdf",
  "sections": {
    "general": "SALES COORDINATOR",
    "summary": "Current MS of Data Analytics graduate student with exposure to data analysis and modeling skills. Seeking evolutionary role in analytics that will\nallow to adapt and change to company and problem solving needs.",
    "skills": "Business systems analysis, C++, cold calling, communication skills, competitive, contracts, credit, clientele, client, clients, Data Analyst, Data\nCollection, database, drafting, features, Finance, financial, financial statements, Interpretation, Machine Learning, market, Excel, Money, MS\nOffice Suite, modeling, oil, outside sales, pricing, Coding, proposals, recruiting, research, sales, staffing, statistical analysis, Statistics, Tableau,\ntables, telephone, underwriter",
    "experience": "Sales Coordinator Jul 2016 to May 2017\nCompany Name ï¼​ City , State\nHeavy cold calling to new and existing oil and gas, energy, and aerospace clientele to increase revenue and market penetration Managed a\nportfolio of 250 accounts that generated 36% of increased proposals in 4 months.\nConducted business to business telephone sales.\nResearched sales and contact information for prospects and created reports for business development managers\nInside Sales Representative Aug 2015 to Feb 2016\nCompany Name ï¼​ City , State\nPrioritized daily workflows, including all inbound calls, quotes and sales-related inquiries.\nWrote sales contracts for orders obtained and submitted orders for processing.\nAchieved 170% of first 90 day quota, earning 2nd highest rookie quarter in 21 year company history.\nPrioritized daily workflows, including all inbound calls, quotes and sales-related inquiries.\nEmphasized product features based on analysis of customers' needs.\nInside Sales Representative Sep 2014 to May 2015\nCompany Name ï¼​ City , State\nDeveloped competitive comparison tables of steel grating pricing, fees, ratings, category and product performance to use for account sales\ncalls.\nCreated sales contacts with on- and off-premise accounts.\nBuilt client relationships by acting as the liaison between the drafting and sales teams.\nConsulted with clients after sales and contract signings to resolve problems and provide ongoing support.\nRecruiter Feb 2007 to Oct 2014\nCompany Name ï¼​ City , State\nDeveloped creative recruiting strategies that met small to mid-sized broker dealer staffing needs.\nManaged all aspects of advisor transition cycle, from initial set to on boarding.\nServed as link between broker dealer and advisor by handling questions, interpreting contracts, and resolving transition issues.\nMemberships/Scholarly Societies University of Houston- Downtown Analytics Society."
  }
}