{
  "file_name": "12613221.pdf",
  "sections": {
    "general": "SLEEP TECHNOLOGIST, RPSGT",
    "summary": "Healthcare professional with more than ten years' experience seeking an opportunity where I can utilize my skills and knowledge in multiple\nhealthcare settings to have a positive impact impact on patient outcomes. Looking for a work setting in health information management and\ntechnology where my previous training in HIPPA Privacy and Security, performance improvement and quality assurance will help position me for\ncareer advancement.\nHighlights\nMember of AHIMA\nMember of ILHIMA\nMember of HIMSS\nMember of HFMA\nMore than ten years healthcare experience\nCPR Certified\nNeed minimal supervision\nAnalytical\nCritical\nEHR experience",
    "skills": "Billing, communication skills, CPR Certified, CPR certified, critical thinking, disease management, EHR experience, inventory control, managing,\nmedical terminology, Windows OS, Works, patient evaluation, patient preparation, problem solving, Respiratory Therapy, strategic planning,\nsupervision, therapy, troubleshooting",
    "experience": "Sleep Technologist, RPSGT 12/2015 to Current Company Name City , State\nPolysomnogram preparation and set up, diagnostic testing,.\nPAP and oxygen titration studies, monitoring and scoring complete patient.\nstudies using AASM standards, Interscore Reliability Testing 92% average (expected 85%), CPR.\ncertified, data transfers, Windows OS, work diligently with minimal supervision in a 1:2 technologist to patient ratio.\nNeurophysiology Technician, RPSGT 01/2009 to 11/2015 Company Name City , State\nPerforming EEG and LTM.\nMeasuring in 10-20, patient preparation and education, monitor and note abnormalities.\nSleep study preparation & set up, prepare & calibrate equipment prior to testing, following AASM protocol for MSLT, MWT, PAP and\noxygen studies, assist with scoring sleep studies, fluent communication skills, sharp critical thinking skills, diligently work with minimal\nsupervision.\nBilling patients in outpatient sleep center.\nHealthcare Specialist, CRT 09/2005 to 12/2008 Company Name City , State\nClinical patient evaluation in home setting, implement disease management programs, respiratory & sleep equipment set up and education,\nfluent communication skills, sharp critical thinking skills, diligently work with minimal supervision.",
    "education": "May, 2000 Hannibal La-Grange University City , State Applied Associates Degree of Science Respiratory Therapy Graduate as Valedictorian of\nRespiratory Therapy Class *Winner of John Rodgers Memorial Scholarship\nBachelor of Science : Healthcare Information Management & Technology 1999 2017 University of Wisconsin City , State Healthcare Information\nManagement & Technology"
  }
}