{
  "file_name": "12791244.pdf",
  "sections": {
    "general": "PHYSICAL THERAPY AIDE",
    "summary": "Experienced Physical Therapist Technician in patient aide and well-being. A quick learner capable of handling a fast-paced setting as well as\nstressful environment. A facility will benefit from my responsible, reliable and dedicated team player approach as well as the ability to work\nindependently when necessary. My skills of establishing and maintaining relations with supervisors, coworkers and clients/patients will help the\norganization to provide great patient care as well as excellent customer service. Prior personal trainer certified in Zumba Gold, Zumba Toning and\nZumba Kids.",
    "experience": "Physical Therapy Aide 05/2017 to 07/2017 Company Name City , State\nAided the PTA's and OTA's with their patient treatment and or program.\nTransported and or escorted patients to and from the therapy room.\nAssisted PTA's and OTA's with facility cleanliness and equipment maintenance.\nFitness Instructor & Trainer/ Front Desk Staff/ Group X Manager 09/2009 to 07/2017 Company Name City , State\nTaught - Zumba, Zumba Toning, Zumba Gold and Zumba Kids.\nLaunched \"Zumba Gold\" program for senior citizens 55 and older at Facility.\nOffered one-on-one fitness consultations.\nWorked to recruit new members to facility and group X classes.\nCustomer service, sales, answered phones and handled onsite daily task.\nAssistant Manager 05/2000 to 05/2003 Company Name City , State\nMaintained store staff by recruiting, selecting, orienting, and training employees.\nAchieved financial objectives by preparing an annual budget; scheduling expenditures; analyzing variances; initiating corrective actions.\nIdentified current and future customer requirements by establishing a rapport with potential and actual customers to understand service\nrequirements.\nEnsured availability of merchandise and services by approving contracts which help to maintain inventory.\nFormulated pricing policies by reviewing merchandising activities; determining additional needed sales promotion; authorizing clearance\nsales; studying trends.\nAdministrative Assistant 11/1994 to 07/1996 Company Name City , State\nGreeted clients, performed client outreach, and maintained updated contact information.\nStreamlined incoming communications; answered and directed calls.\nMade travel arrangements and create itineraries.\nManaged calendars and schedules; booked and coordinated appointments.\nHandled expense reporting, accounts payable/receiving, and invoice processing.\nScheduled and organized logistics for meetings.\nConducted research and compiled material for presentations, reports, and other documents.\nPurchased and distributed office supplies; managed vendor relationships.\nMaintained office facilities; troubleshot and diagnosed issues.\nSenior Cashier 07/1993 to 08/2000 Company Name City , State\nSupervised the performance of 10-14 employees.\nDistributed cash between two to six registers.\nCounted all sales, recorded merchandise, and sales receipts.\nIn charge of cash revenues and merchandise, including cash drops and merchandise logs.\nProvided excellent customer service.\nProven ability to answer customer questions and give information regarding the business procedures and policies in an exact and customer-\nfriendly way.\nWorked closely with Accounting Department assisting with loss mitigation.\nEducation and Training\nBachelor of Science : Allied Health 2020 Ashworth College\nCertificate Physical Therapy Aide : Allied Health 2017 Norwalk Community College City , State , USA\nAssociate of Science : Marketing Management Bronx Community College City , State , USA",
    "skills": "Accounting, accounts payable, ABC, budget, contracts, CPR certified, client, clients, excellent customer service, Customer service, training\nemployees, equipment maintenance, expense reporting, financial, maintain inventory, invoice processing, logistics, meetings, merchandising, MS\nOffice, office, patient treatment, Physical Therapy Aide, policies, presentations, pricing, promotion, rapport, receiving, recruiting, research, sales,\nscheduling, phones, therapy, travel arrangements, written communication skills."
  }
}