{
  "file_name": "13037145.pdf",
  "sections": {
    "general": "SOCIAL MEDIA AGENT",
    "summary": "College prepared student with over three years of front line customer service experience, excellent communication skills, with strong work ethic.\nLooking for opportunities in Corporate America to develop as a career professional where training, coaching, and mentoring opportunities are\navailable. Teachable and quick to learn taking on new roles and responsibilities with flexible schedule. *Detail and Deadline Oriented *Critical\nThinking *Superior Writing Skills\nHighlights\nMicrosoft Office Suite *Avaya Phone System *Very accurate and rapid keyboarder *Sprout Social Media Management",
    "experience": "10/2015 to Current\nSocial Media Agent Company Name ï¼​ City , State\nTrained and work directly with MetroPCS HQ Build social media posts, advertising and promotions across social media platforms Engage\nin customer service via Facebook, Facebook Latino, Twitter and Instagram Monitor online public relations and continuously send in 'Hot\nTopics' to create new content online Sponsorship coordinator Escalate customer concerns directly to MetroPCS markets nationwide.\n01/2014 to 01/2015\nCustomer Appreciation Team Agent Company Name ï¼​ City , State\nRetention department for Metro PCS Cell Phone Company Inbound and outbound calls Answered customer service calls, and\nescalated/supervisor calls Floor walker in a call center environment to assist training agents Worked with upper management to ensure\nappropriate changes were made to improve customer satisfaction.\nMade reasonable procedure exceptions to accommodate unusual customer requests.\n01/2013 to 01/2014\nFloor Associate Company Name ï¼​ City , State\nExecuted store initiative related to sales, service, and customer experience.\nMet and exceed assigned customer experience and reputation and productivity targets.\nResolved or escalated any customer service issues.\nResponsible for display maintenance, shelf maintenance, and store housekeeping.\n01/2011 to 01/2012\nFront Desk Customer Service Company Name ï¼​ City , State\nFace-to-face customer service General office duties Inbound and outbound calls Customer account relations Customer enrollments and\nsales Accurately and efficiently completed all sales transactions.",
    "education": "2015\nRichland College\n2014\nWinfreee Academy Charter School\n2011\nBerkner High School",
    "languages": "Bilingual: Spoken and written form English and Spanish",
    "skills": "advertising, Avaya, call center, Cashier, content, customer satisfaction, customer service, English, General office duties, Microsoft Office Suite,\nPhone System, public relations, sales, social media platforms, Spanish, supervisor, Phone, written"
  }
}