{
  "file_name": "13212436.pdf",
  "sections": {
    "general": "PERSONAL/ PRIVATE CHEF\nProfessional Summary\nEXECUTIVE CHEF __________________________________________ With more than 29 years of expertise at the forefront of restaurant\noperations and menu development, I bring an innovative approach to restaurant's, catered events and hospitality services – one that focuses on\ncost-effectiveness in food and labor, with quality to deliver impactful and exceptional cuisine. My background includes Mexican, Italian, Japanese,\nAmerican, and fusion of all those cuisines, with broad experience in line management, staffing, new restaurant development and menu planning.\nFine dining, scratch kitchens, Catering onsite and offsite 100-20000 people at any given time, retail food outlets, concessions and QSR's",
    "skills": "Kitchen Design & Workflows\nOperations Management\nProduct Costing / Cost Control\nInnovative Menu Development\nTeam Building & Leadership\nQuality & Customer Service\nNew Restaurant Openings 7\nRevenue Growth / P&L\nPerformance Management\nIMenuPro\nAloha\nMicrosoft Office Suite\nSolomon\nQuest\nETeac\nEventmaster\nCaterease\nFood plating and presentation\nForecasting and planning\nKitchen equipment operation and maintenance\nOperations management\nBusiness process, Negotiation, Unique\nCom, Operations Management\nCA, Optimization\nCooking, Performance Management\nCost Control, Personnel\nClients, Processes\nClient, Purchasing\nCustomer Service, Quality\nDC, Quality control\nDirection, Quality management\nEnglish, Quest\nFinancial management, Reception\nFocus, Recruitment\nGreek, Research\nItalian, Retail\nKronos, Sales\nTeam Building, Scheduling\nRecipes and menu planning\nPayroll and scheduling\nMenu planning\nWork History\nPersonal/ Private Chef , 01/2019 to Current\nCompany Name – City , State\nTraveling around the LA and Orange County cooking for parties of 2 to 50.\nPlated, buffet, family style or food stations, plus more.\nSourcing wild and sustainable meats, fish, and poultry.\nWith organic produce, to produce a memorable event.\nExecutive Chef , 07/2018 to 01/2019\nCompany Name – City , State\nMy goals and direction needed for this 5-million-dollar operation was to bring high quality, innovative, whimsical comfort food that's\ninteractive for the client/guest experience, bringing contemporary California-Italian fusion cuisine, with an emphasis on local farms and\nbusinesses using sustainable meats and seafood.\nLounge, Café, Grill and Banquets are the revenue streams for this property.\nAlso drove dramatic cost saving of labor and food cost, currently trending at 34% food cost and 9% labor cost Selected Achievements:.\nCompletely revamped menu, brought in fresh ingredients and new ideas, changed menu seasonally.\nExecutive Chef/ Director of Culinary , 01/2015 to 03/2018\nCompany Name – City , State\nMy focus for this 26-million-dollar operation was to bring high quality, innovative food so clients and customers feel like they are not in a\nconvention center atmosphere.\nWhimsical comfort food that's interactive for the client experience, bringing contemporary California Cuisine, with an emphasis on local\nfarms and businesses with sustainable meats and seafood.\nOver saw 100+ employees and 6 chefs daily.\nExecution of catering, concessions and offsite functions from 200-20000 people.\nDrove dramatic cost savings and optimization, including running a food cost of 20% and a labor cost of 8% of gross food sales only.\nRevitalized the menu to bring a fresh approach to our branding mantra, chef inspired and culinary driven, creation and implementation of 2\nnew catering menus, as well as multipletailored menus to client specifications.",
    "education": "AOS : Culinary Arts & Hospitality Management , 1997\nCalifornia Culinary Academy - City , State\nHigh School Diploma : 1993\nMary Star of the Sea High School - City , State"
  }
}