{
  "file_name": "13637605.pdf",
  "sections": {
    "general": "SALES ASSOCIATE/CASHIER",
    "summary": "Friendly Sales Associate proficient in managing all areas of sales and customer service in fast-paced retail environments. Excellent multi-\ntasker and team player.\nReliable Sales Associate with strengths in inventory management, training, and customer service. Friendly, knowledgeable and hard-working\nteam player.",
    "skills": "client, Detail oriented, Team leadership, phone",
    "experience": "09/2017 to Current\nSales Associate/Cashier Company Name ï¼​ City , State\nMet incoming customers and provided immediate assistance.\nRetrieved alternate items and sizes on request.\nListened to customer needs and preferences to provide accurate advice.\nCompleted purchases with cash, credit and debit payment methods.\nIncreased purchase totals by recommending additional items.\nWorked flexible schedule to accommodate changing customer levels.\nOrganized items in visually appealing manner.\nAnswered incoming telephone calls with professional andÂ knowledgeable responses.Â\nMaintained up-to-date knowledge of customer buying habits.\n09/2015 to 12/2015\nCashier Company Name ï¼​ City , State\nI up-sold additional menu items, beverages and desserts to increase restaurant profits.\nTook necessary steps to meet customer needs and effectively resolve food or service issues.\nI also recorded customer orders and repeated them back in a clear, understandable manner and promptly reported complaints to a member\nof the management team.\nI communicated clearly and positively with co-workers and management and resolved guest complaints promptly and professionally.\nI quickly and efficiently processed payments and made accurate change.\n09/2015 to 12/2015\nCompany Name ï¼​ City , State\nI up-sold additional menu items, beverages and desserts to increase restaurant profits.\nTook necessary steps to meet customer needs and effectively resolve food or service issues.\nI also recorded customer orders and repeated them back in a clear, understandable manner and promptly reported complaints to a member\nof the management team.\nI communicated clearly and positively with co-workers and management and resolved guest complaints promptly and professionally.\nI quickly and efficiently processed payments and made accurate change.\nEducation and Training\n2017\nHigh School Diploma : Education Waynesboro Area Senior High School ï¼​ City , State , USA Education"
  }
}