{
  "file_name": "13764840.pdf",
  "sections": {
    "general": "BRAND MANAGER",
    "summary": "Brand manager with a strong merchandising background. Experience in business development, sales and marketing. Understands and excels at\nanalytical and creative thinking.\nHighlights\nEntrepreneurial thinkerÂ\nExcellent time management skills\n?Self-motivated\nStrong communicator\nGoal-oriented",
    "experience": "07/2015 to Current\nBrand Manager Company Name\nLeads in the analysis and development of merchandising strategies across all categories with a focus on sales, gross margin, conversion,\ncustomer retention and acquisition\nDevelops and manages relationships with top level accounts while establishing new and cultivating existing business accounts\nPartners with Merchandise Planning on all forecast changes and margin challenges to achieve financial targets\nCollaborates with e-commerce and marketing teams to ensure that on-site and email promotions reflect merchandising and brand strategies\nSecures and builds strategic brand partnerships\n11/2013 to 06/2015\nAssociate Omni Buyer, Men's Nautica Sportswear Company Name - City , State\nDeveloped annual financial plans at the classification and vendor level\nStrategized custom assortments to meet sales and margin plan\nIdentified product and trend opportunities within classifications\nStrategized key items and promotions; negotiated product availability, distribution and pricing to maximize profits and margin\n07/2012 to 10/2013\nAssistant Buyer, Men's Dress & Casual Pants Company Name - City , State\nAssisted buyer in monthly forecasting at vendor and department level\nTracked and managed receipt flow process\nCommunicated with vendor partners for newness and timely deliveries\nPlanned and coordinated weekly marketing events for all categories\n10/2010 to 06/2012\nAssistant Planner, Women's Shoes Company Name - City , State\nDetermined and executed replenishment allocation strategies to maintain healthy stock levels for over 500 individual stores\nWorked with vendors on securing additional inventory to drive sales",
    "education": "2010\nBachelor of Arts : Strategic Communications Elon University - City , State",
    "skills": "Microsoft Excel\nMicrosoft PowerPoint\nMicrosoft Word\n?"
  }
}