{
  "file_name": "13837784.pdf",
  "sections": {
    "general": "DIGITAL MEDIA BUYER\nProfessional Summary\nVersatile digital marketerÂ bringing\nHighlights\nSproutSocial\nPay Per Click (PPC)\nHootsuite\nGoogle Adwords\nMarin Software\nGoogle Analytics\nDrupal\nContent Marketing\nWordPress\nSocial Media Marketing - Facebook, LinkedIn, Instagram\nHTML\nROI Reports\nOptimizely\nMS Office - Excel, Word, Powerpoint, Outlook\nLanding Page Management\nPPC Bid Management\nA/B Testing\nLead Generation\nMultivariate Testing\nMobile Marketing\nContent Writing\nVideo Marketing\nBlogging",
    "experience": "Company Name City , State Digital Media Buyer 03/2016 to Current\nOversees and co-manages PPC campaigns across multiple search engine platforms for three beauty school directory websites.\nCreates, implements, and manages all organic social profiles and paid social campaigns (Facebook, Instagram, Twitter, Pinterest, etc.)\nstrategies for beauty school directory websites.\nOrganizes and creates monthly blog and photo content for social profiles and blog site.\nPartners with Creative Director to create original content and to promote new brand across social platforms.\nSuccessfully increased brand awareness on Instagram and increased follower growth by over 400% within the first month of managing\nsocial account.\nAttends online and local marketing seminars to actively keep up with industry changes and trends.\nCompany Name City , State Digital Media Buyer 11/2014 to 03/2016\nManaged over 10 different education clients' paid social media and paid search accounts across multiple platforms.\nEffectively budgeted and managed over $500,000 per month in client money to implement throughout search and social campaigns.\nConsistently hit client lead goals and CPI goals each month with each client's given budget.\nCreated and delivered paid social and paid search strategy performance reports for clients and senior management.\nCommunicated directly with client services team and clients regarding account management and performance.\nCompany Name City , State Sales Associate 06/2014 to 10/2015\nCreated and managed social media accounts across multiple platforms.\nHelped increase brand awareness and advertised product promotions to current customers.",
    "education": "Bachelor of Arts : Communication Business University of Missouri , City , State Communication Business",
    "skills": "account management, photo, budget, content, CPI, Creative Director, client, clients, Drupal, senior management, HTML, Internet Marketing,\nmanaging, marketing, Excel, money, MSOffice, Outlook, PowerPoint, Word, Page, seminars, strategy, websites, Content Writing"
  }
}