{
  "file_name": "13915715.pdf",
  "sections": {
    "general": "ASSISTANT COMPANY SECRETARY",
    "summary": "Reliable Legal Secretary successful at maintaining complex docket systems, tracking deadlines and coordinating depositions. Organized Legal\nSecretary adept at managing multiple high priority tasks. Expert in preparing legal documents such as briefs, motions and subpoenas.\nHighlights\nMicrosoft Office - MS Words, Power Point, Excel, Access, Publisher SPSS 16.0 Interpersonal Skills",
    "experience": "Assistant Company Secretary Apr 2016 to Current\nCompany Name ï¼​ City , State\nAddress : SH 6A, Jalan Mutiara, Taman Bukit Ampang, Jalan Bukit Belacan, 68000 Ampang, Selangor.\nExecutive Secretarial Aug 2014 to Jul 2015\nCompany Name ï¼​ City , State\nAddress:Â Level 8, Symphony House Pusat Dagangan Dana 1, Jalan PJUÂ Â Â Â Â Â Â Â Â Â Â Â Â 1A/46, 47301 Petaling Jaya,\nSelangor Darul EhsanÂ\nAssistant Company Secretary Oct 2012 to Jun 2013\nCompany Name ï¼​ City , State\nNo. 7-1F, Jalan Boling Padang G 13/G, Seksyen 13, 40100 Shah Alam.\nPRACTICAL STUDENT Jan 2012 to Mar 2012\nCompany Name ï¼​ City , State Address: Tingkat 3, Menara Selatan, Bangunan Sultan Idris Shah, PersiaranÂ Â Masjid, 40676 Shah Alam,\nSelangor Darul Ehsan.",
    "education": "MAICSA , PROFESSIONAL LEVEL Malaysia Institute of Chartered Secretary ï¼​ City , State , MALAYSIA\nBACHELOR IN CORPORATE ADMINISTRATION , CORPORATE ADMINISTRATION 2012 Universiti Teknologi MARA ï¼​ City ,\nState , MALAYSIA\nCORPORATE ADMINISTRATION\nSECRETARIALÂ\nMANAGEMENT AND OFFICE MANAGEMENT\nPUBLIC RELATION\nDIPLOMA IN PUBLIC ADMINISTRATION , PUBLIC ADMINISTRATION 2010 Universiti Teknologi MARA ï¼​ City , State ,\nMALAYSIA\nPOLICY AND ADMINISTRATION\nOFFICE MANAGEMENT\nHUMAN RESOURCES\nAccomplishments\nPractical Student Courses And Seminar Extended 2012 Participate in Mock Meeting Competition at Dewan Serbaguna FSPPP, UiTM\nShah Alam.\nCommitee of Melati Computer Club 2010 Paricipate in Program DiPAC Society Tour at Sekolah Pendidikan Khas Alma, Pulau Pinang\norganized by Faculty of Adminstrative Science & Policy Studies UiTM Kedah.\nParticipate in Sukan Inter Program 2009 at Kompleks Sukan & Stadium MiniUiTM Kedah, organized by Majlis Sukan Pelajar UiTM\nKedah.\nParticipate in Ceramah Teknik- Teknik Asas Ping Pong organized by Persatuan Ping Pong UiTM Kedah at UiTM Kedah.\nParticipate in Karnival Sukan Mahasiswa UiTM Semalaysia Kali ke-16/2008 at UiTM Perak, oganized by UiTM Malaysia.\nIntroductory English in Akademi Pengajian Bahasa, Universiti Teknologi Mara Pulau Pinang.\nKursus Aplikasi Komputer (Pakej 2) Pengenalan kepada Komputer, MS WORD 2000, MS EXCEL 2000, MS POWER POINT 2000 in\nPusat Computer RC, Permatang Pauh, Pulau Pinang.\nProgram Rakan Muda Wawasan Desa IPT Daerah Seberang Perai Tengah at JKKK Alma/ Bukit Minyak, Bukit Mertajam.\nPertandingan & Pameran Seni Lukis Pelajar - Pelajar Malaysia - Jepun ke - 11Â Jabatan Pendidikan Pulau Pinang.\nProgram Rakan Muda Ramadan, Kementerian Belia dan Sukan Malaysia.",
    "interests": "Possess strong leadership charismatic.\nPossess strong sense of responsibility.\nAble to work hard.\nAbility to work independent or in a group.\nSelf-reliance, hardworking and resourceful.\nWilling to work for long hours and moderate traveling.\nLove to learn something new.\nIntermediary language:- Malay language - Speaking and Writing English language - Speaking and writing Basic in Arabic\nInterest and Activity Reading, Watching, Listening\nExtracurricular Activities\nTresury of Ping Pong Club UiTM Kedah.\nSpecial Force of Diploma in Public Administration Club (DiPAC) Commitee of Team Building Programme at Pendang Lake Resort,\norganized by DiPAC UiTM Kedah.\nTresury of Ping Pong Club UiTM Kedah.\nSpecial Force of Diploma in Public Administration Club (DiPAC) Fasilitator for Program Transformasi SKKP at Emerald Puteri Hotle,\nSungai Petani organized by Sekolah kebangsaan Kampong Pasir, and DiPAC Uitm Kedah, Kedah.\nTeam Manager of \"UiTM Kedah Netball Open 2008\", organized by Persatuan Bola Jaing UiTM Kedah, UiTM Kedah, Kedah.Â",
    "skills": "Interpersonal Skills, Managing, Access, Excel, Microsoft Office, Power Point, Publisher, MS Words, PUBLIC RELATIONS, PUBLICATION,\nSPSS, Supervisor, SYMPHONY"
  }
}