{
  "file_name": "13964744.pdf",
  "sections": {
    "general": "TEAM LEAD SENIOR ANALYST\nProfessional Summary\nMBA in Business Management, Finance & M.S in Information technology Professional Summary: Overall 7+ years of experience in implementing\nand supporting Information technology operations and multiple business projects for Google Maps, Wipro for client Hewlett Packard. Over 4\nyears of experience in project management / operations management in leading multiple small scale and large projects by staffing and resource\nplanning, managing metrics, people management, project life cycle. Managing day to day operations and KPI for the project and delivering in\nspecific time frame. Determine and analyze process requirements and develop functional needs for the processes. Worked with cross functional\nteams for 5 years includes training, technical, quality, metadata, tech-stop and other cross functional teams like business analysts, quality analysts,\nWorked with other functional leads and senior / quality analysts by proposing various solutions.",
    "skills": "analyst, basic, Business works, cable, Capacity planning, coaching, computer peripherals, computer hardware, Computer Applications, Client,\nclients, customer satisfaction, customer service, Documentation, Driving, features, frame, functional, Java, leadership, leadership skills, Logic,\nMentoring, Excel, Microsoft Office, MS office, windows operating systems, PowerPoint, Share point, word, network, policies, presenting,\nprocesses, Project Lead, project management, quality, reporting, sales, sound, SQL, staffing, strategy, Strategic management, supervision,\ntranslating, Troubleshooting, verbal communication skills, Visio, Web Designing, wise, workflow, written",
    "education": "Bachelor of Commerce : accounting and business management , Osmania University -\naccounting and business management GPA: 3.0\nMaster of Business Administration : GPA: 3.4\nMaster of Science : Information Technology , Wilmington University Delaware -\nInformation Technology GPA: 3.31"
  }
}