{
  "file_name": "13982572.pdf",
  "sections": {
    "general": "BRANCH BANKING COORDINATOR",
    "summary": "Manager with 12 years of background in customer service, finance, leadership and branch management. Vast knowledge of finance, regulatory\nrequirements and general bank operations. Enthusiastic and energetic in leading staff to exceed sales goals, while delivering excellent customer\nservice. A dedicated team player experienced in overseeing operations of individual and multi-unit facilities, developing successful programs to\nimprove profitability. Diligent and driven individual who has achieved success in a variety of roles with increasing levels of responsibility. An\neffective communicator and team-builder with strong analytical, management and organizational skills.",
    "education": "BBA : Banking 2015 Strayer University , City , State\nHigh School Diploma : College Preparatory 1999 Holly Hill Roberts High School , City , State",
    "experience": "Company Name City , State Branch Banking Coordinator 04/2013 to Current\nSupervise and participate in daily operational functions of the branch's Teller area\nEnsure timely and efficient completion of client transactions\nProactively manage the daily sales/quality referral process\nAssist HR with recruiting, interviewing, and selecting oncoming associates\nResearch Out of Balance Transactions/Daily Reports/Completed corrections in a timely manner, with daily Vault Operations/Cash Master\nAssist with Risk Management practices while being responsible for staffing and scheduling of branch\nComplete Staff Development/Performance Reviews/Salary Administration Ensure operating procedures are followed as outlined in the\nBranch Operational Manual (BOM).\nCompany Name City , State Guest Service Agent 04/2012 to 06/2015\nGreets, registers, and assigns rooms to guests, while maintaining confidential information as it relates to guest records.\nPromptly and effectively deals with guest requests and complaints.\nAnswers and routes calls as appropriate; takes guest messages with accuracy.\nResponsible for cash drawer contents, transactions during shift, and night drops as necessary.\nMaintains accurate records including cash flows, registration cards, reservation cards, and property walks.\nAnswers inquiries pertaining to hotel services, registration of guests, and travel directions.Â\nPreferred experience OnQ Software.\nCompany Name City , State Service Manager II 07/2007 to 02/2012\nEnsure policies, procedures and security guidelines are followed Educate customers on products, services and alternative solutions.\nMaintained compliance of vault, deposit logs, & risk mitigation Conducted on the spot coaching to ensure tellers convey quality customer\nservice.\nExhibited effective leadership skills in motivating teams to meet company goals.\nAssisted in Hiring, Terminating, Training Created/Maintained/Delivered Performance Evaluations of Employees Performed initial\nAudits/Reports randomly on a monthly basis.\nCompany Name City , State Manager/Auditor 02/2004 to 06/2007\nProcessed guest payments for room charges, food and beverage charges and phone charges.\nGreeted and registered guests and issued room keys.\nDelivered requested items to guests' rooms.\nProcessed credit card transactions during the checkout process.\nSupervised front desk staff.\nMonitored the appearance and performance of the front desk staff.\nFostered strong working relationships with all hotel departments.\nPerformed bookkeeping activities, such as balancing accounts and conducting nightly audits.\nRecorded guest comments or complaints, referring customers to managers as necessary.\nDirected personnel, training and labor relations activities.\nServed as a link between management and employees by handling questions, interpreting and administering contracts and helping resolve\nwork-related problems.",
    "skills": "Accounting, accounts payable, Accounts Payable and Receivable, auditing, balance sheet, billing, bookkeeping, Budgets, cash receipts, Closing,\nCoaching, Excellent communication, hardware, Conflict resolution, contracts, Credit, checkout process, client, Customer Relations, excellent\ncustomer service, Customer Service, finance, financial, Forecasting, forklifts, Hiring, Human resources management, Human Resource, HR,\ninternal audit, internet connectivity, labor relations, Team building, Leadership Skills, loss prevention, Managing, marketing, money, 97, Operations\nmanagement, Payroll, Performance Reviews, personnel, Policies, processes, process improvement, quality, quality control, Recruiting, Research,\nRisk Management, Sales, Scheduling, shipping, Staff Development, staffing, telephone, telephone etiquette, phone, time management, Trainer,\nwarehousing"
  }
}