{
  "file_name": "14224370.pdf",
  "sections": {
    "general": "ACCOUNTANT",
    "summary": "Degreed accountant with more than 10 years of diversified accounting experience seeking accounting position at a well-established company in\nHouston\nHighlights\nTeam-oriented\nDetail-oriented\nDeadlines focused\nExcellent communication and presentation skills\nQuick learner\nStrong management skills\nGood analytical skills\nAbility of managing multi tasks\nTechnical Skills\nAccounting Software: PeopleSoft / QuickBooks\nTax Software: Drake / Ultra Tax / TurboTax\nOperating Systems: XP Windows Professional / Windows 7/ Windows 8\nMicrosoft Office: Word / Advanced MS Excel skills /MS Access / PowerPoint / Outlook\nPDF: Adobe Reader / Adobe Acrobat X",
    "experience": "04/2012 to 06/2014\nAccountant Company Name ï¼​ City , State\nPrepare federal tax returns for individuals and small businesses.\nPerform bookkeeping and prepare financial statements for small businesses.\nPerform special projects & short-term assignments such as accountant at MCT Sheet Metal, Inc.\n10/2011 to 04/2012\nTax Accountant Company Name ï¼​ City , State\nContributed to the overall production and enhanced the efficiency of the corporate tax services by exceeding production goals.\nAnswered clients' queries regarding their tax filing status.\nResolved clients' tax filing problems.\nPrepared simple and complex tax returns for individuals and for small businesses.\nPrepared and reviewed financial statements needed to prepare tax returns.\n01/2007 to 08/2011\nAccounting Manager Company Name ï¼​ City , State\nEstablished new strategies to maximize profitability.\nPlayed an overwhelming role in the developing and restructuring of the entire accounting department.\nImproved the efficiency of the entire accounting department by 40%.\nReduced accounts receivable turnover by 50%.\nPrepared general ledger journal entries on QuickBooks.\nProcessed weekly and monthly invoices for accounts receivable.\nPrepared bank reconciliations and periodic financial statements.\n12/2005 to 12/2006\nTax Accountant Company Name ï¼​ City , State\nPlayed a vital role in the growth of the company by introducing new clients and maintaining good relationship with existing ones Prepared\nindividual and business tax returns Assisted in preparing corporate tax returns Prepared quarterly and annually payroll reports 940s & 941s\nand state sales taxes Reconciled monthly bank statements and prepared detailed financial statements Handled customer queries over the\nphone and through emails.",
    "education": "2005\nBachelor's degree : accounting University of Houston ï¼​ City , State accounting Cum Laude - Graduating With Honors",
    "skills": "accounting, accountant, Accounting Software, accounts receivable, Adobe Acrobat, Adobe, analytical skills, bank reconciliations, bookkeeping,\nExcellent communication, clients, Detail-oriented, filing, financial statements, prepare financial statements, general ledger, management skills,\nmanaging, MS Access, MCT, MS Excel, Microsoft Office, Outlook, PowerPoint, Windows 7, Windows 8, Windows, Word, Operating\nSystems, payroll, PDF, PeopleSoft, presentation skills, Quick learner, QuickBooks, sales, Tax, taxes, prepare tax, tax returns, phone"
  }
}