{
  "file_name": "14287992.pdf",
  "sections": {
    "general": "BUSINESS DEVELOPMENT ANALYST",
    "summary": "I am seeking career as Product Control Analyst in a diverse and multinational company that value integrity, courage, good leadership disposition,\nenthusiastic leaning, teamwork, and performance; where my comprehensive academic experience in finance, accounting, investment and\nmanagement can be effectively utilized.\nHighlights\nSuperior time management\nFinancial accounting and control management\nFinancial analysis and reporting\nMS Office Suites and QuickBooks Strategic and financial planning and modeling\nProficient in SAP (FICO)\nAdvanced computer proficiency Business analysis and valuation\nBudgeting\nAnalytical and problem solving abilities\nForecasting and planning\nCritical thinking with deadline driven\nAccomplishments\nLed the development of two financial reporting methods to measure productivity and efficiency of two giant Oil and gas companies.",
    "experience": "Business Development Analyst\nAugust 2012 to Current Company Name ï¼​ City , State\nManaged budget forecasting, goal setting and performance reporting for all accounts.\nAnalyzed legal documents, including wills, insurance policies and corporate contracts.\nDesigned and created weekly and monthly spending reports.\nCoordinated with underwriters, lenders, loan managers and securitization teams to manage portfolios.\nOversaw investment portfolio analysis, file maintenance and broker verification.\nDelivered performance updates, quarterly business reviews and planning meetings.Optimized current revenue streams by networking for\nadditional business prospects with established clients.\nPlanned strategic brand-building events to expand the product portfolio.\nContacted new and existing customers to discuss how specific products could meet their needs.\nIdentified, coordinated and participated in client relationship-building activities and meetings.\nAnswered customer questions regarding products, prices and availability.\nGenerated new accounts by implementing effective networking and content marketing strategies.\nDeveloped strategies and processes that increased patronage and customer base of the company Effectively managed the development, and\nimplementation of insurance policies for insurance holders Evaluated business trend and adopted strategies that ensure customer satisfaction\nMaintained strong relationships with existing accounts and develop new accounts Prepared proposals, and managed various meetings and\npresentations to potential customers Provided quotes to customers, process premium payment, and issued policy update.\nCorrection and Family Liaison Officer (Part Time)\nJuly 2009 to Current Company Name ï¼​ City , State\nRoutinely reviewed housing assignments and reassigned inmates when needed.\nInformed inmates and visitors of rules, safety and security procedures and responsibilities.Maintained daily logs of shift activity.\nDiligently implement visitation, safety, security rules, procedures, and precautionary measures Received and inspected mail, property and\nsupplies from visitors on behalf of designated inmates Directed the activities of inmate working on maintenance, operations, and other\nprojects Prepared, processed and maintained forms, reports, logs, records and activity journals Completed new intakes paperwork,\n*ngerprints, searches, material issued and supplies to inmates.\nCustomer Service Associate\nJuly 2009 to July 2012 Company Name ï¼​ City , State\nPerformed registers audit, assisted in preparing and maintaining inventory records Supervised front end cashiers and organized the store,\nincluding the checkout desk and displays Operated cash registers and processed gift cards, coupons, and all payment modes with accuracy\nPerformed sale opening and closing procedures, including counting of cash register Effectively handled customer relations issues and in\naccordance with company policies.\nAccount & Finance Officer\nJanuary 2007 to February 2009 Company Name ï¼​ City , State\nManaged accounting operations, accounting close, account reporting and reconciliations.\nReceived, recorded, and banked cash, checks, and vouchers as well as reconciled records of bank transactions.\nPrepared monthly and annual expense forecasts, including any necessary recommended action required to manage costs to achieve budget.\nPerformed general accounting and finance functions including: Developed financial modelling using excel spreadsheet to analyzed, and report\nfinancial statements Preparation of journal and ledger entries, account analysis and balance sheet reconciliations.\nBuilt and maintained databases for forecasting future financial performance Presented reports on economic trends of business that enhanced\nprocess improvements Managed account payables and receivables.\nResearched and resolved billing and invoice issues.",
    "education": "MBA : Finance & Management , 2014 University of Houston ï¼​ City , State GPA: GPA: 3.80/4.00\nGPA: 3.80/4.00\nBBA : Accounting , 2007 Ambrose Alli University ï¼​ City , State , Nigeria\nAccounting",
    "skills": "General financial accounting and control\nStrong analytical and attention detail\nMulti-tasking with strong deadline driven\nAdvanced computer skills (Microsoft Office suites : Word, Excel, PowerPoint, and Access) and QuickBooks."
  }
}