{
  "file_name": "14517953.pdf",
  "sections": {
    "general": "CONSULTANT",
    "summary": "[job title] with more than [number] years of experience planning, developing and implementing [program or process] .Experienced manager with\nexcellent client and project management skills. Action-oriented with strong ability to communicate effectively with technology, executive, and\nbusiness audiences.high level of client interaction utilizing my extensive knowledge and experience in the retirement and compensation fields.\nResourceful, Responsible, Results-oriented, Seasoned, Self-directed, Service-driven, Skilled, Strategic, Superior, Talented, Versatile, Well-\nqualified, Adaptable, Ambitious, Analytical, Articulate, Award-winning, Business-savvy, Client-focused, Committed, Conscientious, Consistent,\nCreative, Customer-focused, Customer-service focused, Deadline-driven, Deadline-oriented, Dedicated, Dependable, Detail-oriented,\nDisciplined, Driven, Dynamic, Effective, Energetic, Experience, Expert, Flexible, Focused, Gifted, Hands-on, Hardworking, Highly motivated,\nHigh-performing, Innovative, Mature, Meticulous, Motivated, Multi-task-oriented, Organized, Outstanding, Performance driven, Personable,\nPositive, Pragmatic, Proactive, Productive, Proficient, Reliable, AccomplishedHighly qualified, detail-oriented and hardworking [Job Title] with\nmore than [Number] years of experience. Proficient in research, writing, case management and client relations. Expert computing and technology\nskills including competence in multiple software applications, website design (HTML), CMS and hosting, networking issues and social media.\nHighlights\nCost Benefit Analysis (CBAs)\nProductivity improvement\nAccount reconciliations\nMicrosoft Office Suite expert\nOrganized\nWork flow planning\nUnsurpassed work ethic\nDetail-oriented\nResults-oriented\nSuperb time management",
    "experience": "Consultant\nJanuary 1997 to August 2015 Company Name - City , State\nPlanned, designed and implemented retirement and compensation programs of varying size and scope.\nProvided technical and consulting services on qualified and non-qualified retirement, compensation and incentive plan issues to clients and\nother consultants.\nPrepared plan documents, amendments, summary plan descriptions and employee meeting materials for retirement, incentive and\ncompensation programs.\nImplemented policies and procedures to administer executive compensation programs.\nDesigned multiple costing, accounting and tax models to assist clients with selection of program alternatives.\nPerformed various market analyses for clients to determine competitiveness to market in the areas of compensation and benefits.\nPrimary Administrative Consultant\nJanuary 1995 to January 1997 Company Name - City , State\nAdministered multiple clients' defined contribution retirement plans.\nPrepared and filed IRS Form 5500 series reporting Prepared all required plan compliance testing including ADP/ACP testing, top heavy\ntesting, annual additions testing, minimum coverage testing and other required discrimination testing.\nImplemented systems to automate multiple job functions.\nConsistently exceeded target fee realization ratios on all client relationships.\nTreasury Analyst\nJanuary 1993 to January 1995 Company Name - City , State\nDesigned and maintained cash collection and disbursement systems.\nManaged short-term cash/debt balances and daily bank relationships.\nManaged execution of wire transfers and foreign exchange transactions.\nPrepared financial reports and developed spreadsheets and programs for financial modeling and forecasting.\nProvided information systems support to treasury department.\nPension Analyst\nJanuary 1992 to January 1993 Company Name - City , State\nAssisted with the selection and review of plan trustees, investment managers, record keepers and actuaries.\nMonitored performance and activity of company's domestic defined benefit and defined contribution pension plans.\nActed as liaison between plan trustee, record keeper, actuary and internal benefits department.\nResponded to participant questions on plan investments Completed annual reporting with Internal Revenue Service, Department of Labor,\nSecurities Exchange Commission and Pension Benefit Guarantee Corporation.\nPrepared annual board reports on global pension plan performance.\nIntern\nJanuary 1991 to January 1992 Company Name - City , State\nReconciled trust bank statements to record keeper accounts.\nMonitored performance of retirement plan investment managers.\nPrepared and maintained quarterly investment performance reports.\nAllocated insurance claims to plant locations.",
    "education": "Master of Business Administration : Administration , 1995 University of Toledo - City , State GPA: GPA: 3.4\nBachelor of Business Administration : Finance , 1991 University of Toledo - City , State GPA: GPA: 3.2 Dean's List\nSelect One : 1987 St. Ursula Academy - City , State GPA: GPA: 3.7 Graduated with highest honors and in top 10% of class *National Honor\nSociety",
    "skills": "accounting, ADP, automate, benefits, consulting, costing, Crystal Report, client, clients, financial modeling, financial reports, forecasting, foreign\nexchange, Novell GroupWise 5.5, information systems, insurance, Microsoft Internet Explorer, investments, market, materials, Microsoft Access\n2000, Microsoft Excel 2000, Exchange, Microsoft Outlook Express, Microsoft PowerPoint 2000, Windows 95, Windows NT, Microsoft Word\n2000, Netscape Navigator, Operating Systems, policies, reporting, Securities, spreadsheets, tax, treasury, Writer"
  }
}