{
  "file_name": "14611516.pdf",
  "sections": {
    "general": "PROPERTY MANAGEMENT ASSISTANT\nProfessional Summary\nDedicated Public Relations Specialist with vast experience managing external public relations and media agencies. Skillfully manages multiple tasks\nand meets tight deadlines in high-pressure environments.",
    "skills": "Bilingual in English and Spanish\nComputer skills\nCreative Writing\nStrategy development\nSocial media coordination\nMedia relations\nCritical thinking\nCampaign management\nFact checking\nInformation gathering\nStrategic Planning\nSocial media marketing\nWork History\nProperty Management Assistant , 01/2018 to Current\nCompany Name – City , State\nIntroduced prospective tenants to types of units available and performed tours of premises.\nCommunicated with clients and tenants while offering strategic solutions to remedy problems.\nCommunicated effectively with owners, residents and on-site associates.\nGenerated professional networks by engaging in professional, industry and government organizations.\nConducted thorough research using diverse resources to assist professional staff with routine and special project tasks.\nPublic Relations Coordinator , 08/2017 to 06/2018\nCompany Name – City , State\nIdentifying clients' needs through market research and analysis and developing forward-thinking strategies.\nAnalyzing clients' objectives and interests in order to create meaningful relations with media and public personas to utilize for campaigns and\nprojects.\nCreating proposals for various activations and events.\nDeveloping and cultivating ambassadors for campaigns.\nResearching and organizing event elements, including venues, guest speakers, influencers, etc.\nExecuting and monitoring performance of campaigns to boost brand awareness and profitability.\nAnalyzing the results of campaigns and reporting observations to the client through our post-event reports.\nDrafting and distributing press releases, media alerts, media invites, briefing documents, and opinion editorials.\nLiaising with journalists to pitch and secure the necessary media coverage.\nMonitoring media coverage\nMaintaining an up-to-date media list\nCompiling monthly reports, and end of campaign reports.\nFaculty Liaison/Textbook Supervisor , 04/2015 to 06/2017\nCompany Name – City , State\nStrengthened merchandising and promotional strategies to drive customer engagement and boost sales.\nDeveloped strategies to study trends in customer behavior, so as to anticipate future opportunities for growth.\nResponded to requests for information from media or designated appropriate spokesperson or information source.\nDrafted press releases detailing relevant newsworthy information and supporting brand image, and worked with news media to spread\npositions.\nOversaw professional social media messaging through content development, follower engagement, social listening, trend analysis and by\nleveraging competitor research.\nIncreased revenues and supported business goals by developing public relations strategies and campaigns.\nActively listened to customers' requests, confirming full understanding before addressing concerns.\nLed projects and analyzed data to identify opportunities for improvement.\nResolved problems, improved operations and provided exceptional service.\nStockroom Supervisor , 09/2013 to 01/2015\nCompany Name – State\nNYC - Mens Shoes, Stocked and replenished merchandise according to store merchandising layouts.\nMaintained established levels of goods based on sales forecasts and demand to fulfill orders on time.\nMaintained strong vendor connections, including arranging pricing and delivery structures and managing specific shipment or paperwork\nconcerns.",
    "education": "Criminal Justice Bronx Community College - City , State\nAssociate of Arts : Video Game Design Southern New Hampshire University - City , State",
    "certifications": "Computer Science Certificate, CENTU Dominican Republic - 2009\nIntermediate Python Coder/Data Analyst and advancing, DataCamp"
  }
}