{
  "file_name": "14667659.pdf",
  "sections": {
    "general": "INSURANCE SPECIALIST",
    "summary": "Accomplished communicator who mediates effectively and uses negotiating and persuasion skills to achieve consensus. Proficient in account\nmanagement, training, project management, and building strong relationships. Proven ability to streamline operations, educations, and troubleshoot\nproblem areas. Demonstrated history of successful administration and effective issue resolution, while providing high-quality leadership, and\nmanaging individuals from varying backgrounds.",
    "skills": "account management, Administrative support, advertising, art, business management, call center, clerical, closing, color, client, clients, customer\nsatisfaction, customer service, customer service, customer support, databases, direction, e-mail, employee training, fax, functional, Invoice\nprocessing, machine operation, market research and analysis, Medical Billing, Microsoft Excel, mail, Microsoft Office, MS Office Suite, payroll,\npersonnel, POS, PR, public relations, quality, quality assurance, QuickBooks, retail, safety, sales, script, shipping, Spreadsheet, telephone, vision\nAdditional Information\nMajorette (twirler/ dancer) Volleyball Affiliations Walk of Life (St. Joseph Hospital) Willing to relocate: Anywhere Additional Information\nWon employee of the month in March 2016",
    "experience": "Insurance Specialist 04/2017 to Current Company Name City , State\nProcessed applications, payments, corrections, endorsements and cancellations.\nDeveloped, implemented and monitored new underwriting guidelines for the agency.\nCompiled coverage and rating information in an accessible format.\nSubmitted up-to-date activity and production logs to agency management for review.\nResearched coverage and premium options and supplied clients with the best coverage available.\nFinalized and maintained all types of personal lines insurance policies within the agency.\nFront desk agent 12/2015 to Current Company Name City , State\nDispensed guidance, direction and authorization to carry out major plans.\nReviewed sales price and operating costs.\nEnsured work was accomplished in a safe manner in accordance with established operating procedures and practices.\nHandled telephone inquiries.\nDocumented business requirements, functional specifications and training procedures.\nManaged quality communication, customer support and product representation for each client.\nInteracted with customers and retail buyers to follow-up on shipping statuses and expedited orders.\nPromptly responded to general inquiries from members, staff, and clients via mail, e-mail and fax.\nPerformed store opening duties, including counting cash drawers and checking all equipment for proper functioning.\nPublic relations 09/2011 to 06/2012 Company Name City , State\nIdentified customer needs through market research and analysis.\nDefined project and company vision, strategies and tactics.\nResearched, negotiated, implemented and tracked advertising and public relations activities.\nEvaluated and managed new strategic business opportunities.\nExpanded product and company recognition in the national press to support the sales and marketing teams.\nOrganized public appearances, lectures, contests and exhibits to increase product awareness.\nBilling and Coding 07/2010 to 08/2010 Company Name City , State\nObtained information by contacting appropriate personnel or patients.\nOrganized files by color codes Entered information into computer databases.\nRetrieved requested files and delivered to appropriate personnel.\nReviewed files to check for complete and accurate information.\nProcessed and routed incoming mail.\nPublic Relations 08/2011 to 05/2017 Company Name City , State\nIdentified customer needs through market research and analysis.\nDefined project and company vision, strategies and tactics.\nOrganized public appearances, lectures, contests and exhibits to increase product awareness.\nWorked with management to identify trends and developments that might influence PR decisions and strategies.\nResearched, negotiated, implemented and tracked advertising and public relations activities.\nEducation and Training\nHigh School Diploma 2011 Jones Senior High School\nBusiness Administartion 2017 Southern University City , State , United States\nPersonal Information\nMajorette (twirler/ dancer) Volleyball Affiliations Walk of Life (St. Joseph Hospital) Willing to relocate: Anywhere Additional Information Won\nemployee of the month in March 2016"
  }
}