{
  "file_name": "14879257.pdf",
  "sections": {
    "general": "BILINGUAL LANGUAGE ARTS SIXTH GRADE TEACHER",
    "summary": "Dedicated and enthusiastic professional with over four years' experience in education. Proven expertise in establishing rapport and building trust\namong students, parents, administrators and community members. Possess strong communication skills and ability to partner across departments\nwithin and outside of an organization to meet the needs of students. Motivating students School improvement committee Interactive\nteaching/learning Interdisciplinary teaching Innovative lesson planning Effectively work with parents",
    "professional experience": "08/2014 to Current\nBilingual Language Arts Sixth Grade Teacher Company Name ï¼​ City , State\nDeveloped and implemented interesting and interactive learning mediums to increase student understanding of course materials and build\ncommunity within the classroom Participate in the development of intervention plans for students within the classroom setting, during MVP\ntime (tutoring hour) as well as after school tutoring Oversee Read 180 program participants and monitor their progress as part of their\nintervention strategy Implementation of newer educational technology programs in order to teach students new techniques to use within their\npresentations to showcase their knowledge some examples include: Prezi, Storyboard That, Edmodo, Thinglink, and others Participate in\ndistrict Community Ambassador program and campus improvement committee.\n01/2014 to 05/2014\nBilingual Substitute Teacher Company Name ï¼​ City , State\nWorked in elementary schools and substitute several classroom programs inclusive of: Early Childhood-6 mainstream, Spanish Immersion,\nBilingual (Spanish) Early Childhood-6, and Special Education.\nProvided key support for teachers on leave.\n07/2013 to 01/2014\nBilingual 4th Grade Teacher Company Name ï¼​ City , State\nDeveloped and implemented plans inclusive of: following Independent Education Plans (Special Education), Gifted and Talented curriculum,\nand mainstream English/Spanish language arts, writing and history Analyze data to plan and implement appropriate instruction to reflect\naccommodations for individual students Cooperate with other members of the staff in planning and implementing instructional goals and\nobjectives Establish and maintain open lines of communication with students and their parents Participate in a wide range of district and\ncampus professional development to include: Gifted and Talented coursework, wide range of education technology applications, as well as\nLove and Logic training.\n04/2011 to 07/2012\nStudent Development Assistant Company Name ï¼​ City , State\nCoordinated community tours for prospective students, families and community visitors Created data intensive reports based on\nTAKS/STAAR test results for local feeder schools for supervisor to present to upper administration Collaborated with the FWISD Vital\nLink program to create a summer college exploration/ internship program for local middle school students.\n06/2010 to 07/2010\nAcademic Advisor/ Spanish Instructor Company Name ï¼​ City , State\nAssisted students one-on-one with college preparation assignments such as: career exploration, school selection, resume writing, and letters\nof recommendation Taught students hybrid course: Introduction to Spanish and Hispanic/Latin American Studies.\n07/2009 to 07/2010\nProgram Coordinator Company Name ï¼​ City , State\nOversaw the development of a start-up organization Managed a $200,000 federal Gear up grant Utilized research based best practices to\ncreate community workshops for parents and students as well as developed staff and advisor manuals Developed community partnerships\nand presented NACRC to organizations Received promotion from AmeriCorps VISTA position.\n01/2009 to 05/2009\nMath Teacher Company Name ï¼​ City , State\nTaught beginner English grammar and literature, World History and TOEFL Prep to international students Tutored Algebra and was\npromoted to remedial math teacher position Advised international students and tutored Spanish.\nEducation and Training\nMay 2011\nTarrant County College\nEmployee of the Month Educational Support Services Department February 2010 AmeriCorps VISTA: Most Inspirational Employee December\n2009 Northern Arizona University\n2009\nBachelor of Arts : International Studies Elon University ï¼​ City , State International Studies\nPresidential Scholar; Resident Assistant- RA of the Month February 2007 and October 2006; Global Experience Program: Costa Rica 2008 with\ninternship, Winter Term: Paris 2007, London 2006; Elon Volunteers: Boys and Girls Club Alamance County Community College\nAffiliations\nAssociation of Texas Professional Educators (ATPE) LANGUAGES English and Spanish",
    "skills": "arts, English, instruction, Latin, letters, Logic, materials, math, presentations, progress, promotion, Read, research, Spanish, Spanish language,\nstrategy, supervisor, teacher, tutoring, VISTA, workshops"
  }
}