{
  "file_name": "15180322.pdf",
  "sections": {
    "general": "CHEF\nCareer Focus\nI am a nursing student who has recently obtained my CNA license in this state. I worked as a GNA in the UK and it has been a passion ever\nsince. I am confident that I would make a wonderful candidate for this position. From he beginning of taking my prerequisite classes for Nursing\nSchool. I have ebb driven yet still personable. My record shows me to muti-task oriented.\nI have the experience of always having with and caring deeply for people. While my grades have always been exceptional, my clinical experience\nwas accomplished. I do not want to sound arrogant - I am truly confident that with my strong work ethic, an willingness to learn, I would surely be\nan asset to the St.Joseph's Medical team. I think you for your time.\nSummary of Skills\nUnderstands mobility assistance needs Trained in catheter change and preparation\nCharting expertise Calm and level-headed under duress\nUnderstands medical procedures Quick problem solver\nTrained in grooming and bathing assistance Valid [state] driver's license\nGeneral housekeeping ability Reliable transportation\nMedical terminology knowledge",
    "experience": "Positioned residents for comfort and to prevent skin pressure problems.\nRead and recorded temperature, pulse and respiration.\nMassaged patients and applied preparations and treatments, such as liniment, alcohol rubs, and heat-lamp stimulation.\nCompleted and submitted clinical documentation in accordance with agency guidelines.\nPrepared patient rooms prior to their arrival.Provided pre- and post-operative care.\nAssisted patients with bathing, oral hygiene, grooming, feeding and elimination.\nHelped patients move in and out of beds, baths, wheelchairs and automobiles.\nCooked appetizing and satisfying meals and snacks.\nScheduled and accompanied clients to medical appointments.\nFollowed safe lifting techniques and individual resident lifting instructions.\nMaintained sanitary conditions in residents' and program rooms.\nTransported patients to other areas of the hospital in wheelchairs and gurneys.\nAssisted in cleansing enemas, catheterization and bladder irrigations.\nAssisted patients with ambulation and crutch walking.\nProvided pre- and post-operative nursing care.\nProvided necessary supplies, support and assistance to medical staff and patients for unit specific procedures.\nTended to patients with chronic illnesses.\nTended to patients with chronic illnesses.\nAssisted nurses with cleaning rectal tube, G-tube, J-tube and regular catheter insertion.\nCharted information about residents such as mood changes, mobility activity, eating percentages and daily inputs and outputs.\nRecognized and reported abnormalities and/or changes in the patients' health status to nursing staff.\nDocumented resident records on daily flow sheets.Collects patient specimens and data, including vital signs, input/output and other necessary\nmeasurements.Provided patients and families with emotional support.Compassionate care and communication in dealing with issues of death and\ndying.Displayed sensitivity to the needs of geriatric patients.Administered and guided patients through simple range of motion exercises.\nComforted patients and provided them with reassurance and encouragement.\nPromoted continuity of care by communicating patients' status to family members and other caregivers.\nPromoted personal and co-worker safety.\nPromoted personal and co-worker safety.\nParticipated in the maintenance of safe conditions within the facility and other related areas.Responded appropriately to the physical, emotional and\ndevelopmental needs of patients.\nWork History\nJune 2011 to August 2014\nCompany Name City , State Private Chef\nEducation and Coursework\nBaltimore International College\nCity , State , USA Culinary Arts AA degree\nCulinary Arts\nGPA 4.0\nCoursework in GEN ED - plus CULINARY Arts\nDeans list every year\nCoursework in Anatomy, Physiology and Health Assessments[Name] Academic Achievement Award",
    "interests": "Currently a nursing student at CCBC. Community Involvement Volunteered over the years for various local and international groups including\nMoveable Feast, United Way, as well as a church group that involved volunteering in the Dominican Republic for 9 months.\nAdditional Information\nCurrently a nursing student at CCBC.\nCommunity Involvement Volunteered over the years for various local and international groups including Moveable Feast, United Way, as\nwell as a church group that involved volunteering in the Dominican Republic for 9 months.\nI took care of sick children in the Subsaharan conditions of Haiti and the DR.",
    "skills": "arts, clients, customer service, office, natural, Sales"
  }
}