{
  "file_name": "15535920.pdf",
  "sections": {
    "general": "BUSINESS CONSULTANT\nProfessional Summary\nIT Business/Sales/Operations position where my experience and technical knowledge can contribute and positively impact strategic improvements.\nDrive and support change for process improvement, implement technology solutions in fast paced evolving environments. I enjoy interacting with\npeople to solve problems creatively and appreciate working in a diverse environment.\nÂ Technology / OPERATIONS 10+ years working in technical and operations environments supporting engineering, human resources, operations\nand finance teams. Procure hardware and software, provide quotes, detailed reporting utilizing an Access and CRM/Salesforce databases.\nManage projects, timelines and teams to improve quality of methods and presentations to key stakeholders. IT Helpdesk response team - build\nclient and server systems to business specifications, install OS, applications based on department needs, utilize Active Directory to provide\nupdated information to management, deploy hardware, software, troubleshoot and resolve issues on notebooks, desktop and servers. Supporting\nMicrosoft, MAC OS, Android and iPhones. MCSE and Currently enrolled in Apple Training. Track and analyze technical training, developed\ncurriculum, procured software and implemented courses for engineers and management. Prioritized organizational needs, attention to detail within\nproject timelines to exceed business requirements for technical training certifications. Microsoft Office Expert Support strategic initiatives by\nmaintaining servers and systems, on site DR implementation. Utilizing MS Active Directory and iOS MDM to monitor systems and applications,\nsupport, troubleshoot and provide appropriate application access to cross functional teams while maintaining system uptime. Management Led the\ninternal IT Team and team of IT consultants to successfully rollout 22 branch Microsoft Exchange migration. Prepared the environment, managed\nthe train the trainer for the business teams and successfully completed the migration within the 6-month timeframe, exceeding the requirements in\npreparation for the company acquisition. Offered a new position within the new company. Lead and built strong relationships with the business\nunits, program managers, engineering and management to identify technology needs, brain storm solutions, document and implement new\nprocesses which defined and exceeded management operational goals and KPIs. Direct Sales teams to position products and services which\nwould drive margin improvements. Provide weekly cost/benefit analysis reports which lead to 94% increase in complete responses for\nRFQ's/RFP's and SOWs. Sales 6+ years Field Sales providing Mobility, Data Center, Networking, Cloud, Security, and Professional services\nand solutions to Enterprise customers. Understand the customer needs, goals and KPI's and their IT environment to be able to provide the\nappropriate technology solution, or alternative solution to solve problems. Partner with subject matter experts to deliver web-based solutions to C-\nlevel executives, IT teams and procurement. Build and establish solid relationships with customers to understand their current technical\nenvironment, growth initiatives and end goals to better provide services and solutions which solve immediate challenges and a path to meeting their\nend goals. Provide technical presentations, manage product life cycles, partner with OEMs and distribution channels to exceed customer\nsatisfaction from order to fulfillment. Consistently build pipeline to meet and exceed 3X goals, forecast monthly/quarterly revenues and margin.\nCustomer focused, oversee the technical team in execution of services and results, meeting and exceeding customers KPI's and business goals.\nPower user with Microsoft Dynamics CRM and Salesforce. Utilizing research engines and web tools understand the competition, search for new\naccounts with projects that align with our solutions and services to call. Document all activities within CRM/Salesforce. Communication\nInterpersonal and cross-functional communication skills, effective presentations, ability to multi-task and prioritize, time management. Creative,\nconfident, always learning and flexible in understanding needs and working with diverse teams. Ability to share technical information with non-\ntechnical teams where they can relate and understand in a non-condescending, positive and learning environment.",
    "skills": "streamline, Analyst, develop business, business plan, business plans, business process re-engineering, call center, charts, Cisco, closing, coach,\ncold calling, com, Compaq, hardware, CRM, client, customer satisfaction, data base, desktops, financial, focus, forecasting, functional, Ghost,\ninformation security 8, information technology, Inside Sales, IT Support, laptops, leadership, Lotus Notes, director, meetings, Access, Access\ndatabase, Microsoft Certified Systems Engineer, MCSE, Microsoft Dynamics, Exchange Server, Microsoft Exchange, migration, enterprise,\npositioning, Pricing, processes, process improvement, Product Management, quality, Reporting, research, retail, RFP, selling, Sales, sales\nmanagement, servers, software engineer, install software, spreadsheets, statistics, strategy, Strategic, Systems Engineering, technical support,\ntroubleshoot",
    "education": "Degree :\nGoogle IT Support Certificate - currently enrolled via Coursera :\nMay 2018\nAS : Computer Information Systems\nMount Wachusett Community College -\nComputer Information Systems\nBS : Business Management Lesley University -\nBusiness Management\nAS : Business Administration Mount Wachusett Community College -\nBusiness Administration"
  }
}