{
  "file_name": "15891494.pdf",
  "sections": {
    "general": "FINANCE OFFICER",
    "summary": "Profile: An experience Accountant and data base worker who has developed a strong accounting background working with Data Base and\nAccounting packages for over four years. Team oriented individual with good interpersonal skill and a demonstrated ability to accurately evaluate\ncustomer requirement and complete related tasks / project which satisfy or exceed customer requirement on time. . I have the ability to create\nconducive atmosphere with colleagues at work. Keen, presentable and goal getter, effective team member, trust worthy, reliable and well organize\nteam player. Confident working alone and with senior authorities, creative and enjoys using own initiatives. Flexible and can adapt to work in wide\nrange of tasks. I have the ability to work within tight schedules and outside official hours.\nHighlights\nAnalytical reasoning Account reconciliation expert\nCompliance testing knowledge Financial planner\nFinancial statement analysis Effective time management\nAccomplishments\nAchieved 25% cost reduction by eliminating redundant processes.\nFormally recognized for excellence achieved in financial analysis, budgeting and forecasting.",
    "experience": "April 2014 to January 2016\nCompany Name City Finance Officer\nDevelop internal control policies, guidelines, and procedures for activities such as budget administration, cash and credit\nmanagement, and accounting.\nCoordinate and direct the financial planning, budgeting, procurement, or investment activities of all or part of an\norganization.\nMaintain current knowledge of organizational policies and procedures, federal and state policies and directives, and\ncurrent accounting standards.\nReceive cash and checks and make deposits.\nAdvise management on short-term and long-term financial objectives, policies, and actions.\nPrepare or direct preparation of financial statements, business activity reports, financial position forecasts, annual\nbudgets, or reports required by regulatory agencies.\nEvaluate needs for procurement of funds and investment of surpluses and make appropriate recommendations.\nProvide direction and assistance to other organizational units regarding accounting and budgeting policies and\nprocedures and efficient control and utilization of financial resources.\nAnalyze the financial details of past, present, and expected operations to identify development opportunities and areas\nwhere improvement is needed.\nSupervise employees performing financial reporting, accounting, billing, collections, payroll, and budgeting duties.\nCompute, withhold, and account for all payroll deductions.\nApril 2013 to October 2013\nCompany Name City Administrative/Finance Officer\nSupervising and monitoring the sheet from haulage work at London Mining\nPerform payroll functions, such as maintaining timekeeping information and processing and submitting payroll.\nCollect and deposit money into accounts, disburse funds from cash accounts to pay bills or invoices, keep records of\ncollections and disbursements, and ensure accounts are balanced.\nManage Sage Accounting software in relation to all the company activities.\nIncome and Expenditure data inputting and analysis.i.e customer invoices, supplier invoices, credit card payments, and\ninputting all cost into their various overheads\nApril 2013 to October 2013\nCompany Name City Data Entry Supervisor\nReporting to the Senior Supervisor on the Data Collected during surveys\nSupervising the the output of colleagues to ensure the work is done orderly and on time.\nResponsible for the coding of different information gathered from surveys\nAnalysing the authencity of the report to make sure it truthful and accurate for sending to various donors\nSeptember 2012 to April 2013\nCompany Name City Compliance and Internal Controlls Officer\nDaily reconciliation for four(4) Banks international bank accounts\nDaily reconciliation for four(4) Banks international bank accounts\nWeekly report on all activities in the bank\nMonthly cash count at our branches\nPreparing of customer transaction report\nComply with applicable Money Laundering Prevention Procedures and, in particular, report any suspicious activity to the\nUnit Money Laundering Prevention Officer and Line Manager.\nAdhere to policies including escalation and compliance requirements, and follow any other relevant internal controls and\nprocedures as they relate to process, products, policies and regulations.\nWeekly review of all KYC document and ensure they are authentic\nEnsuring that account opening packages are have information submitted by customers\nCollect and analyze data to detect deficient controls, duplicated effort, extravagance, fraud, or non-compliance with laws,\nregulations, and management policies.\nExamine records and interview workers to ensure recording of transactions and\ncompliance with laws and regulations.",
    "education": "2013\nFourah Bay College\nCity , State , Sierra Leone Accounting and Finance\nBachelor of Science GPA: Graduated with honors. Honours in Accounting and Finance Apr Graduated with honors.",
    "interests": "Volunteer, Lunch Box . Treasurer/sectary, Student Government and I was also a very active member of student sports club.",
    "skills": "Customer and Personal Service Administration and Management\nActive Listening Judgment and Decision Making\nTime Management Quality Control Analysis\nComputers and Electronics Clerical\nAdditional Information\nVolunteer, Lunch Box . Treasurer/sectary, Student Government."
  }
}