{
  "file_name": "15906625.pdf",
  "sections": {
    "general": "ACCOUNTANT\nProfessional Summary\nCurrent Accountant with the City of Alexandria with over 15 years experience in the accounting industry. Knowledge in governmental accounting\nprocedures, financial statement preparation, general ledger activity, budget preparation & analysis, bank reconciliations, accounts payables &\nreceivables, payroll, fixed assets, tax preparation & audit procedures.",
    "skills": "Advanced bookkeeping skills\nAccounting and bookkeeping\nFinancial statement analysis\nTax return filing\nGAAP understanding\nBank reconciliations and balancing\nFlexible team player\nMicrosoft Word, Excel, Access, PowerPoint, & Outlook\nAsset Keeper Pro Software\nQuickBooks Software\nFixed Asset Solutions Software\nCreative Solutions Bookkeeping Software\nHOST Software\nDocument Manager Software\nProSystem, UltraTax, and Lacerte Tax Preparation Software\nWork History\nAccountant Aug 2013 - Current\nCompany Name City , State\nHelp prepare Financial Statements and Bank Reconciliations.\nPerform accounts payable functions for governmental expenses.\nManage financial departments with responsibility for Accounts Payable and Fixed Assets.\nManage vendor accounts and prepare 1099s for contract labor.\nReconcile Asset accounts and review all materials, including surplus, depreciation expense, and purchase and recording of new assets.\nOrganize and carried out efficient month-end, quarterly and year-end processes.\nProvide journal entries and perform accounting on accrual basis for year end procedures.\nPrepare documents and reports using advanced software proficiencies.\nGenerate and submit invoices based upon established financial schedules.\nMaintain integrity of general ledger, including chart of accounts.\nPartner with auditors to prepare yearly audits and ensure compliance with governmental tax guidelines.\nReview & improve accounting systems and processes to meet business needs and maximize effectiveness of operations.\nReview accounting structures and procedures on regular basis to identify areas in need of improvement.\nAccountant Aug 2009 - Feb 2013\nCompany Name City , State\nPreparation and Analysis of Hospital Financial Statements.\nResponsible for Budget and Forecasts on Quarterly Basis.\nInvestigate and resolve discrepancies in financial statements while under tight deadlines.\nCompiled general ledger entries on short schedule with nearly 100% accuracy.\nAnalyzed monthly balance sheet accounts for corporate reporting.\nAccountant Jan 2006 - Apr 2008\nCompany Name City , State\nPrepared & Filed tax returns for individual, partnership, corporate, and tax exempt clients.\nResponsible for Budget and Forecasts on Quarterly Basis.\nPrepared & Managed LLC & Corporate monthly payroll & Quarterly Reports.\nUtilized accounting software to issue tax returns and prepare consolidated reports.\nGenerated financial statements and facilitated account closing procedures each month.\nAccountant Jan 2003 - Aug 2004\nCompany Name City , State\nPrepared individual, partnership, corporate & fiduciary tax returns.\nAudited governmental, for-profit and not for profit entities.\nUtilized accounting software to issue tax returns and prepare consolidated reports.\nUpheld strict confidentiality protocols with all client details and tax return information.",
    "education": "Bachelor : Accounting 2002\nNorthwestern State University of Louisiana City , State\nGraduated Magna Cum Laude\nPhi Kappa Phi Honor Society\nCPAExcel Scholar\nDean's List for the entirety of College.\nGeorge H Rothschild Scholar\nAlpha Lambda Delta Honor Society"
  }
}