{
  "file_name": "16121387.pdf",
  "sections": {
    "general": "MEDICAL RECORD TECHNICIAN\nProfessional Summary\nA Healthcare Administration Professional combining higher education (B.A, M.H.A.) with a history of building strong alliances and partnerships\nwith business professionals, patients, medical personnel (physicians, nurses, allied health), families, and community members to steer operational\nprojects, meet long/short term healthcare/business objectives, architect process improvements, ensure regulatory/HIPAA compliance and position\nthe healthcare operation as the provider of choice/ Electronic Medical Record and Health Information Management/. Member: American College\nof Healthcare Executives Builds Instant Rapport and Relationships with Patients/Healthcare Professionals Negotiates Mutually Beneficial Solutions\nDiplomatic Communicator Exceeds Healthcare/Business Objectives Sources Cost-Effective Solutions Process Improvement Compliant with\nHIPAA/Organizational Guidelines Ambitious and Dedicated Project and Program Management] Exceptional and Creative Problem Solving Skills\nBuilt loyal business relationships with patients, colleagues, physicians, families, and allied healthcare professionals across a premier fast-paced\nmedical/healthcare facility while administering and maintaining healthcare records, organizing patient schedules, steering projects/programs,\narchitecting improvements to business/healthcare operations, mitigating costs, maximizing compliance levels, and partnering with physicians and\ncolleagues to share best practices and meet organizational objectives. Data analysis of multiple projects within a system. Ability to work under\npressure and balance many competing priorities. Maintain quality control and provided leadership oversight of patient safety. Strong knowledge of\nElectronic Medical Records(EMR) system. Develop project plans and identify key issues, Identifies data needs and requirements proactively along\nwith implement project solutions that meet productivity, quality and client-satisfaction goals. Maintained Confidentiality, Sensitivity, Accuracy, and\nCompliance with Organizational and HIPAA Regulations while managing patient, organizational, and healthcare information and entering, updating,\nand validating records. Improved the Overall Patient Experience while providing superior patient care and serving as a primary point of contact to\npositively impact patients, families, community referrals, and visitors. Communicated with Patients and Families, Physicians, and Colleagues in a\ndiplomatic, caring, and empathetic manner to provide emotional support, answer questions, resolve issues concerning the administrative\ncoordination of their care, and ensure high levels of patient satisfaction. Identified Roadblocks to Architect Innovative Performance Improvements\ncharged with resolving issues, increasing efficiency/effectiveness, enhancing business operations, meeting long/short term objectives, optimizing the\nquality of patient care, boosting fiscal revenues, and maximizing compliance levels. Assigned and Prioritized Patient Care Services, Procedures,\nand Appointments to meet aggressive simultaneous objectives while also ensuring patients have time for rest and family visitation. Provided\nAdministrative/Office/Accounting Support. Organized files and records, prepared invoices, agendas, and expense reports, created presentations,\nauthored correspondence letters/memoranda, and ordered supplies. Managed, Allocated, and Forecasted Inventory Levels, monitored\nequipment/supplies, and scheduled maintenance/repairs to ensure uninterrupted operations and the completion of complex projects/programs\nwithin aggressive deadlines. Empowered Junior Staff Members to Meet both Individual and Team Goals by providing both training and positive\nand consultative leadership. Answered questions, resolved staff/operational issues, and shared best practices.",
    "skills": "business operations, clerical, com, Interpersonal Skills, CPR Certified, customer service, databases, Documentation, First Aid, government,\nleadership, Access, Excel, mail, Microsoft Office, Outlook, PowerPoint, Word, monitors, organizational, process improvement, Processes,\nprotocols, quality, quality improvement, reporting, Six Sigma, Spreadsheet, Word Processing, Written",
    "education": "M.H.A.MASTERS : HEALTHCARE ADMINISTRATION , 2014\nThe University of Phoenix - City , State\nHEALTHCARE ADMINISTRATION\nB.S :\nBACHELOR OF SCIENCE : BUSINESS ADMINISTRATION , 1 2008\nDallas Baptist University -\nBUSINESS ADMINISTRATION",
    "certifications": "CPR Certified, First Aid Certified, and Six Sigma Certified-Black and Green Belt (ExpertRating.com) Strong Analytical and Effective\nCommunication, Excellent Verbal, Written and Interpersonal Skills, Professional Handling of exposure to confidential/Sensitive Information,\nProficient in Spreadsheet, Word Processing and Presentation Software, Maintain positive and supportive attitude and demeanor"
  }
}