{
  "file_name": "16288901.pdf",
  "sections": {
    "general": "INTERIOR DESIGNER",
    "objective": "To obtain a position with a reputed organization, where I can utilize my skills to contribute the organization's success, a position where my\neducation, experience and motivation allow me to make a valuable contribution.\nHighlights\nProficient in AutoCAD\nAdobe InDesign\nAdobe Photoshop\nConcept development\nDrafting\nPhotography\nSpace planning\nProduct specifications\nInterior architectural detailing\nColor and material application\nProficient with furniture systems",
    "experience": "01/2015 to 01/2016\nInterior Designer Company Name\nCreate comprehensive drawings perfectly referring to available notes, sketches, and tender drawings received from contractors.\nPrepare detailed technical content.\nCreate drawings using AutoCAD for fabrication and production.\nApply modifications on Shop Drawings as per received revisions from consultants.\nPrepare a full Submittal of Shop Drawings.\n10/2013 to 06/2014\nCompany Name\nShop drawings and Preparation of architectural shop drawings and details.\nAssist PM to verify quantities of works and materials.\nMake frequent and efficient site visits to check on quality of works.\nEnsure implementation of designs and plans on site.\n01/2013 to 01/2016\nInterior Designer\nAssign meeting with clients.\nPlanning and decorating interior spaces as per client's requests and needs.\nDraw up sketches or designs in order to help clients visualize how their space will look.\nRecommend finishes and treatments for all areas of the space.\nMake frequent and efficient site visits to check on work.\nEnsure implementation of designs and plans on site.\n07/2011 to 01/2016\nFashion Designer\nDesign clothing and accessories, creating original garments or design garments that follow well established fashion trends.\nDevelop the line of color and kinds of materials.\nVisiting textile showrooms to keep up-to-date on the latest fabrics.\nWork with the stitching staff to ensure design protocols are being followed.",
    "education": "2014\nBachelor of Arts : Interior Design Lebanese International University ï¼​ City Lebanon\n2011\nBaccalaureate : Life Sciences Nazih Bizri High School ï¼​ City Lebanon Life Sciences",
    "languages": "Fluent in English and Arabic.\nCHARACTERISTICS\nStrong team player with excellent communication skills\nAble to meet deadlines\nAttentive to details, accurate and systematic\nAbility to analyze the critical issues."
  }
}