{
  "file_name": "16626724.pdf",
  "sections": {
    "general": "CONSTRUCTION AND DESIGN PROJECT MANAGER",
    "summary": "Seasoned Design and Construction Project Manager with more than 13 years' experience in managing multimillion projects in the US and abroad.\nExpertise in coordinating and overseeing all aspects of design and construction, from conceptualization to completion, while providing continuous\nstatus reports to business owners and investors. Proven track record of achieving construction goals and consistently completing projects on time\nand budget. Fluency in English and Italian with working knowledge of Spanish and French. Seeking to leverage success and experience to take\nnext career step in a challenging project management position with a respected institution in Connecticut.",
    "skills": "architect, Art, budget management, Budget Development and Management, budgets, budget, building codes, Contract Negotiations, contracts,\nDesign and Construction, hiring, materials, Access, Excel, Microsoft Office Suite, Outlook, PowerPoint, Word, Office Manager, Procurement,\nProject Management, Proposal, purchasing, QuickBooks, Research, safety, Sage, Solomon, Timberline",
    "experience": "Construction and Design Project Manager 10/2002 to Current Company Name City , State\nOversee all facets of project management for several multimillion-dollar restaurant and residential projects in New York City and London,\nincluding contract negotiations and administration, project estimation, material purchasing, budget management, and site management;\nmanaged design and construction for 10 projects to date.\nCoordinate with owner and investors during pre-construction phase to develop requirements, scopes of work, and budgets; execute and\nmanage budget and schedules from conception to completion.\nOrganize trades, procure source materials, and liaise between owner, principal architect, designers, engineers, subcontractors, and vendors.\nPartner with architects to solicit bids for construction and design, assess bids, and award contracts.\nManage selection and hiring of design and construction subcontractors, and work with both teams to achieve milestones on time and on\nbudget.\nDocument observations and photograph ongoing design and construction work, produce field reports, and regularly communicate project\nstatus to internal partners weekly.\nInvestigate issues and expedite resolution to maintain timelines and budgets; develop strategies to prevent recurrence of issues.\nResearch and commission artisans to build site specific and custom objects for interior and exterior design and décor.\nSource and purchase materials from international vendors, and purchase and coordinate material shipments from vendors to construction\nsites.\nEnsure compliance with requisite regulations, including federal, state, and local building codes and safety guidelines.\nPast experience includes Education Program Coordinator at Solomon R.\nGuggenheim Museum, Office Manager at Cranmer Art Conservation, Inc., and Assistant Program Manager at Trinity College.\nEducation and Training\nBachelor of Arts : Museum Studies and Art History Art History Italian The City College of New York City , State Museum Studies and Art\nHistory Art History Italian\nThe University of Vermont City , State Dean's List",
    "certifications": "Design and Construction Budget Development and Management Project Management Requests for Proposal and Estimation Contract\nNegotiations and Administration Sourcing and Procurement"
  }
}