{
  "file_name": "16849128.pdf",
  "sections": {
    "general": "FEDERAL GRAIN INSPECTOR",
    "summary": "Service-oriented Process Operator with 5 years background working in the Industrial Industry. Core competencies\ninclude Processing, Observing, Analyzing chemicals and other matters, as well as excellent communication and time management skills. Handle\ntasks with accuracy and efficiency.",
    "skills": "Production and Processing Â Basic computer skills\nIndustrial and Environmental safety Â Good oral and written communication skills\nMechanical aptitude and equipment troubleshooting ability. Â Previous manufacturing skills\nBasic math skills and the ability to compute decimals and perentage. Â Able to lift up to 70 pounds, use tools\nÂ Team workÂ\nÂ",
    "experience": "Company Name City , State Federal Grain Inspector 06/2015 to Current\nPrepare grain samples for grading by preforming the necessary tests to determine moisture content, test weight, dockage, and presence of foreign\nmaterial.\nPerform specialized tests such as aflatoxin and protein analysis; calibrates equipment, grind samples, read results and enters reading on official\ncertificates.\nInspect ship holds for loading, and safety procedures.Â\nCompany Name City , State Process Operator Intern 06/2015 to 09/2015\nMonitor equipment functioning, observe temperatureÂ levels, and flow gauges.Â PerformÂ regular unit checks\nin order to ensure that all equipment is operating as it should.\nControl equipment to regulate the flow and pressure of gas to feed lines of boilers, furnaces, and related steam generating or heating equipment.\nCompany Name City , State B Class Electrician 01/2010 to 06/2015\nInstall or calibrate electrical or mechanical equipment such as motors, engines, switchboards, relays, switch gears, meters, and pumps.\nCut, bend, or shape mental conduit for installation in new construction plant, using a hydraulic bender and pipe threader.\nEducation and Training\nAssociate of Science : Process Technology 2013 ITI Technical College , City , State , United States\nActivities and Honors\nOSHA CARD Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â\nSECURITY PASSPORT\nCURRENT TWIC CARD HOLDERÂ\nWATER SURVIVAL/HUET HSE0039\nMEDIC FIRST AID CPR AEDÂ\nFALL PREVENTION AND PROTECTION WORKER (DNE)Â\nHSE SUPER SAFETY COURSE"
  }
}