{
  "file_name": "16877897.pdf",
  "sections": {
    "general": "ASSISTANT MANAGER - HR\nwww.linkedin.com/in/sumankumari725b9236\nProfessional Summary\nLooking for a challenging position, which utilizes my skills, hard work and provides opportunities to learn and contribute to the organization. I want\nto see myself as an active contributor to a team of ambitious people and thereby enhance my knowledge and personality. Human Resource\nProfessional with over 4 years of rich experience in Recruitment, Organization Developement, Time Management, Training & Development,\nPerformance Management, Employee Engagement, TPM & Audit. Worked as an Assistant Manager- HR (Generalist Profile) with VARROC\nPOLYMERS PVT. LTD at its manufacturing unit and assisted HRM & SAP at the unit. Possess strong communication, interpersonal, problem\nsolving skills and analytical skills. Strong communication, collaboration & team building skills with proficiency at grasping new technical concepts\nquickly and utilise the same in a productive manner. Fast Learner (demonstrated ability to learn and master new skills/tools, even in strictly harsh\ndeadline) Mentor and groom resources.",
    "skills": "basic, Benefits, budget, business plan, cost reduction, CSS, client, clients, database, delivery, Designing, full life cycle, Functional, hiring, HTML,\nHR, Internet Applications, ISO, JavaScript, letters, Excel, MS Office, Outlook, Power Point, 2000, Windows 95, 98, Word, ESS, MIS,\nEnterprise, Operating Systems, Organizing, Organizational, Painting, Payroll, Performance Appraisal, Performance Management, Personnel,\npromotion, Recruitment, requirement, Safety, SAP, SAP R/3 4.7, SAP-HR, scheduling, scheme, SQL, Time Management, training programs,\nWritten",
    "education": "Bachelor of Education (B.Ed) : Education , 2014-2015\nMagadh University - City\nMBA : Human Resource , 2006-2008\nXavier Institute of Social Service - City\nHuman Resource\nBachelor of Science (B.Sc) : Biotechnology , 2002-2005\nRanchi University - City"
  }
}