{
  "file_name": "17103000.pdf",
  "sections": {
    "general": "MULTI-SKILLED ENGINEERING MANAGER\nQualifications\nMicrosoft Project\nMicrosoft Office\nMicrosoft Visio\nIBM Rationale DOORS\nCommunication/Presentations\nRisk Analysis\nProcess Improvement\nCMPro",
    "experience": "Multi-Skilled Engineering Manager 03/2015 to Current\nCompany Name City , State\nGraduate of Boeing's GS&S Emerging Leadership Development Program.\nSelected to participate in Boeing's Systems Engineering Leadership Program.\nTested and implemented first time quality metrics across Boeing's GS&S division.\nRecognized as a Technical Lead Engineer within the Hardware Engineering Integrated Product Team (IPT).\nLed a hardware team through the successful development and delivery of multiple F-15 training systems to customers including the United\nStates, Korea, Singapore and Saudi Arabia.\nManage a team of sixteen electrical and mechanical engineers who are responsible for the design and development of high fidelity training\ndevices for the US Navy, Royal Australian Air Force and NASA.\nThese devices include the P-8A, F-22 and the CST-100 Starliner.\nLead multiple initiatives with a goal of continuous improvement.\nThese initiatives have included a thirty-five percent reduction in the electrical engineering cost estimating relationship, simplifying the retrofit\nprocess, modifying the peer review process, implementing Design To Value and focusing on first time quality.\nWork with engineers on my team to aid them in their career development by providing them opportunities with increased responsibility.\nResponsible for staffing projects in work and new projects as they are awarded.\nDevelop project schedules and monitor performance using Earned Value Management (EVM).\nManage communication between multiple teams including systems engineering, procurement, manufacturing and software engineering.\nLead Systems Engineer 08/2008 to 03/2015\nLed a multi-functional team in the development of hardware systems to support military, space capsule and commercial flight simulators.\nPerformed project management tasks such as working with the customer to define the scope of the project, developing project schedules,\ngenerating staffing profiles, and monitoring the project with EVM.\nSupported technical proposals by defining hardware solutions, developing project schedules, assisting in the creation of a Work Breakdown\nStructure, producing the Bill of Materials and providing hardware labor estimates.\nServed as the technical point of contact for multi-function teams including electrical engineering, mechanical engineering, software\nengineering, procurement and manufacturing.\nPresented technical solutions and project status to senior management and customers.\nLead Electrical Engineer 05/2005 to 08/2008\nCompany Name City , State\nLed electrical engineering for the design, development, manufacturing and delivery of ten military flight simulators for the US Air Force and\ntwo flight simulators for Singapore.\nTeam was able to complete electrical engineering tasks ahead of schedule and under budget.\nInitiated the lean practice of performing hardware checkout in the final phase of manufacturing instead of waiting for manufacturing turnover.\nThis practice resulted in a schedule savings of three weeks per flight simulator.\nValidated electrical engineering drawings met the requirements and were compliant with our drawing standards.\nSupervised the installation of numerous flight simulators throughout the United States, United Kingdom and South Korea.\nElectrical Engineer 11/2001 to 05/2005\nDesigned electrical systems to be integrated in military flight simulators.\nThese systems included AC/DC power distribution, video distribution, control loaders and communication systems.\nDesigned wire harnesses for military flight simulators.\nThis effort consisted of specifying the components, wire and connector sizing, and interfaces.\nDeveloped design specifications, schematics and assembly drawings for the manufacturing of military flight simulators.\nPlayed an integral part in the production of the first high fidelity F-15 flight simulator based on an architecture consisting of personal\ncomputers.\nInitiated the trade study to utilize commercially available uninterruptible power supplies instead of custom designed power distribution\nsystems to provide power to simulators.\nResulted in a cost savings of $150,000 per training facility.",
    "education": "Master of Business Administration (MBA) Indiana University\nBachelor of Science : Electrical Engineering Electrical Engineering\nBSEE University of Evansville\nProject Management Graduate Certificate Villanova University",
    "interests": "Secret Security Clearance Youth Sport Coordinator and Coach",
    "skills": "Air Force, budget, Hardware, Conflict Management, continuous improvement, DC, delivery, DOORS, electrical engineering, electrical systems,\nEngineer, Estimating, senior management, functional, drawing, Hardware Design, IBM, Leadership, Team Leadership, Leadership Development,\nMaterials, mechanical, mechanical engineering, Microsoft Office, Microsoft Project, Microsoft Visio, Navy, peer review, power distribution,\npower supplies, Presentations, Process Improvement, procurement, producing, Project Management, Project Planning, proposals, quality, Risk\nAnalysis, schematics, Siemens, software engineering, staffing, Systems Engineering, video\nAdditional Information\nADDITIONAL INFORMATION Secret Security Clearance Youth Sport Coordinator and Coach"
  }
}