{
  "file_name": "17704246.pdf",
  "sections": {
    "general": "SALES ASSOCIATE",
    "summary": "Experienced Manager at HyVee Grocery Store with excellent client and project management skills. Action-oriented with strong ability to\ncommunicate effectively with technology, executive, and business audiences. Self-motivated and dependable while achieving high performance with\nminimal supervision. Â Demonstrated the ability to complete tasks accurately despite interruptions and competing demands.\nDetail-oriented and organized Transportation Logistics Coordinator offers comprehensive background in transportation management. Expert in\ntransportation operations, waste prevention and safety compliance.\nHyVee Â with broad background, including management, customer service and general warehouse operations. Vast experience in all aspects of\nloading and transporting materials.\nResourceful Hyvee and Retech with 2 years Hyvee and Â ReTech 1year in warehouse and inventory management. Specializes in increasing\nefficiency and accuracy in shipping and receiving operations.\nHyvee and ReTech Â trained in supply chain management with extensive knowledge of enterprise deployment systems.\nHardworking [ specializing in efficient loading of merchandise and on-time deliveries.\nVersed in all operational and financial aspects of fleet management, quality control, inventory control and customer service. Successful 16+ year\ncareer in shipping and supply chain management.\nDynamic and results-oriented delivery professional specializing in business operations and transportation management. Excels in organized\nrecordkeeping and client relations.\nDemonstrated the ability to complete tasks accurately despite interruptions and competing demands.\nExperienced Â with excellent client and project management skills. Action-oriented with strong ability to communicate effectively with technology,\nexecutive, and business audiences.\nSelf-motivated and dependable while achieving high performance with minimal supervision. Â\nCreative professional with extensive project experience from concept to development.Â",
    "skills": "Quick learner Operations management\nTraining and development Excellent communication\nChange management Excellent communication\nReports generation and analysis Client-focused\nTime management skillsÂ Excel in management, maintenance",
    "experience": "Customer Satisfaction\nAchieved high customer satisfaction for professional installation of [equipment].\nMachine Troubleshooting\nPerformed effective troubleshooting of [machines/systems] Â [Number] per [week/month/year].\nPurchasing\nMaintained inventory of spare parts inventories and completed purchase requisitions as necessary.\nRequisitioned new supplies and equipment.\nCompleted tear downs of existing structures and prepared for new construction.\nProject Management\nUsed GSupply Solutions ShopTrakker to manage projects.\nQuality Control\nIdentified and moved empty and broken pallets to proper areas.Adhered to quality control procedures and documented quality checks.\nQuality Control\nIdentified and moved empty and broken pallets to proper areas.Adhered to quality control procedures and documented quality checks.\nScheduling\nScheduled and tracked all repairs.Tracked and processed purchase of parts to accounts payable.Â\nProject Planning\nProvided project controls, cost estimation, and other business support services to technical line management.\nProgramming\nProgrammed general maintenance machinery including lathes and band saws.\nCleaned all construction areas to avoid hazards.\nInventory Control\nRestocked and organized items as necessary and as directed.\nOperation Monitoring\nWatched indicators to make sure machines were working properly.\nQuality Control\nIdentified and moved empty and broken pallets to proper areas.Adhered to quality control procedures and documented quality checks.\nDocumentation\nReported and documented unsafe conditions, equipment and/or injury.\nProduct Inspection\nInspected products to ensure highest quality.\nVendor Management:\nSaved 8% on supply costs by working closely with suppliers to ensure components met department quality standards.\nMachine Set Up\nGave directions to other workers regarding machine set-up and use.\nPreventative Maintenance\nServiced equipment daily, reducing the need annual new equipment, leading to cost savings of $90,000.\nMachine Repair\nDetected machine malfunctions and problem-solved accordingly.Repaired, maintained and replaced parts on dies.\nEquipment Maintenance\nPerformed routine maintenance on equipment on as-needed basis.\nTesting\nInspected and tested machinery and equipment to diagnose machine malfunctions.\nInspection\nInspected electrical systems, equipment, and fixtures to identify safety hazards for replacement or repair.Â\nCrew Management\nInterviewed, hired, trained and evaluated team of 25 construction employees.\nSafety Audit\nLed monthly safety audits to monitor employee behavior and ensure safe compliance with company policies and safety regulations.\nMaintenance\nReduced equipment downtime by 25% through planned maintenance.\nSupervision\nTrained contract workers to perform general warehouse duties to company standards.\nBlueprint Reading\nRead blueprints, work orders, and production schedules to accurately determine job instructions and specifications.\nTraining\nResponsible for providing vision and guidance to a group of 20 construction employees, training them on sufficient project plans and\nprocedures.\nPerformed heavy labor such as lifthing up to 50 pounds and hauling.\nProblem Diagnosis\nUsed operational knowledge of systems, parts and components to solve problems that arose during assembly.\nHighlights\nAutomated paint mixing Exceptional problem solver\nTools maintenance Quality control\nColor matching Team player\nDent filling Demolition\nEstimate preparation Detail-oriented\nCollision repair Customer service experience\nSurface preparation Strong communication skills\nCustomer service skills Strong organizational skills\nStrong work ethic Leadership\nConstruction health and safety Flexible work schedule\nBasic math skills Strategic project planning\nLabor relations Blueprint reading\nConstruction means and methods OSHA Certified\nBlueprint reading and interpretation Excellent plan comprehension\nPower tools Lifting up to 100 lbs\nAccurate measurements and estimates Timely project completion\nQuality management systems Hiring and staffing\nProduction line/assembly lineÂ Good at following instructions\nSafety understanding Solid communication skills\nBlueprint interpretation OSHA regulatory compliance\nSolid independent worker English fluency\nDependable independent worker Manual labor skills\nStrong interpersonal skills Establishing goals and setting priorities\nDeadline driven Managing large crews\nDirect labor crew training High school diploma",
    "certifications": "Member Institute of Logistics and Transport (MILT)",
    "interests": "Racing car on the race track\nHelp my wife\nWatching football and baseball.\nWork on carsÂ\nSpend time with family",
    "languages": "English\nPersonal Information\nWell, I am 37 years old. Born and rasied in Fort Dodge, IA. Also, married to Cassie Short my wife of the 3years. But been with her for 7 years\ntotal. Having a baby in April of 2019. My wife and have a dog. He is very hyper dog but a very good protector.Â"
  }
}