{
  "file_name": "17926546.pdf",
  "sections": {
    "general": "ENGINEERING ASSOCIATE\nProfile\nTeam-oriented Engineering Associate with over 8 years experience designing, developing, maintaining, and testing electro-mechanical systems.",
    "skills": "CAD, hardware, client, DC, Drafting, electronics, Engineer, Engineering Design, frame, functional, inspection, Logic, machinery, materials,\nmechanical, Mechanical design, Microsoft Excel, Microsoft power point, Microsoft Visio, PLC, presentation skills, Process improvement, product\nimprovement, programming, Project management, protocols, purchasing, quality, Radiography, read, reporting, Scheduling, schematics, Six Sigma\n5, software testing, system integration, Team player, triage, Troubleshooting, validation, Vision, Microsoft Visual Basic, wiring diagram\nAdditional Information\nIDEXX Laboratories Westbrook, ME, US 4 week long training for Six Sigma 5x technical problem solving methodology GD&T 2015\nTech-ese Portland , ME, US Geometric Dimension and tolerance week long training High School 2007 Sanford High School Sanford, Me,\nUS Graduated with Honors Electronics 2007 Sanford Regional Vocational Center Sanford, ME, US Graduated the Vocational electronics\nprogram and was a member of the National Technical Honors Society",
    "professional experience": "Engineering Associate 05/2008 to Current Company Name City , State\nStarted as an instrument Tech on the Manufacturing floor responsible for building and servicing Catalyst DX.\nWorked as a stand in technical lead for a few months.\nMoved to Catalyst Pilot line in 2011.\nWas responsible for lab maintenance, Instrument software testing, validation of new components, and extended instrument field fail triage.\nIn the fall of 2013 I started working under an Engineer for the Digital Radiography department.\nI am responsible for product reliability, product improvement and NPD qualification including writing test protocols, test execution, reporting\nfindings.\nOther responsibilities include ESD implementation and testing, lab maintenance and management.\nI work with suppliers and customers on a regular basis.\nI work in a large cross functional group daily.\nI am considered a hardware subject matter expert for all CR and DR instruments at IDEXX.\nI am familiar with the software and system integration.\nI have had the opportunity to design multiple components and test fixtures from electrical test boxes to metal inspection jugs and composite\nprotective covers.\nIn addition, I am responsible for all obsolesces and validation testing.\nIn addition, I train all new personal on equipment and filed servicing systems, including software, mechanical, and electrical AC/ DC\ntroubleshooting.\nIn this position I oversee work from technicians and interns working on and assisting with various projects.\nElectrical Technician and Mechanist 02/2007 to 03/2008 Company Name City , State\nResolved part and assembly discrepancies.Collaborated with engineers and project managers regarding design parameters for client\nprojects.Designed brackets and custom frame work for automated machines.\nPrepared accurate specifications for purchase of materials and equipment for purchasing department.Debugged and troubleshot complex\nanalog, digital, and RF circuits.\nWorked with and troubleshooted Programmable Logic Controllers (PLC) and assembly lines to maintain productivity.on the automated\nmachinery at customer sites.\nassembled complex electrical circuits both AC and DC.\n04/2006 to 08/2009 Company Name City , State\nWorked in multiple departments to provide quality care for patients.\nMaintained medical records, worked with families to.\nprovide quality care.\nEducation and Training\nAssociate of Applied Science SMCC South City , State , US I studied at SMCC in 2007-2008 towards a degree in applied science in the field of\nelectronics.\nDrafting and design YCCC Wells, ME, US Studied CAD and Drafting in the Engineering Design Program Currently working with YCCC and\nUSM in Industrial Management- consideration in electro-mechanical systems : mechanical engineering 2015 mechanical engineering\nPersonal Information\nIDEXX Laboratories Westbrook, ME, US"
  }
}