{
  "file_name": "17983430.pdf",
  "sections": {
    "general": "CUSTOMER SERVICE REPRESENTATIVE\nCareer Focus\nDedicated and skilled cash administrator who excels at prioritizing, and completing multiple tasks simultaneously. Committed to delivering high\nquality results within a timely manner, with little to no supervision. Energetic, organized, and professional.\nSummary of Skills\nExcellent analytical skills\nMicrosoft Office, Excel, and PowerPoint proficiency Cooperative team member\nQuick learner Computer proficient\nOutstanding interpersonal skills Extremely organized\nIssue resolution Energetic and organized\nAttention to detail\nEducation and Coursework\nAssociate of Applied Science : Paralegal 2016 Central Piedmont Community College City , State\nMember ofÂ National Honor Society on Paralegal Lambda Epsilon Chi\n3.56Â GPA",
    "experience": "Customer Service Representative 05/2015 to Current Company Name City , State\nWorked as a team member performing cashier duties, product assistance and cleaning.\nExpressed appreciation and invited customers to return to the store.\nUp-sold additional menu items, beverages and desserts to increase restaurant profits.\nTook necessary steps to meet customer needs and effectively resolve food or service issues.\nRecorded customer orders and repeated them back in a clear, understandable manner.\nAviation Electrician 08/2010 to 08/2014 Company Name City , State\nPerform scheduled and unscheduled maintenance on 10 F/A-18C aircraft electrical systems and related equipment.\nPromoted to Work Center Training Petty Officer April 2012.\nMaintain training records for over 19 personnel.\nDedication was key in achieving all available qualifications, leading to the selection of Plane Captain of the Quarter.\nConsistently volunteer to assist in aircraft maintenance regardless of the difficulty.\nProduce quality work with minimal supervision.\nQuickly established as a hard charger with the desire to be a productive member of the work center.\nMay 2011 qualified on two pieces of Ground Support Equipment and two personal qualifications increasing work center readiness.\nCapable of success regardless of assignment complexity, gained greater responsibility with confidence and motivation.\nDisplays a keen sense of duty in the acceptance of all assigned responsibilities.\nWork well under pressure producing optimal results.\nApproach every assignment thoughtfully and with enthusiasm.\nSales Associate 03/2009 to 04/2010 Company Name City , State\nAssessed customer needs and responded to questions.\nCleaned and straightened work area.\nIssued receipts for purchases and gifts.\nOrganized register supplies.\nUnboxed new merchandise.\nRotated stock to maintain freshness.\nOperated cash register with proficiency.\nProvided professional and courteous service at all times.\nWorked overtime shifts during busy periods.\nSales Associate 09/2007 to 04/2010 Company Name City , State\nGreeted all customers.\nDelegated tasks to team members to optimize productivity.\nHandled products and equipment in accordance with safety and sanitation guidelines.\nFulfilled special order requests, including special occasion dinners and party platters.\nSafely used knives, scales, wrappers, compactors, garbage disposals, pallet jack and hand trucks.\nOrganized and positioned product cases in produce warehouse and walk-in cooler.\nServed shoppers in a prompt, courteous and friendly manner.\nPersonal Information\nSelf-motivated, goal-oriented professional with a progressive track record, dedicated to surpassing mission objectives, visions, and goals. United\nStates Navy Aviation Electrician.",
    "skills": "Attention to detail, interpersonal skills\nExcel, Microsoft Office, PowerPoint\nQuick learner"
  }
}