{
  "file_name": "18368613.pdf",
  "sections": {
    "general": "Z\nSALES CONSULTANT",
    "summary": "Highly motivated, competitive, sales consultant seeking opportunity with long-term growth potential through integrity sales success, building\nrelationships and developing the business Performance Skills *Account Penetration *Adaptability *Identify and create new business opportunities\n*Brain lab navigation experience *Demonstrating Products *Product Launch *Account Relationships *Confident clinical expertise\nSnap Shot\nSales Consultant\nCity , State Company Name / Jun 2013 to Current\nCultivate relationships with surgeons while covering procedures with clinical proficiency and business acumen.\nBuild and implement sales plan, manage and track customer sales activity and prospective customer initiatives.\nTeam increased territory sales 12.5% to 3.8 million in 2014, 5% to 4 million in 2015 and 10% to in 2016.\nIncrease physician volume through PCP events, community outreach programs and marketing strategies.\nServe as a primary resource to key accounts for full line product support and continued service.\nAbility to troubleshoot complex issues with highly creative solutions.\nMaintain training in sales skills, new technologies, product features, and competitive product portfolios.\nDevelop relationships with hospital personnel and key account stakeholders to expedite sales.\nDemos and lab training to demonstrate products and surgical techniques.\nOffice Intern\nCity , State Company Name / Oct 2012 to May 2013\nCompiled sales data, generated sales reports for territory managers and profiled prospective surgeons.\nOrganized and distributed marketing information, product portfolio, audits and sales goals projections.\nOrganized and participated in training labs for potential surgeon customers.\nServer / Bartender\nCity , State Company Name / May 2010 to May 2013\nWorked full-time while completing bachelor's degree and internship.\nAmongst top 5 in sales regularly maintaining $90 plus per person guest average.\nExceptional multi-tasking ability proven to effectively and efficiently service large amounts of business.",
    "education": "B.B.A : Business Management Management Information Systems, Business Intelligence Florida Atlantic University May 2014 City , State\nBusiness Management Management Information Systems, Business Intelligence",
    "skills": "competitive, features, marketing strategies, marketing, multi-tasking, personnel, sales skills, sales, sales plan, sales reports, surgeon, troubleshoot"
  }
}