{
  "file_name": "18569929.pdf",
  "sections": {
    "general": "PAYROLL ACCOUNTANT",
    "summary": "Sixteen years experience reconciling the general ledger system, four years experience in accounts payable and eleven years experience in accounts\nreceivable. Good organizational skills and detailed oriented.\nHighlights\nFAS Asset Accounting\nExcel\nQuickbooks\nWord\nAnytime Scheduler\nOutlook\nKRONOS\nInternet Explorer\nMunis\nFRX\nMAS90\nNetscape Messenger\nJD Edwards",
    "experience": "Payroll Accountant 07/2006 to Current Company Name City , State\nAnswered employee questions regarding pay and resolved any issues and discrepancies\nAdvised managers on organizational policy matters and recommend needed changes..\nProcessed and submitted Teacher Retirement reports and payments\nUpdated confidential employee banking information with accuracy and speed\nRan the monthly and bi-weekly payroll process.\nReviewed salary changes stemming from merit increases, promotions, and pay adjustments.\nAccountant 04/2002 to 06/2006 Company Name City , State\nVerified details of transactions, including funds received and total account balances.\nCoded the general ledger and processed vendor invoice payments.\nDeposited third party checks, as well as monthly reserve transfers.\nBalanced batch summary reports for verification and approval.\nResearched and resolved billing and invoice problems.\nMaintained detailed administrative and procedural processes to improve accuracy and efficiency.\nProvided support for owner and sales team in managing operation work flow.\nHandled cash and deposits using the proper accounting procedures and documentation.\nResearched and resolved collections and billing disputes with tact and efficiency.\nSet up, tested and configured networks, desktops, laptops and printers.\nStaff Accountant 07/2001 to 03/2002 Company Name City , State\nPrepare consolidated financial statements.\nReconcile fixed asset system with general ledger.\nRun and make journal entries for depreciation of fixed assets.\nTransition financials and fixed assets due to merger with PRG.\nStaff Accountant 01/2000 to 06/2001 Company Name City , State\nProcess billing and cash receipts.\nReconcile accounts receivable general ledger account.\nVerified/requested insurance coverage on all equipment.\nProcessed journal entries.\nPrepared reports for the Board of Directors.\nPrepared weekly reports for creditors and Controller.\nAccounts Receivable Administrator 01/1999 to 12/1999 Company Name City , State\nProcessed cash receipts and credit card payments.\nReconciled general ledger account.\nReviewed new accounts for credit.\nContracts Processor 02/1993 to 12/1998 Company Name City , State\nAudited customer contracts\nVerified and billed contracts billing fixed price\nAssisted project managers in closing out contracts\nAssisted with both, internal and external, audits\nTrained personnel in Raleigh, NC on processing contracts\nReconciled state accounts Assisted marketing in collecting large dollar invoices\nAudited vendor invoices for payment\nVerified accuracy of hourly charges, living expenses and equipment acquisitions\nTracked purchase order balances and generated Lotus reports for vendor files\nProcessed and audited service/contractor activity records which applied billing to service contracts and generated customer invoices\nAdvised project managers when contracts were overcharged on service contracts\nAudited vendor invoices for payment.",
    "education": "Master : Accounting & Financial Management 2014 Keller Graduate School of Management City , State\nAccounting & Financial Management with Certified Fraud Examiner emphasis\nBachelor of Science : Accounting 1993 DeVry University City , State\nAccounting\nComputer programming Army National Guard City , State\nDebug computers\nProgrammed system to working order",
    "skills": "Accounting, Accounts payable, Accounts Receivable, accruals, acquisitions, billing, closing, Consulting, contracts, Controller, credit, Customer\nSupport, financials, financial statements, fixed assets, general ledger, Human Resource, insurance, Internet Explorer, JD Edwards, Job costing,\nKRONOS, Lotus, marketing, MAS90, Excel, Outlook Express, Windows, Word, Netscape, Payroll, personnel, Quickbooks"
  }
}