{
  "file_name": "18731098.pdf",
  "sections": {
    "general": "SENIOR HR MANAGER\nProfessional Summary\nResults-driven and business-oriented professional with strong experience in business operations, full-cycle human resources, and administrative\nmanagement. Strong business acumen with the ability to execute a wide range of business management, administrative and practical strategies that\nresult in streamlined operations, increased production, workforce optimization, and employee retention. A top rated, proven performer who easily\nmoves from vision and strategy to implementation with an organizational focus. Ability to manage multiple tasks simultaneously in fast-paced\nenvironments demanding strong critical thinking, creative, interpersonal and time management skills. Human Resources Process & Project\nManagement Team Training & Development Staff Recruiting & Retention Organizational Optimization Benefits & Payroll Administration Policy &\nProcedure Development Administrative Management",
    "skills": "10 - Key Touch, Accounting, administrative support, ADP, balance, Benefits, Benefits administration, billings, bookkeeping, budgets, bi, cash\nflow, Coaching, oral communication, interpersonal skills, conversion, copying, CPA, credit, Customer service, Data entry, Database, directing,\nEmployee Relations, special events, Filing, finance, financial statements, forms, General office, Government, HRIS, Human Resources, Human\nResources Management, insurance, inventory control, invoicing, Kronos, logistics, Lotus Notes, managing, materials, mediation, meetings, Access,\nExcel, Microsoft Office, office, Outlook, PowerPoint, Windows, Word, networks, Operating Systems, payables, Payroll, Payroll processing,\nPersonnel, policies, purchasing, Recruiting, reporting, Safety, SAP, Staff training, staffing, Supervisory, tax, taxes, transportation, travel\narrangements, Typing, Excellent written, year-end",
    "education": "Master of Science : Health Administration , 5 2011\nCalifornia State University Northridge - City , State\nGPA: GPA: 3.85/4.00\nHealth Administration GPA: 3.85/4.00\nBachelors of Arts Degree : 5 2008\nUCLA -\nCertificate in Human Resources Management to be completed 6/2015 :\nAffiliations\nSociety of Human Resources Management (SHRM)"
  }
}