{
  "file_name": "18979238.pdf",
  "sections": {
    "general": "DIGITAL DESIGNER",
    "summary": "Your City, State, Zip Code Your Phone Number Your Email Date Name Title Organization Address City, State, Zip Code Dear Mr./Ms. Last\nName, The description you posted for a studio assistant parallels my interests and qualifications perfectly. With my background in art and\npsychology, I am confident that I would make a very successful and creative studio assistant. Having worked for the non-profit organization\nCountyArts, I have been exposed to a number of aspects of the art world. My experience as artist assistant at the Museum of Art demonstrates\nmy capability of working with others through the creative process of production while meeting the challenges presented to me. Also, my education\nin psychology has allowed me to learn the nuances of people and has provided me with good investigative and analytical skills that will suit your\nneeds for customer assistance. I would appreciate the opportunity to make a substantial contribution by exploring the business of applied art\nthrough your design firm. I welcome the opportunity to meet with you to further discuss my candidacy and will call next week to see if we might\narrange a time to speak. Thank you for your time and consideration. Sincerely, Signature FirstName LastName Ethan Araya Cover Letter Graphic\nArts\nHighlights\nMicrosoft Office (Word, Excel, PowerPoint, Access)",
    "experience": "Digital Designer\nCompany Name\nMany designs in High School, and posted them around school.\nMade many portfolios, and animated designs.\nCreated posters, and 2 dimensional designs.\nTechnical Director\nJuly 2009 to April 2011 Company Name\nImplement new or enhanced methods and processes for the processing, testing, or manufacture of nanotechnology materials or products.\nCollect and compile nanotechnology research and engineering data.\nSupervise or provide technical direction to technicians engaged in nanotechnology research or production.\nAssemble components, using techniques such as interference fitting, solvent bonding, adhesive bonding, heat sealing, and ultrasonic welding.\nSr. Technical Engineer\nJanuary 2007 to July 2009\nAssisted civil engineers on several key government projects involving roadway designs and improvements, solutions easing traffic congestion\nand replacement of deteriorating bridges.\nHandled cost-of-materials estimations, report and document tracking, project documentation, on-site project visits, invoice/agreement\nverification and building permit applications.\nGained experience in blueprint reading, as well as preparation of maps and plans.\nEdit.",
    "education": "High School Diploma : 6 2006 Elky High Elklan Oregon\nBachelor of Science : Civil Engineering , 3 2010 Foothill University ï¼​ City , State GPA: Chi Epsilon (Civil Engineering Honor Society), Dean's\nList (5 semesters) Activities: Member, American Society of Civil Engineers and Emerging Green Builders (EGB) Civil Engineering Chi Epsilon\n(Civil Engineering Honor Society), Dean's List (5 semesters) Activities: Member, American Society of Civil Engineers and Emerging Green\nBuilders (EGB)\nEngineer in Training (EIT) Certification Knowledge of engineering theories, principles, specifications and standards. : 1 2012 City , State\nNorth Bergen High School GPA: Received Honors in all art classes every year. 2nd honors in basic drawing, digital art 1. First Honors in digital\narts 2. Received Honors in all art classes every year. 2nd honors in basic drawing, digital art 1. First Honors in digital arts 2.\nPersonal Information\nA 76th street, 07047 Dear Ms. Gina Lucia The adds you have posted on your website mactches my qualifications in graphic art. I have\nremarkable skills in digital, and graphic arts, and I would make a great designer in, and out of the field. I've had much experience with graphic, and\ndigital art in High School, and posted my artwork on my website. This skill has taught me many things about creativity. When I make art in any\ndesign I notice that I am creating life on a blank piece of paper. To me making art is bringing the creativity to life, and to also give it any kind of\nemotions to it. I have worked with many people who had more experience then me, and have already started to work under you. If you speak to\nthem they can tell you more about my designs. I am a hard worker, and I will always do my best to get the job done. I hope this has given you the\nthought of allowing me to work under you. Hopefully we will have a chance to speak in person next week. Thank you for your time, and\nconsideration. Sincerely, Ethan Araya Ethan Araya",
    "languages": "Can read and speak in German and French.",
    "skills": "arts, blueprint reading, bridges, Computer experience, direction, documentation, Edit, Engineer, English, French, German, government, Graphic,\nmaterials, Access, Excel, Microsoft Office, PowerPoint, Word, posters, processes, read, research, Spanish, welding\nAdditional Information\n210A 76th street, 07047 Dear Ms. Gina Lucia The adds you have posted on your website mactches my qualifications in graphic art. I have\nremarkable skills in digital, and graphic arts, and I would make a great designer in, and out of the field. I've had much experience with\ngraphic, and digital art in High School, and posted my artwork on my website. This skill has taught me many things about creativity. When I\nmake art in any design I notice that I am creating life on a blank piece of paper. To me making art is bringing the creativity to life, and to also\ngive it any kind of emotions to it. I have worked with many people who had more experience then me, and have already started to work\nunder you. If you speak to them they can tell you more about my designs. I am a hard worker, and I will always do my best to get the job\ndone. I hope this has given you the thought of allowing me to work under you. Hopefully we will have a chance to speak in person next\nweek. Thank you for your time, and consideration. Sincerely, Ethan Araya Ethan Araya"
  }
}