{
  "file_name": "19176318.pdf",
  "sections": {
    "general": "SENIOR FINANCIAL ANALYST\nProfessional Summary",
    "skills": "Accounting, accruals, accrual, acquisitions, streamline, ADP payroll, Ad, AS/400, balance sheet, Banking, billing, budgets, Budget, business case,\nBusiness Development, business processes, CITRIX, closing, consulting, Corporate Finance, clients, Databases, documentation, drivers, due\ndiligence, Essbase, Executive Management, senior management, Fast, Finance, Financial, financial analysis, financial analysis and reporting,\nfinancial reporting, forecasting, general ledger, GREAT PLAINS, Hyperion, Information Technology, investments, JD EDWARDS, managing,\nmark, market, Marketing, meetings, Access, Microsoft Access, MS Access, Microsoft Excel, MS Excel, MS Office Suite, PowerPoint, modeling,\nperformance management, policies, pricing, processes, quality, record keeping, reporting, Research, SAP, SQL, statistics",
    "education": "BBA : Corporate Finance , The University of Toledo - City , State\nGPA: National Deans' List Corporate Finance National Deans' List\nBS : Accounting , The University of Paris Dauphine - City\nGPA: Graduated with honors Accounting Graduated with honors\nAccomplishments\nCareer Summary Accomplished Professional with P&L responsibility in domestic and international Fortune 500 companies.\nExtensive experience and strength in financial management, financial reporting, internal auditing, management reporting, manufacturing,\nmergers and acquisitions, organizational development, quality assurance, system development, and implementation.\nRecord of re-aligning organizations to achieve better economics of scale, including management of turnarounds and shutdowns.\nSkilled in creating strategic plans and in leading high performance teams to exceed pre-set goals.\nProven instincts to identify and solve unique business issues.\nKey Accomplishments Oversaw the general finance functions and supported the execution of a division's financial and strategic plans; the\ndivision generated more than 2 Billion dollars in revenue.\nUncovered and proved embezzlement by a former Regional Accounting Manager, company recovered 300K.\nRedesigned Chart of Accounts and financial statements by preserving comparability to more adequately reflect the company's financial\npicture.\nSuccessfully managed international invoicing and leasing of equipments."
  }
}