{
  "file_name": "19374660.pdf",
  "sections": {
    "general": "PROGRAM ASSISTANT\nProfessional Summary\nProgram Assistant with supervising experience and exceptional people skills. Versed in Daxko Operations, membership, childcare. Desires a\nchallenging role as a Membership Coordinator.",
    "experience": "Program Assistant , 07/2013 to Current Company Name ï¼​ City , State\nBilling/Finance, to include: Purchase Orders, Childcare billing, refunds and credits for different programs.\nWell versed in Daxko Operations.\nAssist in training, supervising member services associates.\nAssisted the Program Director with payroll and interviews for multiple programs.\nRun weekly program rosters and reports.\nInput member information and sell different programs.\nFile away CC statements and members information for various programs.\nReview and approve financial assistance Email and mail out member invoices.\nAnswer incoming calls and emails about members accounts and programs.\nUse varies office equipment, ie .Multi-phone systems, computers, fax machines, copy machines.\nOrdered and distributed office supplies while adhering to a fixed office budget.\nManaged office supplies, vendors, organization and upkeep.\nAnswered and managed incoming and outgoing calls while recording accurate messages.\nOpened and properly distributed incoming mail.\nGreeted numerous visitors, including VIPs, vendors and interview candidates.\nHelped distribute employee notices and mail around the office.\nMaintained a clean reception area, including lounge and associated areas.\nScreened all visitors and directed them to the correct employee or office.\nFront Desk/Customer Service , 11/2006 to 12/2010 Company Name ï¼​ City , State\nmember services including but not limited to access to health and fitness center, sales of membership and data entry.\nEnsure that services are provided in a quality manner at all times.\nProvide accurate information on activities and programs to members and participants.\nResponsible for ensuring prompt and courteous service which is delivered to members/participants.\nControls access to health and fitness facility.\nKnowledge of all program areas to members and participants as well as ability to refer patrons to the correct staff member when needed.\nEnsures that accounting and related procedures are followed for cash reporting and merchandise sales.\nData entry for service desk staff close out and deposits.\nAttend/participate in required monthly staff meetings.\nTakes payments for programs and memberships.\nResponsible for weekly and monthly reports.\nHandle many tasks at one time under lots of pressure.\nAnswer multi-line phones, takes messages through email or hand written.\nMake copies and also send out faxes.\nMaintained a clean reception area, including lounge and associated areas.\nHelped distribute employee notices and mail around the office.\nGreeted numerous visitors, including VIPs, vendors and interview candidates.\nAnswered and managed incoming and outgoing calls while recording accurate messages.\nDirected guests and routed deliveries and courier services.\nManaged office supplies, vendors, organization and upkeep.\nMortgage Document Clerk , 03/2002 to 01/2003 Company Name ï¼​ City , State\nRetrieving and Certifying Ginnie Mae, Fannie Mae, Freddie Mac, and FHLB loans.\nCreate loan folders and dividers.\nAudit new loans to loan schedule.\nInput loans on Trust System and FiTech/Empower.\nCreate new loan lists on Excel.\nUpdate old loan lists weekly on Excel.\nAnswer and handle incoming calls pertaining to loan lists.\nFinalize Ginnie Mae, Fannie Mae, Freddie Mac, and FHLB loans.\nMake copies for employees.\nLogging in documents on log in sheet and system.\nInput documents Empower and FiTech.\nSort and File away documents.\nJanitor/Clerk , 11/1996 to 02/2001 Company Name ï¼​ City , State\nEmployee of the month September 1997.\nRecovered and organized all clothing records.\nSupervised housekeeping and kept track inventory supplies for individual rooms.",
    "education": "High School Diploma : 1996 IOWA PARK HIGH SCHOOL ï¼​ City , State",
    "certifications": "First Aid-October 2013 (American Safety & Health Institute)\nCPR & AED Certification-October 2013 (American Safety & Health Institute)\nEmergency Oxygen Certification-October 2013 (American Safety & Health Institute)",
    "skills": "Excellent communication skills\nProfessional phone etiquette\nCustomer service-oriented\nMicrosoft Office/Excel/Powerpoint/Outlook/Word/Publisher\nAS400\nDaxko Operations"
  }
}