{
  "file_name": "19599699.pdf",
  "sections": {
    "general": "INTERN\nHighlights\nMicrosoft Word, PowerPoint, and Excel. Social Media: Twitter, Facebook, and Instagram",
    "experience": "January 2016\nto\nMay 2016\nIntern\nCreate and implement strength and conditioning workouts for spring season.\nMonitor weight lifting form and technique.\nProvide feedback and apply knowledge to strength training and conditioning programs.\nOrganize and prepare equipment daily for strength and conditioning programs.\nAugust 2015\nto\nDecember 2015\nCompany Name City , State Fitness Intern\nExposed to daily routine of fitness specialist and client interaction Conducted one-on-one orientation for new members and instructed in the\nproper use of equipment Assisted with revising programs offered to incorporate updated topics Created bulletin boards for Member-of-the-\nMonth Provided complimentary body measurements Maintained facility and equipment according to health and safety standards.\nAugust 2013\nto\nMay 2016\nCompany Name City , State Student Assistant\nUtilize Front Rush website to enter football and lacrosse recruit and roster information.\nOrganize and coordinate football recruiting events during the fall, including giving tours.\nProvide office support for football and lacrosse coaches.\nRestock office and break room supplies.\nMay 2013\nto\nDecember 2015\nCompany Name City , State\nIndividually standardized jelly and ice cream topping batches (checked pH, temperature, and consistency).\nTrained in operation and safety of a stand up and sit down forklift.\nConsistently met quotas when packed jelly, syrup, ice cream toppings and plate scapers into boxes.\nOperated label machine allowing for continual operation and upkeep.",
    "education": "May 2016\nBALDWIN WALLACE UNIVERSITY City , State Bachelor of Arts : Exercise Science Orthopedic Assessment and Treatment Health\nPromotion and Education Exercise Science Orthopedic Assessment and Treatment Health Promotion and Education BW Deans Award, Spring\n2014 and 2015\nRELATED BALDWIN WALLACE UNIVERSITY City , State\nProfessional Affiliations\nPre- Physical Therapy and Exercise Science Club ACTIVITIES Executive Member: CRU - Christian Organization Member: Phi Mu, Delta Iota\nFraternity",
    "skills": "client interaction, forklift, health and safety standards, Excel, office, PowerPoint, Microsoft Word, recruiting, safety, website"
  }
}