{
  "file_name": "19774173.pdf",
  "sections": {
    "general": "SALES ASSOCIATE",
    "objective": "To obtain a position with a growing company while promoting quality customer service and performing tasks provided efficiently.\nCore Strengths\nApproachable\nFlexible\nDedicated team player\nReliable and dependable",
    "work experience": "04/2016 to Current\nPersonal Trainer & Fitness Instructor Company Name - City , State\nSuggested exercise modifications to individual students to avoid strain and.\ninjury.\nTeach Circuit classes, Advanced Dance Fitness, and a Booty Builder class\n06/2015 to 04/2016\nFitness Instructor Company Name - City , State\nTaught Dance Fitness, Spin and Power.\nDesigned each class to match the skill and learning levels of all participants.\nCleaned and organized studio after each group fitness class.\n03/2015 to 03/2016\nVista Representative Company Name - City , State\nHelped underemployed, unemployed, and undergraduates further theirÂ education through Continuing Education programs.\nProctored C.R.C ( Â Career Readiness Career ) TestingÂ\nHelped with unemployment filing and weekly certification\n02/2014 to 02/2015\nSales Associate Company Name - City , State\nTeam player mentality Fitness programming specialist Verbal/written communication Zumba instructor Time Management Nutrition\nsupplement familiarity Opened and closed the store, including counting cash, opening and closing cash registers and creating staff\nassignments as well as shared product knowledge with customers while making personal recommendations to meet that specific need.\nEducational Background\n2012\nHigh School Diploma : General Studies Corinth High School - City , State , United States Teach Dance Fitness, Circuit Training, and Spin General\nStudies\n2017\nAssociate of Arts : Business Administration Accounting Northeast MS Community College - City , State Business Administration Accounting",
    "skills": "Cash handling\nProfessional and friendly\nPositive attitude and energy\nQuality customer service\n?"
  }
}