{
  "file_name": "20026169.pdf",
  "sections": {
    "general": "AIRCRAFT SALES\nProfessional Summary\nI expect to associate myself with a professionally driven, well-respected organization by pursuing a challenging, responsible, dynamic and\nrewarding career and applying my academic knowledge, expertise, skills and enthusiasm; which will assist my career development and contribute\neffectively to the progress of the organization and our society as well. Areas of expertise include investigative policy research and Statistical\nAnalysis, proven ability to interact effectively with employee and the public in a professional manner. Great team leader with strong organizational\nskills and formidable work ethic. Seventeen years construction management experience, with industrial and commercial construction jobs valued\nfrom four million to hundreds of millions of dollars. Last six years of construction as an owner operator of an Industrial Welding Company. Retired\nfrom Ironworkers Local Union 118 Sacramento on December 7, 2001. Went back to school to Utah Valley University in 2005 received a\nBachelor degree as a Professional Pilot and A Master's Degree from Arizona State University on December 19, 2012 with a Master's of Science\nTechnology Aviation Management (Human Factors). Supervisory Skills Able to multitask in different areas:Crew resource managementGroup\nteam leader Aviation Research and Statistical Analysis Task oriented to help improve safety and efficiency in day Â​ to Â​ day operations. Proficient\nwith the FAA and Department of Transportation standards and regulations that cover Flight rules (FAR and CFR (s)) and Public Airport policy\nCompetent in computer data processing concepts Proficient with verbal communication and visual communication techniques for various programs.\nProfessionally educated to gather information about the human abilities, limitations and characteristics and applying it to tools, machines, systems,\ntasks, jobs, policies, and their environments to produce a safe, comfortable and effective work environment. Competent to better understand how\nhumans are able to safely and efficiently integrate with technology. With this knowledge one can translate this experience into design, training,\nstandards and policies and to help reinforce individual performances Well versed with, SPSS, Excel, Power Point and some R.",
    "skills": "Photo, balance, Bridges, C, Dec 7, estimating, Instructor, Instruction, Insurance, Labor Relations, leadership, Law, Works, reading, Read,\nrecruitment, Research, Risk Management, Safety, scheduling, Seminars, Statistics, supervision, tax, Transportation, Welding, Workflow, written\nAdditional Information\nPERSONAL DATA AND ACCOMPLISHMENTS: Brown Belt in Tae Kwon Do Coached Pop Warner Football team to a Super Bowl\nChampionship. Went back to school in 2005 Â​ 2012 and received my Bachelor and Master's degree in Aviation Enjoy the outdoors,\nspending time with my family, Scuba Diving (since 1975), Flying General Aviation Airplanes Restore Antique Cars Avid Motorcycle Rider.\nVolunteer with Tuolumne Recreation Department Coaching Â​ Soccer, Baseball, and Football. Coached Middle School Boys/Girls\nBasketball (6th, 7th, & 8th graders)",
    "education": "Graduate Degree : Arizona State University (ASU) - City , State\nMaster : Science Technology Aviation Management - Human Factors GPA: GPA: 3.5/4.0 Science Technology Aviation Management - Human\nFactors GPA: 3.5/4.0 Applied Project - (FAA Sponsored) - Title: INVESTIGATION AND ANALYSIS OF 14 CFR PART 67 AND AME\nGUIDE 47 BEFORE AND AFTER POLICY CHANGE Course Work 33 Units:Aviation LawAviation Labor RelationsInternational\nAviationAviation Safety and Human FactorLaw and EthicsIntermed StatisticsAirport Planning and DesignResearch Techniques and Applications\n4 2010\nBachelor of Science : Aviation Science Aviation\nUtah Valley University (UVU) - City , State\nGPA: GPA: 3.67/4.0 Aviation Science GPA: 3.67/4.0 Aviation Professional Pilot Program Â· Course Works of 120 Units plus General Ed.:Air\nTransportation ManagementAviation LawCrew Resource Management/Human FactorsSafety and Professional SeminarsIntroduction to Aviation\nSecurityAviation Insurance/Risk ManagementCorporate Aviation ManagementAirport ManagementGround Training:Private, Instrument,\nCommercial, Ground InstructorFlight Training:Private, Instrument, Commercial, Flight InstructorTheory of Instruction\n4 2008\nCertified InstructorAir Traffic Control : General Education\nColumbia College - State\nGPA: GPA: 3.52/4.0 General Education GPA: 3.52/4.0\n12 1982\nGeneral Education\nAmerican River College - City , State\nGPA: GPA: 3.2 /4.0GP General Education GPA: 3.2 /4.0GP\nAccomplishments\nPrivate Pilot Certificate Instrument Certificate Single Engine Commercial Rating Twin Commercial Rating Ground Instructor Rating 20\nHours Sim Time for King Air B200.\nTrain at Mather Air field with Sim Check.\nWelding Certificates.\n6010.\n7018.\n202.\n211 Nickel High production flux core.\n232."
  }
}