{
  "file_name": "20400279.pdf",
  "sections": {
    "general": "CUSTOMER SERVICE ADVOCATE\nProfessional Summary\nTalented Customer Service manager skilled at balancing customer needs and company demands. Effectively builds loyalty and long-term\nrelationships with customers while achieving all individual sales goals. A sales manager skilled in exceeding sales goals and company expectations\nby expanding client base and maintaining high standards of customer service.Energetic and reliable Retail Sales manager skilled in high-end\nmerchandise environments.\nCore Qualifications\nStrong\norganizational",
    "skills": "Computer literate, telephone skills, creative problem solving, resolving cash receipt discrepancies. Strong communication skills, careful and active\nlistener, customer satisfaction training, excellent customer service skills with monthly training and development on coaching to achieve higher levels\nof sales. Detail-oriented, merchandising seminars in fashion, inventory. MS Office proficient, Microsoft word, Microsoft outlook, Writing letters\nand memos. Personnel training on policies and processes, Time management involving scheduling and payroll . Professional and friendly.",
    "experience": "Customer Service Advocate\nMarch 2015 to Current Company Name - City , State\nCollected customer feedback and made process changes to exceed customer satisfaction goals.Addressed customer service inquiries in a timely\nand accurate fashion.Provided accurate and appropriate information in response to customer inquiries.\nSales Manager\nOctober 1995 to February 2014 Company Name - City , State\nDelivered excellent customer service by greeting and assisting each customer.Addressed customer inquiries and resolved complaints.Design\nand implemented customer satisfaction metrics.Completed weekly schedules according to payroll policies.Trained all new managers on\nstore procedures and policies.Trained staff to deliver outstanding customer service.Contributed to merchandising ideas at team sale\nmeetings.Reorganized the sales floor to meet company demands.Stocked and restocked inventory when shipments were received.Received\nand processed cash and credit payments for in-store purchases.Opened and closed the store, including counting cash, opening and closing\ncash registers and creating staff assignments.Worked as a team member to provide the highest level of service to customers.Maintained\nfriendly and professional customer interactions.Verified that all merchandising standards were maintained on a daily basis.Demonstrated that\ncustomers come first by serving them with a sense of urgency.Shared product knowledge with customers while making personal\nrecommendations.Recommended and helped customers select merchandise based on their needs.\nResolved customer complaints by exchanging merchandise, refunding money and adjusting bills.\nServed as liaison between customers, store personnel and various store departments.Informed customers about sales and promotions in a\nfriendly and engaging manner.Trained new employees on company customer service policies and service level standards.Managed wide\nvariety of customer service and administrative tasks to resolve customer issues quickly and efficiently.\nHired and trained all sales staff for new store location.\nTrained in negotiations and time management.\nDetermined staff promotions and demotions and terminated employees when necessary.\nAddressed and corrected sales staff communication issues in a tactful and effective manner.\nDirected and supervised employees engaged in sales, inventory taking and reconciling cash receipts.\nWorked closely with the district manager to formulate and build the store brand.\nHelped determine movement/placement of incoming merchandise.\nDesigned displays to make the store experience interactive and engaging.\nDisplayed the appropriate signage for products and sales promotions.\nArranged items in favorable positions and areas of the store for optimal sales.\nEstablished and maintained proper high traffic displays, resulting in increased sales.\nConducted staff meetings with sales personnel to introduce new merchandise.\nResearched current and past business performance using on-line systems and available reports.\nEffectively communicated and coordinated execution of the plano-gram with store management.\nSales Manager\nOctober 1989 to July 1995 Company Name - City , State\nManaged a $30,000 monthly sales portfolio.Served as liaison between customers, store personnel and various store departments.\nAnswered customers' questions and addressed problems and complaints in person and via phone.\nExercises sound judgment in issuing credits and making exceptions to customer policies to maintain high levels of customer satisfaction.\nMaintained friendly and professional customer interactions.\nTrained new employees on company customer service policies and service level standards.\nManaged sales staff of 6 members.\nDelivered excellent customer service by greeting and assisting each customer.\nContributed to merchandising ideas at team sale meetings.\nDirected and supervised employees engaged in sales, inventory-taking and reconciling cash receipts.\nDetermined staff promotions and demotions, and terminated employees when necessary.\nDesigned displays to make the store experience interactive and engaging.\nDisplayed the appropriate signage for products and sales promotions.\nEffectively communicated and coordinated execution of the plano-gram with store management.\nData Entry operator\nSeptember 1985 to June 1989 Company Name - City , State\nVerified and logged in deadlines for responding to daily inquiries.Assisted with payroll preparation and entered data into.\ncumulative payroll document.Verified that information in the computer system was up-to-date and accurate.\nPromoted.\npositive customer and associate relations through courtesy, service and professional appearance.\nLoan Servicing Representative\nAugust 1984 to August 1985 Company Name - City , State\nCollected customer feedback and made process changes to exceed customer satisfaction goals.Provided accurate and appropriate\ninformation in response to customer inquiries.Provided accurate and appropriate information in response to customer inquiries.Addressed\ncustomer service inquiries in a timely and accurate fashion.Assisted with the development of the call center's operations, quality and training\nprocesses.Led a team of customer service representatives to increase service center profitability.\nAccomplishments\nAwarded annual merit increases during the first 15 years of employment.\nConsistently exceeded daily sales targets with an average of 5000+ in sales each day.\nManaged a successful sales team of 20 members who consistently exceeded sales goals by 80% each month.\nSuccessfully managed $1.4 million in merchandise per day.\nFulfilled all supervisory duties when Store Manager was on vacation.\nInterviewed applicants and successfully staffed any vacancies throughout store, focusing primarily on assigned areas.\nRoutinely helped as many as 20 customers each day in a high-volume retail outlet.\nPromoted to Call Center lead within 6 months of employment.",
    "education": "High School Diploma : General-Business Communications , 1983 William Penn Vo-tech Harrisburg - State , USA General-Business\nCommunications\nMorgan State University - City , State , USA"
  }
}