{
  "file_name": "20427934.pdf",
  "sections": {
    "general": "DIRECTOR OF BUSINESS DEVELOPMENT\nHighlights\nWord, Excel, PowerPoint, Adobe, Java, Oracle JD Edwards Enterprise, Epitome/WinAl, Data Collection, Internet, and Social Media.",
    "experience": "July 2012 Company Name ï¼​ State\noptimize financial operations by performing complex analyses on enterprise wide negotiations, projections, time-of-business reviews, and\nguest port services distribution channels, claims/utilization costs.\nDetermining the effectiveness of territory by analyzing and targeting special segment of sales reports.\nProvided data from multiple sources for monthly, quarterly, annual, and ad hoc reports generated for various departments and senior\nmanagement; ensured data was accurate by identifying and resolving errors and discrepancies.\nReviewed, analyzed, and resolved claims (based on performance, $50,000 limit ofauthority quickly eliminated by supervisor); processed\nthousands claims worth in excess of $20 million.\nInitiated, calculated and reported upon a quarterly productivity analysis.\nParticipated daily in tasks related to financial reporting, budgeting and forecasting, asset and liability reconciliation, working capital, and cash\ncontrol.\nDirector of Business Development\nMay 2014 to Current Company Name ï¼​ City , State\nWork along side with the management team in an advisory capacity to investigate the needs and propose routes for the business to achieve\nits goals.\nImplement agreed actions & achieve specific business objectives (managing a test marketing program or a promotional campaign, or\nintroducing new system), then managing hand-over and support if needed to sustain progress.\nI coordinate and lead the sales pursuit process.\nI developed the new business from new customers, and expand existing client relationship.\nManaged the sales strategies/plans to keep it consistent with the company's long range strategic objectives.\nMaintence Operations study in a high-tech industry, releasing 20-30% capacity.\nCustomer Experience transformation, leading the diagnostic and design phases.\nFundraisor Director\nSeptember 2012 to March 2014 Company Name ï¼​ City , State\nProviding collaborative leadership and coordinates submission of interdisciplinary proposals to support capital and needs to advances the\nneeds interests by researching and identifying sources of support or revenue generation.\nUsing proactive skills and extensive network by seeking new and expanded opportunities to generate new proposals based on mission and\ngoal statement of organizations' guidelines and interest.\nAdvise and assist the Executive Director in devising and implementing fundraising strategies for specific projects and review them on a\nregular basis.\nTake the lead in developing new fundraising sources.\nWork closely with the Executive Director to increase profile and enhance our reputation within the donor community.\nMay 2001 to January 2012 Company Name\nBolletieri Tennis Academy, Bradenton - provided coaching to promising junior players at one of the top tennis academies in the world\n(2001).\nFlamingo Park, Miami Beach - instructor at busy tennis facility; taught all levels ofplayers; developed loyal and steady clientele (both locals\nand returning visitors); ran tennis camps (2002 -2004).\nMiami Shores Country Club, Miami - Director, summer tennis camp for kids (10-18); responsible for program development; scheduling\nhead pros; logistics; liaison with accounting regarding pro compensation (2004).\nPrivate Coach to USTA - top ranked junior Cassandra Herzberg; coaching on physical, strategic, motivational and technique development\nled to rise in national ranking from: 200 to Top 3 (2004-2008).\nNegotiated contracts with major sports brands including Nike, Wilson, and Luxilon; coordinated tournament scheduling and travel logistics.\nPlayed a key role in the recruitment of Cassandra to Brown University where she hold first position in the roster for all four semesters.",
    "education": "Associate of Arts : May 2011 MIAMI DADE COLLEGE ï¼​ City , State GPA: Graduated with the Highest Praise, Summa Cum Laude GPA:\n4.0 Graduated with the Highest Praise, Summa Cum Laude GPA: 4.0\nJanuary 2001 ZAGREB SCHOOL OF ECONOMICS & MANAGEMENT GPA: GPA: 4.0 GPA: 4.0\nCFA (CHARTERED FINANCIAL ANALYST, level 1 : December 2013 FLORIDA INTERNATIONAL UNIVERSITY ï¼​ City , State\nBachelor of Science : Hospitality and Tourism Menagment Finance , December 2012 GPA: Graduated with the Highest Praise, Summa Cum\nLaude GPA: 3.9 Hospitality and Tourism Menagment Finance Graduated with the Highest Praise, Summa Cum Laude GPA: 3.9\nWork History\nCompany Name",
    "languages": "Multilingual, fluent in English, Croatian, and Cyrillic.",
    "skills": "accounting, Adobe, ad, budgeting, Coach, coaching, contracts, clientele, client, Data Collection, fluent in English, senior management, financial,\nFINANCIAL ANALYST, financial reporting, forecasting, fundraising, instructor, Java, JD Edwards, leadership, logistics, Director, managing,\nmarketing, Excel, PowerPoint, Word, negotiations, Enterprise, network, Oracle, program development, progress, proposals, recruitment,\nresearching, sales, scheduling, strategic, supervisor\nAdditional Information\nHold United States Permanent Resident status (previously held Extraordinary Ability 01 Visa)."
  }
}