{
  "file_name": "20490741.pdf",
  "sections": {
    "general": "SOCIAL MEDIA ANALYST\nProfessional Summary\nPositive and upbeat Customer Service Specialist bringing 15 years of customer-facing experience in fast-paced settings. Highly adaptable to\naddressing diverse customer needs. Proven history of building trust with customers to promote satisfaction, resolve concerns and maintain long-\nterm loyalty.",
    "skills": "Social media platforms\nComplaint resolution\nCreative problem solving\nMedical terminology knowledge\nAccount management\nComputer proficient\nGood listening skills\nCustomer relationship management\nSales proficiency\nKnowledge of credit disputes\nCareer planning\nClosing techniques\nSpanish translation\nInterviewing\nUp-selling\nRecord keeping and reporting\nWork History\nSocial Media Analyst , 10/2018 to Current\nCompany Name – City , State\n• Assist our community and help resolve inquiries accurately with empathy and on time •Investigate and resolve issues that are reported on\n• Assist our community and help resolve inquiries accurately with empathy and on time •Investigate and resolve issues that are reported on\nsocial media such.\n•Identify inefficiencies in workflow's and suggest solutions\n• Recognize trends and patterns, and escalate issues outside the companies policy\n• Review the reported content within agreed turnaround times and standards of quality\n• Top 10% for Quarter 1&2\n•High Accuracy\n• Display a strong bias to doing what's right for our community in support of leading social media objectives\n• Gather, analyze and utilize relevant data to develop ways to improve the overall user experience\nSr. Career Services Advisor , 02/2016 to 06/2018\nCompany Name – City , State\n• Assists students and graduates in securing employment in their field of training.\n• Build effective relationships with local and regional corporations, non-profit and government organizations and community partners to identify\nemployment opportunities and to promote the school's qualified students, graduates and alumni.\n• Provides career coaching, including interviewing techniques and other job search skills training to students and alumni.\n• Top 10% in the department.\n• Team collaborations and meetings to identify areas of opportunity in making sure graduate is successful after finding work in their field of study\n• Completes telephone interviews and e-mail correspondence to prospective employers to determine their employment needs.\n• Puts in tasks through system (ZOHO) to provide graduates with resources (Uber, interview attire, academic coaching etc.).\nCustomer Relations Controller , 04/2015 to 02/2016\nCompany Name – City , State\n• Responsible for all disputes that come from credit card companies, airlines and consolidator's\n• Recovered 2,000$ to 10,000 dollars monthly from previous and current dispute cases\n• Investigated reason for dispute. Reached out to clients to attain more information on their disputes\n• Built dispute packets with all information of customer's reservation made on Webjet.com and prepared paper work explaining all the\ninformation I've complied to fight dispute\n• Reviewed numerous amounts of reservations that were made on our site the night before just to make sure that the ticket/s being issued to\ncustomer were not fraudulent\n• Looked closely for IP address, billing address, area code, name, credit card information, departure city and destination along with when\ntickets were purchased. Investigated heavily that reservations beingmade were real reservations. I utilized social media to determine if the client has\nbeen to any of the cities or countries listed on the reservation to help solve the dispute\n• Worked in World Span to review reservations ticketed and Amadeus (Airline programs)\n• Received emails everyday by customers that book on our site. I was in charge of creating a separate cue that I worked out of to respond to\nclient inquiries\n• Handled all escalated calls when client requested a supervisor\n• Created arbitration letters for court when it's been proven that the money is owed to us\n• Reached out to airline to ask for waiver to regain any money back before submitting dispute to Credit Card Company\nIS Escalations Supervisor , 12/2014 to 02/2015\nCompany Name – City , State\n• Explained status of dispute (case) as well as provide information we need to continue dispute process.\n• Checked with Visa when cases got to pre-arbitration\n• Closed out cases\n• Sent letters and faxes pertaining to dispute cases.\n• Researched cases older than 120 days.\n• Wrote off amounts after review and consideration.\n• Followed up with customers who request supervisor phone call.\nDisputes Coordinator , 06/2013 to 12/2014\nCompany Name – City , State\n• Assisted customers with any account related questions.\n• 3-way conferencing merchants to help resolve before going into a dispute.\n• Researched into different situations for customers and category their disputes in a program called \"Chordiant\"\n• Followed Up with customers to make sure previous situation has been taken care of, one call resolution\n• Reviewed documentation that needs to be submitted to build a stronger case on their dispute, set proper\n• Researched information on merchants to get subscriptions canceled for customers.\n• Worked with my supervisor and go over strategies that help engage associates with the work they do on a daily.\n• Attended “WOW\" call sessions where I assist with determining which agents have performed above and beyond.\n• Implemented tips to assist with lowering average handle time.\n• Received award “ROAR\" for being top 5% of the department.\n• Participated in focus groups and brain storm on what needs to be improved and what should continue.\n• Assisted with process improvement, help change different functions agents do daily by reviewing the information already provided to us the\nsimplify it to make the customer experience smooth.\nCustomer Service Representative , 07/2012 to 06/2013\nCompany Name – City , State\nAnswered constant flow of customer calls\nResponded to customer requests for products, services and company information\nConsulted with outside parties to resolve discrepancies and create effective solutions\nMaintained customer happiness with forward-thinking strategies focused on addressing customer needs and resolving concerns\nProvided primary customer support to internal and external customers in fast-paced environment\nCompiled customer feedback and recommended service delivery improvements to management",
    "education": "High School Diploma Sickles High School - City , State"
  }
}