{
  "file_name": "20691949.pdf",
  "sections": {
    "general": "A LA CARTE CHEF/ CHEF DE CUISINE",
    "summary": "A professional cook with 10+ years of combined on the job work training and experience, with a background in managerial and non-managerial\npositions from high quality restaurants and organizations, with a firm foundation built on the respect and execution of proper cooking techniques,\nand the importance of always being able to learn and grow as a professional.\nHighlights\nFocused and disciplined Sous vide technique\nHigh volume production capability Effective Communicator\nFocus on portion and cost control Organizational Skils\nInventory management familiarity Task Oriented",
    "experience": "Company Name City , State A La Carte Chef/ Chef De Cuisine 10/2015 to Current\nSupervise 10 cooks across two kitchens\nEncourage and Motivate Staff Members to uphold quality standards in keeping with club traditions and expectations\nPlanning and Preparation of three seasonal menus\nCreating nightly specials revolving around seasonality using as many local ingredients as possible\nContemporary and trendy cuisine, with respect to traditions and favourites of the club and its members\nEffectively expedites a la carte serviceÂ\nManagement of protein, perishable, and dry goods inventory with a focus on utilisation and cost effectiveness\n100- 200 Covers NightlyÂ\nCompany Name City , State Sous Chef 04/2015 to Current\nEffectively Managing a kitchen team of 12 cooks and stewards over two kitchens on property\nTasked with the preparation and execution of special event menus\nPlanning and executing a daily changing dinner menu\nStrong focus on locality of ingredients\nResponsible for an extensive running inventory of fresh proteins\nTraining new cooks and team members to understand quality standards and proper cooking techniques.\n75-175 covers nightly\nCompany Name City , State Lead Expeditor 02/2014 to 02/2015\nThe Masters Golf Tournament\nTerrace Kitchen\nHigh Pressure Environment\nTime Management\nStress Management\nEffective Planning and Organisational Skills.\n800-1100 covers in 3 hours\nCompany Name 12/2009 to 05/2014\nMerion Cricket Club, Haverford, PA, Junior Sous Chef\nViking Culinary Center, Haverford, PA, Chef/Instructor\nCloud Catering and Events, NYC, NY, Cook\nThe Black Rat, Winchester, England, Stage\nCraigie on Main, Cambridge, MA, Stage\nFour Seasons Resort: Aviara, Carlsbad, CA, Intern",
    "education": "2009 Culinary Institute of America , City , State\nBachelors of Professional Studies , Culinary Arts and Restaurant Management . Assisted with numerous school-sponsored catering\nevents for up to 450 people. Member of the Inter-collegiate soccer team four years, serving as captain one year. Kitchen assistant for saturday\nmorning, 15 person Adult Education classes. Residence Assistant, 2 1/2 years",
    "skills": "Interpersonal Skills, cooking, critical thinking, dependability focused, human relations, inventory, listening skills, time and personnel management\nskills, stress management, supervision, teaching, leadership, enthusiasm, passion for cooking, problem solving"
  }
}