{
  "file_name": "21101152.pdf",
  "sections": {
    "general": "EXECUTIVE CHEF\nProfessional Summary\nI have honed my professional craft by working in New York City (most recently Gastro Arte and Oxford Kitchen Fort Greene Brooklyn),\nHoboken, Oaxaca Mexico, as well as presiding over two top rated, highly coveted award winning well known extremely high volume Knowles\nfamily restaurants and hotel in New Jersey in which my skills were perfected and completed in all aspects of running award winning restaurants.\nWith this comes a proven track record and an excellent reputation .After my time at the Highlawn, I was given the reigns of their sister restaurant\nThe Manor as the Chef D' Cuisine because of my work ethic, dedication to my staff and my craft. With the opportunity to run my own\nestablishment, I was brought on to open gastro pubs such as Sixty Park next door to the PAC Center and the Tap House Grill. I opened these\nestablishments as upscale casual and rustic comfort food with banquet and catering on site to excellent reviews and a steady following. I am also\nheavily involved as a lead chef consultant for creating successful menus and kitchen designs to open such restaurants as Halcyon and Montclair\nStation in Montclair NJ and Bistro Seven Three in Bernardsville. I stand by my food with simple and colorful plate designs with bold flavors and\nmy ability to train and inspire my staff with my progressive and lead by example philosophy. With me you will get a loyal hardworking chef with a\nlove of our industry. I take my craft seriously bringing no ego just passion, pride and ambition number. I am available to interview at your earliest\nconvenience if you believe I meet your standards.",
    "skills": "concept, DOH, hiring, inventory, Ledger, excel spreadsheets, money, personnel, problem solving, purchasing, quality, quality control, Sat,\nScheduling, Staffing, Sun, teaching, employee handbooks",
    "education": "Graduate : Passaic Valley High School - City , State\nGraduate : Institute Culinary of Education - City , State\nServe Safe Certified NYFC/ DOH Certified :"
  }
}