{
  "file_name": "21297828.pdf",
  "sections": {
    "general": "PUBLIC RELATIONS AND EVENT PLANNING ASSISTANT\nHighlights\nJournalism student with strong written and verbal communication skills. Motivated self-starter with experience in public relations writing\nand event planning.\nSummary of Qualifications\nCooperative team member\nSpecial events planning\nMulti-media marketing\nWriting and editing skills\nMicrosoft Office, Excel, PowerPoint proficiency",
    "experience": "Public Relations and Event Planning Assistant\nMay 2015 to August 2015 Company Name ï¼​ City , State\nWrote press releases and media advisories, prepared information for media kits and maintained company website and social media outlets.\nManaged special events such as tournaments, book signings and parties.\nCoordinated services for events such as entertainment, signage, printing, event security and secured vendors and sponsorships.\nVice President\nNovember 2014 to Current Company Name ï¼​ City , State\nManage all social media outlets including Twitter, Instagram and Facebook.\nCreate events for professional development within a team of six journalism students.\nDevelop strategies for acquiring and maintaining membership.\nCoordinator of Internal Marketing\nDecember 2013 to September 2014 City , State\nManaged inbound marketing campaigns to increase brand awareness and generate new business.\nPlanned and negotiated media buys, including TV, print and digital.\nContributed to the planning and execution of an event with more than 8,000 attendees.",
    "education": "Bachelor of Arts : Journalism Public Relations , August 2012 INDIANA UNIVERSITY-PURDUE UNIVERSITY INDIANAPOLIS ï¼​ City ,\nState Journalism Public Relations\nCertificate in Event Management",
    "skills": "book, editing skills, event planning, Event Management, Special events, Journalism, marketing, Excel, Microsoft Office, PowerPoint, Multi-media,\npress releases, public relations, self-starter, TV, verbal communication skills, website, written"
  }
}