{
  "file_name": "21531811.pdf",
  "sections": {
    "general": "PRESCHOOL TEACHER",
    "summary": "Enthusiastic Preschool Teacher talented at teaching visual art, music and theater. Engages children with diverse and enjoyable activities involving\ntheatrical play, musical instruments and hands-on learning.Â",
    "experience": "August 2015\nto\nCurrent\nCompany Name City , State Preschool Teacher\nProvide a variety of materials and resources for children to explore, manipulate and use, both in learning activities and in imaginative play.\nAttend to children's basic needs by feeding them, dressing them, and changing their diapers.\nTeach basic skills such as color, shape, number and letter recognition, personal hygiene, and social skills.\nEstablish and enforce rules for behavior, and procedures for maintaining order.\nRead books to entire classes or to small groups.\nOrganize and lead activities designed to promote physical, mental and social development, such as games, arts and crafts, music,\nstorytelling, and field trips.\nSeptember 2014\nto\nAugust 2015\nCompany Name City , State Opening Coordinator\nMake daily decisions to ensure product quality, store cleanliness, and other Company standards are met.\nUnderstand cost control procedures, financial accounting, inventory levels, and labor management.\nMonitor shift profitability.\nKnow, understand, and execute proper cash handling and safe procedures.\nSet up shift board and personnel positioning.\nResponsible for receiving deliveries and following all security procedures.\nEnsure birthday parties are set up and that appropriate personnel are scheduled and assigned to assist the party; evaluate birthday surveys\n& results.\nSupervise Cast Members.\nFebruary 2014\nto\nNovember 2014\nCompany Name City , State Site Aide\nResponsible for assisting the Site Supervisor and/or Assistant Site Supervisor in.\nplanning, preparing, implementing, and supervising activities for the children.",
    "education": "2013\nMiddletown High School City , State High School Diploma\nBrookdale Community College City , State Associate of Arts : Early Childhood Education Early Childhood Education",
    "skills": "cash handling, cost control, critical thinking, financial accounting, inventory levels, lesson planning, personnel, positioning, quality, receiving,\nsupervising, surveys, teaching, tutoring"
  }
}