{
  "file_name": "21567392.pdf",
  "sections": {
    "general": "PROJECT CONSTRUCTION MANAGER\nProfessional Summary\nMotivated Construction Manager highly effective at finding the best methods possible to complete exceptional construction projects. Strong\nknowledge of civil engineering principles and concepts. Construction Manager with [Number] years leading teams of general contractors and\nlaborers on large scale residential and commercial construction projects.",
    "skills": "Bridges, c, Client, Clients, directing, Engineer, Works, Natural Gas, Oil, painting, Project Management, project planning, Quality, QA, Reporting,\nRisk Assessment, safety, Shell, specification, technical support\nAdditional Information\nPersonal Information Nationality: Jordan Date of Birth: 06 June, 1968 Marital Status: Married Number of Dependents: 3",
    "education": "Bachelor of Arts : Petroleum Engineering 1993 University of Miskolc - City\n4 GPA\nBuilding Construction Trades Certificate\nIndustrial Design Coursework\nAccomplishments\nONGC B-22 Field Development Project (ONGC- India) OGD-III Upstream Project at Bab (ADCO) Al Shaheen Field Development\nProject (Maersk Oil Qatar) OGD-III Condensate Storage Tanks Project at Ruwais (TAKREER) Refurbishment of Storage Tank TJA7,\nTJA18 and Miscellaneous Works at Jebel Dhanna Terminal (ADCO) North East Bab Phase-1 Development Project (ADCO) Major\nOverhaul of COS Tank 21 at Das Island (ADMA-OPCO) Major Overhaul of COS Tanks 7 & 11 at Das Island (ADMA-OPCO) New\nSingle Point Mooring Loading Facilities (TB-6) at DAS ISLAND (ADMA-OPCO) Marjan Topsides Platforms, Jackets and Living\nQuarters (Saudi ARAMCO) Fabrication of 4 wellheads in ISDN field with all associated sub-sea pipelines & multi service umbilical (OXY-\nQatar) Zakum Crestal Gas Injection Project (ADMA-OPCO) Al Khalij Northern Area Field Development Project.\nTOTAL) BH-09 WHJ Topsides, Pipelines, Spurlines and Tie-ins (QP ) US-94 WHT Reinstatement Project (ADMA-OPCO) Soroosh &\nNowrooz Integrated Development Project (SHELL) Offshore Khuff Gas Development Project (ADMA-OPCO) Replacement of\nDamaged Boat landing (ADMA-OPCO) New Additional Manifolds at ASAB & BUHASA (ADCO) May'93-Jan'02: Project\nConstruction Engineer Consolidated Contractors INT'L Company ( CCIC ) Projects executed were for Abu Dhabi Company for Oil\nOperations (ADCO), Abu Dhabi Gas Industries Limited (GASCO), Abu Dhabi Oil Refining Company (TAKREER), Abu Dhabi Gas\nCompany (Atheer) and Qatar Petroleum (QP).\nResponsibilities: Coordinating and directing all site activities as per agreed schedule and for efficient cost effective management of all\nresources deployed.\nEnforce safety rules as per the approved HSE procedures.\nEnsuring that Quality aspects of the Projects are fulfilled properly.\nCoordinating with Client representatives on all Project related aspects.\nOverseeing piping / steel structure fabrication and erection activities Projects executed: Onshore Gas Development Project Phase II (UAE)\nRasLaffan Onshore LNG Project (Qatar) Qatar Gas Onshore LNG Project (Qatar) Upgrading of Khatiya North And South Degassing\nStation (Qatar) Training Courses attended Professional Project Management Program-PMP, 25 October to 16 November'2009,\n(Cambridge Educational Institute -Abu Dhabi.\nAffiliations\nMember of the Jordanian Engineering Association (1995)"
  }
}