{
  "file_name": "21629057.pdf",
  "sections": {
    "general": "ENGINEERING TECHNICIAN/ FIELD SERVICE\nProfessional Summary\nResults-driven and focused Engineering Technician who prioritizes safety, cost-effective solutions and exceeding customer expectations. With my\nbackground in both Field Service and as an Engineering Technician. I was able to effectively reduce test and production time through gaining a true\nunderstanding for the process without sacrificing quality.\nLong term goals , become an intuitive I/E Technician in the pulp and paper industry, teach others with the potential to take on a leadership role\nwithin my first 5 years",
    "skills": "assembly, broadcast, calibration, concept, drafting, engineer, Radar, modeling, Naval, Network, Oscilloscopes, quality, record keeping, Research,\nsales, FM, SPS, Test Equipment, UHF, Wiring\nAdditional Information\nAdditional Information\nSkilled at electronics and repair, also skilled at working with customers, I am a very people oriented person. I try to be certain the\ncustomer's needs are met to the highest standards. Professional attitude and open mind to learning new concepts and ideas as well as new\nproducts. Control wiring and protection circuitry, Customer service skills. Served as an interface between engineering and production\ndepartments. Other basic skills: wiring, drilling and tapping, soldering, layout and installation of new equipment, wiring of motor controls. I\nam able to think on my feet, under pressure and deadlines, while keeping multiple projects going. The ability to follow thru and work under\npressure has given me the ability to meet emergent needs. Handling critical situations has always been my specialty. The ability to learn and\nabsorb new information has been continually proven through past work experience and current education. Proven leader. Keeping up with\ncurrent standards and methods thru on going school and keeping up with industry thru current publications. Just finished Geometry and\nTrigonometry as well as collage English. I am currently enrolled and nearly finished with Process measurement, Industrial controls along with\nIndustrial robotics and Electronic devices (amplifier circuitry). I am willing to relocate as needed. The Veteran's Administration is backing\nboth my education and return to the workforce. I can and will be a great asset to any company you may place me with. Long term goals,\nteach and manage others and to find my place within industry.",
    "education": "Associate of Applied Science : Current\nCentral Maine Community College\nContinuing coursework in Math, History and finishing the ELT program.\nMember of National Vocational Technical Honor Society\nPhi-Theta-Kappa",
    "certifications": "State of Maine Electricians Helpers license #HPE20038535"
  }
}