{
  "file_name": "21856577.pdf",
  "sections": {
    "general": "BRANCH BANKER III\nAccomplishments\nMaximize sales volume.\nMaintain visual presentation standards that are consistent with division philosophy and direction.\nDemonstrate effective written and verbal communication skills.\nAssist in recruiting, training and developing Sales Associates.\nDevelop proficiency in all operational policies and procedures.\nManage time and prioritize tasks.\nCUSTOMER SERVICE / SALES Ensure customer service is the #1 priority.\nEffectively supervise the sales floor to ensure customer / associate awareness at all times.\nUnderstand and create awareness of the factors to impact sales volume.\nLEADERSHIP Motivate and develop associates to meet goals / objectives.\nClearly delegate activities and follow-up on all direction.\nDemonstrate teamwork with-in store and company.\nTake initiative and use sound judgement.\nLead by example.\nPERSONNEL Demonstrate professional image and conduct.\nFollow specific divisional dress code policy.\nEnsure that store staff is treated professionally, courteously and respectfully.\nInvolve store staff in accomplishing store goals.\nTake an active role in own development.\nCommunicate staff concerns to management.\nSupport all company / management decisions.\nOPERATIONS Execute and follow-up on all operational policies, procedures and directives.\nExecute and follow-up Inventory Shrinkage Improvement Program.\nEnsure accuracy in all paperwork.\nVISUAL PRESENTATION Maintain store appearance to reflect division standard.\nReplenish merchandise on a timely basis.\nHave knowledge of the store merchandise.\nHave knowledge of sales floor and stockroom organization.\nKeep management informed of all merchandise-related issues.\nExecutes markdowns and re-merchandise as needed.\nPOS set-up is timely and effective.\nExecutes and maintains divisional marketing directives.\nInterpret and execute floor plans and guidelines.\nProfessional Summary\nMy objective is to continue to move up within BB&T. I have been a Relationship Banker with BB&T since January 2006. I was promoted from\nRelationship Banker I to a Relationship Banker II in January 2012. My long term goal is to work my way into our training department and helping\nnew hires learn about BB&T. I am very passionate about BB&T and love working here.",
    "skills": "banking, basic, c, charts, credit, client, clients, customer service, filing, Financial, insurance, investments, meetings, mail, office, Policies, problem\nresolution, processes, quality, maintain files, recording, recruiting, relationship management, retail, risk management, Sales, staffing, Store\nManagement, Supervisor, telephone, phone, type",
    "education": "August 1999\nHigh School Diploma :\nEastgate Christian Academy - City"
  }
}