{
  "file_name": "22423839.pdf",
  "sections": {
    "general": "INTERNATIONAL BUSINESS DEVELOPMENT MANAGER",
    "summary": "Charismatic business professional with expertise in business development , product strategy, marketing, and sales . Effectively built sales\ndepartment from 10% to 50% of total company revenue over a 10 year term. Vastly experienced in international distribution development.\nHighlights\nBusiness Development Marketing\nInventory Management Product Strategy\nSales Analysis & Forecasting Bilingual - English/Spanish",
    "experience": "02/2010 to Current\nInternational Business Development Manager Company Name ï¼​ City , State\nIdentify global product opportunities, perform market analysis, and create product briefs outlining new collections.\nLead cross-departmental team responsible for creating product launch process calendar to ensure timely execution and clear\ncommunication.\nManage special project requests to identify the value of the project, potential growth in the market, and work with Product Development,\nMarketing and Sales to execute.\nDevelop pricing strategy and manage pricing model to boost brand profitability.\nAnalyze sales history and market trends to optimize inventory levels at overseas warehouse providing product to global partners in a timely\nmanner, resulting in lower overhead and storage costs.\nProduce and communicate quarterly key performance indicators (KPI) reports.\nLiaise with Product Development, Marketing departments and Regional Directors to develop new product for global consumers.\nDevelop, maintain, and support 37 international sales and distribution accounts in 76 countries for Victorinox Swiss Army brands.\nAnalyze sales statistics to determine business growth potential and drove incremental growth of $2M in 2014.\nAssist global partners with inventory management, product training and retail promotions, resulting in higher product margins for all parties.\nOffer a proven track record of revenue growth year over year, from $8M to $34M during my 10-year term.\nGrew Latin Market from ground zero to top region for 3 consecutive years.\n01/2004 to 01/2010\nInternational Sales Operations Manager\nSupported VP and Director to manage international brands and support global network of distributors.\nCoordinated directly with factories, third-party logistics warehouse operator, and distributors to optimize order flow from factories to\nwarehouse to global markets.\nCreated and updated order templates and price lists for accounts.\nManaged inventory to maintain optimal levels.\nWorked with distributors to obtain quarterly and monthly forecasts.\n01/2000 to 01/2004\nCompany Name ï¼​ City , State\nOversaw daily operations for international department.\nMaintained the sales of product overseas with key accounts.\nFulfilled 5-8 international customer orders and quotations weekly.\n01/1999 to 01/2000\nAir and Ocean Export Coordinator Company Name ï¼​ City , State\nExported high value goods and hazardous materials to foreign countries.\nCompleted International banking documentations - Sight Drafts and Letter of Credits - to ensure payment as needed.\nTranslated documents and correspondence in conversational translation for internal staff and clients.",
    "education": "1999\nBS degree : Business Administration, International Business Southern Illinois University of Edwardsville Business Administration, International\nBusiness Studied Abroad - Costa Rica",
    "skills": "Army, banking, business development, clients, international sales, inventory management, inventory levels, inventory, Latin, logistics, Director,\nmarket analysis, market trends, marketing, Market, Marketing and Sales, materials, network, pricing, pricing strategy, Product Development,\nretail, sales, Sales Analysis & Forecasting, statistics, strategy, translation"
  }
}