{
  "file_name": "22506245.pdf",
  "sections": {
    "general": "PRE-PRESS GRAPHIC DESIGNER",
    "summary": "Creative, hardworking designer seeking a full-time desktop job, educated as a graphic artist, past experience in business world as a desktop\npublisher laying out designs for printed mail and advertisements, in local government designing new websites with graphics for different agencies\nwithin the system, and later for the same government printing and reproduction center creating documents to be printed off a press or copiers.",
    "skills": "administrative functions, Acrobat, Adobe Dreamweaver, Photoshop, Advertising, backup, Basic, business cards, conversion, excellent customer\nservice, direct mail, email, fax, graphic design, graphics, HTML, Illustrator, Adobe InDesign, Mac, Macintosh computers, Marketing\nCommunications, Excel, mail, office, PowerPoint, Publisher, Microsoft Word, monitors, network, newsletters, takes notes, PDF, copiers, posters,\nprinter, printers, proofing, quality, QuarkXPress, supply inventory, team player, phone, UNIX, web development, web pages",
    "experience": "01/2008 to Current\nPre-Press Graphic Designer Company Name ï¼​ City , State\nCreate new designs for variety of items like manuals, newsletters, and posters.\nUse templates for updated documents like envelopes, letterheads, and business cards.\nProof jobs for initial and final customer approval.\nManufactures a high-quality PDF file digitally for proofing, photocopying and offset printing.\nPerforms file backup and organizes system for easy recovery.\nMaintains and monitors supply inventory and orders items when needed.\nOperates photocopying equipment, includes sending approved documents to printer.\nAssists in the bindery department, using the folder and manual paper cutter for small jobs.\nAlso can use bindery equipment, like the fastback and GBC binding of spines.\nMounts and laminates to foam boards, manually trims to size.\nEnsures timely submission of files to production.\n04/2000 to 01/2008\nWeb Designer Company Name ï¼​ City , State\nCreated new sites and made updates to current sites; created graphics to use on web pages; scanned documents and converted digital files\nfor links on sites; maintained updates and corrections on sites; answered email and phone call requests from departments about site changes;\nproofed pages with emails before sending live to internet.\n06/1998 to 02/2000\nDesktop Publisher Company Name ï¼​ City , State\nPerformed set-up and conversion of documents from Mac to PC then to UNIX systems; used QuarkXPress on Mac for the set-up of many\njobs; sent to network to be used by programmers for \"targeted\" direct mail printouts; trained new team staff members; helped with clean-up\nwhen company shut down.\n06/1997 to 03/2000\nGraphic Designer Company Name ï¼​ City , State\nTemporary office jobs using Macintosh computers to design files to be printed for various companies like:.\nAlltel Publishing.\nCleveland School District.\nHKM Marketing Communications.\nNationwide Advertising.\nEducation and Training\nMay 1997\nBachelor of Fine Arts Alfred University ï¼​ City , State\nWork History\nCompany Name"
  }
}