{
  "file_name": "22848179.pdf",
  "sections": {
    "general": "DIRECTOR OF COMMUNITY",
    "skills": "administrative support, Adobe Creative Suite, Event planning and management, fundraising, graphic design, inventory management, mailing,\nmarketing strategy, Painting, promotional materials, retail sales, scheduling",
    "experience": "Director of Community\nAugust 2017 to Current Company Name ï¼​ City , State\nProvide customer service and administrative services, acting as main point of contact for Community Education office.\nFacilitate operations and communications with other offices regarding IT, Finance, Security, and HR.\nUse design experience, writing, and computer skills to market events and programs.\nDesign promotional materials for print and web as needed, such as postcards, fliers, banners.\nManage social media pages and design ad campaigns, leverage analytics.\nIncreased social media activity by 30% over past two years.\nDesign and analyze email marketing campaigns.\nResearch and coordinate with marketing staff to place web and print ads.\nEvent planning and management for community engagement.\nProvide administrative support to a wide range of constituents.\nAssist students with registration, class preparations and communications while working toward enrollment goals.\nIncreased enrollment by 7% through fresh marketing strategy and improved customer service policy.\nAssist faculty with design of courses, scheduling, contracts, and facility and supply needs.\nCurate art classes and workshops for triannual course catalogs, collecting images, bios and descriptions.\nProofread and edit catalog content.\nCoordinate bulk mailing.\nManage vendor and account relations for materials and supplies, tracking and placing of orders.\nProcess tuition payments, request and track refunds.\nOversee scholarship program.\nDevelop faculty pay schedule.\nDraft, collect and archive contracts.\nAssistant Director\nNovember 2012 to August 2017 Company Name ï¼​ City , State\nAfter facilitating merge with NH Institute of Art, helped design and implement new systems to run Sharon Arts Center School of Art &\nCraft as a satellite facility for higher education.\nBuilt new processes to integrate with financial, HR, IT, and Marketing offices.\nActed as department registrar, designed classes and recruited arts faculty, curated catalog.\nPerformed marketing work to increase enrollment.\nOversee scholarship program.\nSchool Director\nSeptember 2009 to November 2012 Company Name ï¼​ City , State\nOversaw facilities and education administration operations.\nDesigned catalog of art classes and workshops, recruited arts faculty.\nDesigned fundraising events to purchase studio equipment and develop community.\nOversaw implementation of student management software.\nInitiated and oversaw student exhibitions to develop community and awareness.\nCurated content for course catalog.\nOversaw budget of $250K.\nWebmaster\nJuly 2009 to November 2012 Company Name ï¼​ City , State\nGained creative project management experience, facilitating planning and communications between design team and staff of colleagues\nduring rebranding and launch of www.sharonarts.org.\nPerformed all content uploads and ongoing maintenance, including press release blog updates, photo galleries, and donor portal.\nDesigned and implemented new online donor system and related reporting.\nAdministrator\nApril 2009 to September 2009 Company Name ï¼​ City , State\nImplemented new social media pages and email marketing software to assist Marketing office.\nAssisted Development office with fundraisers, events and focus groups, maintained sensitive donor information database and\ncommunications.\nAssisted Education office with student communications and enrollment transactions.\nAssistant Manager\nMarch 2008 to April 2009 Company Name ï¼​ City , State\nOversaw inventory management and customer service while working toward retail sales goals.\nAssisted with curatorial needs of Fine Art Gallery of rotating exhibitions, including labels, inventory, shipping and docent coverage.\nIntern/Free-Lance Production Assistant\nSeptember 2006 to January 2008 Company Name ï¼​ City , State\nStudied animation and digital art software while providing graphic design and project assistance.\nEducation and Training\nMFA : Creative Writing , 2016 New Hampshire Institute of Art Creative Writing\nBS : Communications/Graphic Design , 2007 Fitchburg State Communications/Graphic Design"
  }
}