{
  "file_name": "23004695.pdf",
  "sections": {
    "general": "ASSISTANT GENERAL/OPERATIONS MANAGER",
    "summary": "Results-focused management professional offering ten years of progressive leadership experience. Transforms high-potential staff into outstanding\nleaders who demonstrate the creativity and savvy that is critical to financial and operational success.",
    "skills": "banking, budget, interpersonal skills, client, customer satisfaction, customer service, general manager, hiring, human resource, Inventory, inventory\ncontrol, Laser, managing, marketing, payroll, policies, profit and loss, quality, recruiting, retail sales, sales, sales training, surveys",
    "experience": "01/2013 to 06/2015\nAssistant General/Operations Manager Company Name ï¼​ City , State\nManaged team of 45 of professionals.Served as mentor to junior team members.Initiated program that standardized employee training and led to\nincrease in customer satisfaction by 12%.\n07/2012 to 01/2013\nGeneral Manager Company Name ï¼​ City , State\nInformed guests of spa services, programs and activities over the phone and in person. Addressed all guest complaints and referred any\nescalated situations to management.Checked members and guests in promptly for their appointments.Efficiently checked guests in and out\nusing Millenium.Coordinated and booked all spa service appointments for individual and group clients.Assigned clients to spa therapists by\naligning the client's needs with the spa therapists expertise.Addressed all member concerns with patience.Responded to customer inquiries in\na friendly and professional manner.Verified end-of-day reports against credit and cash profits.Clearly communicated with each technician\nregarding any schedule changes.Executed all daily opening and closing procedures.Organized salon paperwork and office files.Introduced\ncorporate policies, procedures and work rules to new spa employees.\n08/2010 to 07/2012\nHead/Esthetician Company Name ï¼​ City , State\nAdvised guests on special events and product promotions.Mailed client forms and salon promotional documents.Informed guests of spa\nservices, programs and activities over the phone and in person.Addressed all guest complaints and referred any escalated situations to\nmanagement.Researched the various types of spa therapies and treatments to be better informed of spa services.Supplied guests with robes,\nslippers and locker keys.Efficiently checked guests in and out using spa biz.Instructed guests on facility safety measures.Coordinated and\nbooked all spa service appointments for individual and group clients.Assigned clients to Spa Therapist by aligning the client's needs with the\nSpa Therapist expertise.Documented any observed safety hazards and reported them to management immediately.Addressed all member\nconcerns with patience.Provided accurate product and merchandise information to customers.\n11/2007 to 10/2009\nEsthetician, Certified Laser Technician Company Name ï¼​ City , State\nInformed guests of spa services, programs and activities over the phone and in person.Addressed all guest complaints and referred any\nescalated situations to management.Researched the various types of spa therapies and treatments to be better informed of spa\nservices.Instructed guests on facility safety measures.Documented any observed safety hazards and reported them to management\nimmediately.Addressed all member concerns with patience.Provided accurate product and merchandise information to\ncustomers.Responded to customer inquiries in a friendly and professional manner.Suggested and sold spa services and retail products to\ncustomers.Advised guests on special events and product promotions.\nEducation and Training\n2006\nBachelor Marketing/Management University of Aesthetics ï¼​ City , State\nEsthtician training\n1993\nBacholrs : Marketing/Management Emporia State University ï¼​ City , State\nMarketing/ManagementCoursework in Business and ManagementCoursework in Marketing and Communications\nAssosicates Seward County Community College ï¼​ City , State\nCoursework in Marketing and CommunicationsCoursework in Business and Management"
  }
}