{
  "file_name": "23032182.pdf",
  "sections": {
    "general": "SALES ASSOCIATE\nABIGAIL FULTON\nAccomplishments\nDemonstrated strong communication skills through extensive work with a diverse population; President of academic and extracurricular\norganizations, preparing and overseeing the coordination of events, Team captain of collegiate sports, ensuring a positive environment\nAcquired over 20 new families to join the local swim lessons program.\nDemonstrated strong communication skills through extensive work with a diverse population\nÂ President of academic and extracurricular organizations, preparing and overseeing the coordination of events,\nÂ Team captain of collegiate sports, ensuring a positive environment\nAcquired over 20 new families to join the local swim lessons program.\nProfessional Summary\nEnthusiastic college student, excited to explore the marketing and social media fields, possessing expertise in personal communications and\ncultivating human relationships.\nMotivated customer service specialist with over 4 years of work experience in a fast-paced, team-based environment, including more than 10\nyears experience leading a swim and water polo teams.\nEnthusiastic college student, excited to explore the marketing and social media fields, possessing expertise in personal communications and\ncultivating human relationships.\nMotivated customer service enthusiast with over 4 years of work experience in a fast-paced, team-based environment, including more than 10\nyears experience leading a swim and water polo teams.",
    "skills": "Advertising, Business Development, Strong communication skills, dependable, Marketing, Quick learner, sales, active team player\nOutside Activities\nProficient at time management as I juggle a full academic course-load and maintain my position as an all american athlete.",
    "education": "GED : San Francisco State - City , State\nBUSINESS MARKETING Business, Communications and Organizational Psychology\nBACHELORS DEGREE : BUSINESS MARKETING Business, Communications and Organizational Psychology San Francisco State - City ,\nState\nBUSINESS MARKETING Business, Communications and Organizational Psychology\nCoursework in Marketing and Advertising, Business Development training :\n2018\nCommunications : Relationship psychology, Interpersonal communication\nAmerican River College - City , State\nCoursework in communications, contract law and environmental and geographical sciences.Â\nElected Captain of 2017 Women's water polo team\nElected Captain of 2018 Women's swim team\n2018\nCommunications : Communications\nAmerican River College - City , State\nCoursework in communications, contract law and environmental and geographical sciences.Â\nElected Captain of 2017 Women's water polo team\nElected Captain of 2018 Women's swim team"
  }
}