{
  "file_name": "23139437.pdf",
  "sections": {
    "general": "SUMMER CAMP COUNSELOR",
    "summary": "I have a Veterinarian Assistant certificate from Middlesex County college, I also have a Pet first aid certificate, I have always been interested in the\nveterinarian medicine field, I used to volunteer at my local animal shelter, I am hardworking and I would enjoy coming to work everyday, very\norganized and friendly, I have a lot of experience in dealing with people as well from my retail jobs\nHighlights\nfriendly\npet first aid certified\ncaring\nknowledge in vet nursing and pharmacology\norganized\nAccomplishments\nI completed the veterinarian assistant certificate program at Middlesex county college in Edison, New Jersey. I also completed the Pet first aid\nclass at MIddlesex county college.",
    "experience": "summer camp counselor\nJune 2012 to August 2013 Company Name ï¼​ City , State\nsummer camp counselor for kids ages 3 and 4.\nWe do different activities with the kids like arts and crafts and also activities outside.\nsales associate/cashier\nNovember 2012 to October 2015 Company Name ï¼​ City , State\nsales associate, helping customers and taking care of shipment\nusher\nJune 2014 to September 2014 Company Name ï¼​ City , State\ndirected people to their seats and scanned tickets\nSales associate/cashier\nJune 2013 to Current Company Name ï¼​ City , State\ncashier and help customers with whatever they need",
    "education": "Veterinarian assistant , 2015 Middlesex County College ï¼​ City , State , USA GPA: high school from Sayreville War Memorial High school in the\nyear 2013\ncompleted a Veterinarian Assistant certificate program in May of 2015\nIn this program I learned about Veterinarian medicine, nursing, pharmacology, and Veterinarian technology",
    "skills": "very friendly and patient especially for animals\nvery friendly toward people as well because of all my experience in retail I am very patient\nI have always been organized and very hardworking"
  }
}