{
  "file_name": "23573064.pdf",
  "sections": {
    "general": "PROGRAMME FINANCE ASSOCIATE\nProfessional Summary\nSeeking a position where I can demonstrate my skills and contribute to an organization that offers professional growth. Being productive and add\nvalue to the organisation through my knowledge and previous experiences Overview Certified project manager with two years experience in\nmanaging projects according to PRINCE2 methodology. Civil engineering background. Two years experience in events organization (workshops,\nconferences and awareness campaigns). Highly motivated in team and individual tasks, hard working and productive worker under pressure.\nPractical experience of dealing with governmental and official entities. Outstanding communication skills with fluency in three languages. Good\nknowledge of international and development practices. Management and administrative professional. People oriented with strong leadership\nabilities. Excellent negotiation skills.",
    "skills": "accounting, administrative support, Arabic, Basic, BSc, budgeting, budgets, budget, consultation, client, Delivery, documentation, English, Finance,\nFinancial, grants, interpretation, Italian, Languages, Director,MS Office, office, outlook, Enterprise, networks, Office management, policies,\nPRINCE2, processes, progress, project management, proposals, quality control, recording, recruitment, reporting, research, Risk Management,\nSound, supervision, Teaching, translating, translation\nAdditional Information\nDate of Birth: 5 November 1978 Marital status: Married Nationality: Libyan",
    "education": "12 2008\nBSc. Civil Engineering, Al-Fateh University, Tripoli - Libya (1997 - 2001) & University of Tripoli, Tripoli - Libya (2005 - 2006) Projects In\nControlled Environments (PRINCE2) Foundation, UNDP training, Tripoli - December 2009 Enterprise Risk Management, UNDP training, Tripoli\n- January 2009 HIV & AID, UNDP training, Tripoli - January 2009 Ethics Train, UNDP training, Tripoli - December 2008 The Gender Journey:\nThinking Outside the Box, UNDP training, Tripoli - January 2009 UN Programme On The Prevention Of Harassment, Sexual Harassment and\nAbuse Of Authority, UNDP training, Tripoli - January 2009 Basic and advanced security in the field, UNDP training, Tripoli :"
  }
}