{
  "file_name": "23602130.pdf",
  "sections": {
    "general": "MARKETING AND SPECIAL EVENTS COORDINATOR",
    "summary": "Detail oriented, organized and personable Event Coordinator relocating from the West Coast. In depth understanding of the value of planning and\nconfirming details of events to ensure success. Brings over 6 years of experience and lessons learned to ensure all elements of an event come\ntogether smoothly.Â\nCore Qualifications\nVendor and subcontractor negotiations/relations Prioritization\nCombination of big picture thinking and attention to detail Clear communications with all parties\nRelationship building Time line of required actions for successful eventÂ",
    "skills": "Desktop Publishing Software: Microsoft Office Suite\nTech savvy and able to learn new software quickly and efficiently",
    "experience": "01/2010 to Current\nMarketing and Special Events Coordinator Company Name ï¼​ City , State\nPlan and manage weekend seminars, social retreats, fundraisers and gala dinners from concept to completion.\nDesign all marketing materials, brochures and fliers for conferences and events.\nDeveloped marketing strategy based on knowledge of establishment objectives and market characteristics.\nMaintain and update company website on a daily basis.\n08/2009 to 12/2009\nSpecial Events and Public Relations Intern Company Name ï¼​ City , State\nWorked on media planning and corporate budget management.\nCreated and maintained the company's calendar of events.\nCommunicated with many vendors and publications on PR events\nAssisted in planning retail and wholesale events nationwide.\n05/2009 to 08/2009\nBronx and Central Park Zoo Special Events Intern Company Name ï¼​ City , State\nShadowed Special Event Coordinator on multiple special events such as the Annual Gala and Corporate Outings.\nAssisted event sales manager in walk-throughs and day-of-event logistics.\n11/2007 to 02/2008\nPublic Relations Intern Company Name ï¼​ City , State\nExpanded website traffic through implementation of public relations support.\nContacted potential clients through internet blogging.\nRepresented and promoted the company to potential clients at media related event.\n09/2006 to 06/2009\nAssistant Manager Company Name ï¼​ City , State\nPitched creative and original ideas to clients on a regular basis for potential events.\nMet customers needs in a fast paced environment to maintain positive client relationship.\nDesigned and built samples for events and arrangements for sale.",
    "education": "2009\nBBA : Fashion Marketing and Special Events LIM College ï¼​ City , State GPA: 3.74 Magna Cum Laude\nSigma Beta Delta International Honors Society Member"
  }
}