{
  "file_name": "23841877.pdf",
  "sections": {
    "general": "BISTRO CHEF\nCareer Overview\nA result-oriented client's service professional with over 28 Years of experience in client relations. Encompasses the ability to establish and build\npositive relationships with clients and all level of coworker, or management building strong relations through effective communications.\nCore Strengths\nCustomer and Client relations\nProblem solving\nBookkeeping and Accounting\nStrategic Planning\nInventory control\nStrong oral Communications\nScheduling of Personnel\nAccomplishments\nCertified to go above and beyond, and providing quality and outstanding customer service.\nCustomer recognition for outstanding and consistent customer support.\nSelected to learn new computer programs, and then train others.",
    "work experience": "Bistro Chef 01/2014 to Current Company Name City , State\nResponsibilities include taking customer orders, addressing customer inquires, opening and closing of establishment, preparing food,\ninventory control, problem solving, and cash register operation.\nCustomer Service Rep 01/2011 to 01/2013 Company Name City , State\nResponded to customer inquiries at a fast pace call center.\nMaintained records, processing payments to include set up of payment arrangements.\nAssisted customers by explaining detailed billing formats, and troubleshooting customer's equipment.\nReported outages in affected areas and re-laid information to customers.\nKitchen Manager 01/2010 to 01/2011 Company Name City , State\nResponsible for customer orders as well as customer inquiries, opening and closing of establishment, Maintaining records and placing\ninventory orders.\nFood handling, preparation, safety and storage.\nFilling Online, fax orders, and processing of promotional complementary orders.\nDSP 01/2009 to 01/2010 Company Name City , State\nResponsible for working with Mentally and Physically disabled people, in a home based setting.\nDuties are as follows: Assisting individuals with their daily needs, administering of medications, maintaining staff logs, and reports, scheduling\nDr. appointments for patient care, and safeguarded consumers well-being.\nStore Manager 01/2008 to 01/2009 Company Name City , State\nDaily procedures included opening and closing of establishment.\nPreparing reports for corporate HQ, updated and maintained file records, ordered supplies, handled customers phone inquiries in a timely\nmanner.\nProcessed loans through verifying customers credit report with the utmost regard to their privacy.\nThis included placing calls to payroll and H.R. departments to verify employment, bankruptcy reports, and bank account information.\nTo include accountable for large sums of monies, blank checks, handled armored car pick-ups, and deposited funds into bank accounts.\nInternal Auditor 01/2004 to 01/2008 Company Name City , State\nMaintained and updated records on a daily basis, recalculated figures and insured that formulas were entered correctly.\nAudited all Electronic Activity entered by Pre-Bill, URT and Start Up department inputted into the (RBMS) Retail Business Management\nSystem for management verification.\nCustomer Service Representative 01/2000 to 01/2002 Company Name City , State\nAssisting customer inquiries in fast pace environment.\nMaintained records by entering or tracing orders in progress.\nAssisted customers with extensive product knowledge, Handled shipping and receiving orders.\nConducted training of newly hired employees, operating of register for customer checkout, conducted inventory control which included\npulling and processing of orders, pricing of items, and stocking the store shelves.\nSpecialist/Customer Service Representative 01/1997 to 01/2000 Company Name City , State\nProfessionally assisted all client inquiries at a fast pace call center.\nMaintained records, entered and traced orders in progress, assisted technicians with T1 and T3 equipment problems.\nExplained details to customers on existing orders.\nConducted training for newly hired personnel.\nTracked nationwide outages and re-laid information to clients, technicians, and management.\nAssistant Manager 01/1993 to 01/1996 Company Name City , State\nResponsible for customer and employee relations.\nOpening and closing of establishment, preparing food, hiring and firing of personnel, bookkeeping and accounting, inventory control,\nscheduling of personnel, problem solving and accountability of finances.\nCounter Manager for Ulima 2 Cosmetics. 01/1992 to 01/1993 Company Name City , State\nAnswered customer questions and concerns, advised clientele of products with extensive product knowledge.\nSolved problems, maintained record of customer's product orders, handled inventory control, and register operations.\nEducational Background\nDiploma : Cosmetology, Photography 1990 SZ Delfter Str. City , State , Germany\nDiploma : Biology, Mythology, Computer Science 1987 SZ Hermannsburg City , State , Germany\nHigh School Diploma 1986 SZ Hermannsburg City , State , Germany\nAssociate of Arts : Arts, Archeology KCTCS City , State , United States of America",
    "skills": "Computer experience include: Windows NT, Windows 95, Vista, Windows 7, Windows 8, Microsoft Office, Microsoft Word, Excel, Word\nPerfect, Power Point, Outlook 2013, Android, RBMS, AS400, SMS800."
  }
}