{
  "file_name": "24068423.pdf",
  "sections": {
    "general": "RESEARCH ASSOCIATE",
    "summary": "15+ years of research experience in agricultural research 5 years of extension experience as a agronomic resource professional PhD in Soil\nScience and Crop physiology (minor) Strong experience in conducting and managing research trials of various crops Strong experience in various\ncrop production systems Strong multidisciplinary background: customer support to field research Strong experience in GIS web application\nDevelopment using HTML5, JavaScript, CSS3 ,PHP Strong Experience in - water and nutrient management, drought stress Instruments - Licor\n6400, CIRAS3, Campbell Scientific, GC, HPLC, Wireless irrigation Strong skills in the areas : Statistical design and data analysis, Agricultural\nextension\nHighlights\nx\nx\nx x\nx\nAccomplishments",
    "experience": "Research Associate\nJanuary 2015 to Current Company Name\nManaging sustainable horticultural crop production through environment control Hydroponics tomato production under controlled\nenvironment of light, water and nutrients Identification and characterization of drought and nutrient stress resistance varieties University of\nKentucky 2010 July - 2014 Dec Production environments: field crops, nursery, green house, high tunnels, plasticulture vegetables\nConducted field trials on irrigation and nutrient management, nitrogen cycling Developed physiological models on water use for irrigation\nscheduling for nursery crops Strong background on growth, development and phenology of various crops Multistate USDA project in\ncollaboration with industry on sustainable nursery practices Presented results at grower meetings, national and international scientific\nmeetings Developed programs for automation of irrigation volume, timing and frequency Working knowledge in drip, sprinkler irrigation\nsystems, compost spreaders, mulchers, bed formers, chop gates Worked closely with growers and industry in obtaining first-hand\ninformation about their field Prepared successful grant proposals, technical reports, popular articles and peer reviewed papers Research\nAssistant Plant and Soil Sciences Dept., Univ.\nof Kentucky, 2006 Aug - 2010 May Field investigations of spatial variability on soil water storage and nitrogen status in corn and winter\nwheat in a no-till farmer's field Used soil water sensing capacitance probe, crop growth sensors; Green Seeker, Hydro-N sensor and\nSpectro radiometer to assess spatial variability at field scale Practical knowledge of field equipment: fertilizer applicators, cultivators,\ntractors, combines.\nAgricultural Officer July\nJanuary 2004 to February 2006 Company Name\nActed as a technical consultant for effective knowledge translation and transfer of technology.\nWorked on agronomic practices for field crops and fruits, vegetables and trees.\nSolved site specific soil, nutrient, pest and disease problems in the field.\nJunior Research Fellow Dec\nJanuary 2000 to December 2002 Company Name\nSenior Research Fellow Kerala State Land Use Board, Govt.\nof Kerala 2003 April -2003 Oct.\nIdentified farming systems suitable for different agro-ecological zones of Kerala state, India.\nDevelopment of Site Specific Nutrient Management strategies for farm models of Kerala.\nInvestigated rice response to nitrogen fertilization in farmer's fields.\nUsed simulation models to transfer nitrogen fertilizer recommendations for rice tracts across soil and climatic barriers.\nResearch Assistant Nov\nJanuary 2000 to May 2000 Company Name\nDeveloped sustainable technologies to retain soil, moisture and vegetation in eroded regions using Coir Geo textiles.\nIdentified different types of coir geo textiles for conserving soil and water under varying slopes.",
    "education": "PhD : Soil Science and Crop physiology , 2010 University of Kentucky ï¼​ City Soil Science and Crop physiology\nMS : Soil Science and Agricultural Chemistry , 2002 Tamil Nadu Agricultural University India Soil Science and Agricultural Chemistry\n2000 Kerala Agricultural University India PhD dissertation: Soil water and crop growth processes in a farmer's field *MS theses: Modeling rice\nresponse for agro-technology transfer",
    "publications": "Nambuthiri, S., A. Fulcher, R. Geneve. 2014. Micro-irrigation Systems for Pot-in-Pot Ornamental Nursery Production. In: M. Goyal (Ed),\nMicro-irrigation management in trees and vines. CRC Press. Coolong, T., S. Nambuthiri, R. Warner. 2014. Tensiometer Based Automated\nIrrigation For Tomato under Plasticulture. In: M. Goyal (Ed.), Micro-irrigation management in trees and vines. CRC Press. Ethan, H., S.\nNambuthiri, A. Fulcher, R. Geneve. 2014. Comparing Substrate Moisture-Based Daily Water Use and On Demand Irrigation Regimes for\nOakleaf Hydrangea Grown in Two Container Sizes. Scientia Horticulturae 179: 132-139 Nambuthiri, S., D. Ingram. 2014. Sustainable Ground\nCover Production for More Sustainable Kentucky Landscapes. HortTech (24) 1. Nambuthiri, S., A. Fulcher, A. Koeser, R. Geneve, G. Niu.\n2015. Moving toward sustainability with alternative containers for greenhouse and nursery crop production: A review and research update.\nHortTechnology 25:8-16. Nambuthiri, S., G. Niu, G. Bi, T. Fernandez, R. Geneve. 2015. Substrate Temperature in plastic and alternative nursery\ncontainers. HortTechnology. 25(1):50-56 Geneve, R., S. Nambuthiri, A. Fulcher and E. Hagen. 2014. Irrigation Application Efficiency Calculation\nof Sprinkler Irrigated Container Plants Grown under Sensor based Irrigation Scheduling. Acta Horticulturae",
    "skills": "automation, consultant, Dec, fertilizer, grant proposals, irrigation, Managing, meetings, Modeling, Oct, PhD, processes, Research, scheduling,\nscientific, simulation, translation, articles"
  }
}