{
  "file_name": "24061629.pdf",
  "sections": {
    "general": "CERTIFIED NURSE ASSISTANT\nProfessional Summary\nI am a motivated individual with highly effective communication skills as well as a level-headed health professional who remains calm and effective\nin extremely difficult and stressful situations.Â Â I am seeking a job in the Medical field in a Clinical position that will enable me to grow as a\nknowledgeable professional and enhance my current abilities.Â",
    "skills": "Basic, billing, Charts, CA, copying, CPI, CPR, CPT, faxing, filing, graphic, ICD-9, Keyboarding, Medical Terminology, mail, Office, Microsoft\nWord, Nursing, packaging, Coding, Telephone, phone, written\nAdditional Information\nADDITIONAL INFORMATION Available for all shifts, extended hours and weekend assignments.",
    "education": "Diploma : Medical Assisting , 2012\nDowney Adult School - City , State\nMedical Terminology Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Basic billing. Â Â\nÂ Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â CPT and ICD-9 Coding. Â\nÂ Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Blood draws/Venipuncture Â Â Â Â Â Â Â\nÂ Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Sterilization by autoclaving\nCoursework in Laboratory Equipment Calibration\nCertified Nurse Assistant/Medical Core Program : 12 2011\nCypress College - City , State\nGeneral Education for pre-requisites for Nursing Program.\nMedical Assistant Diploma Certified Nurse Assistant (expires April, 2013) American Heart Association Healthcare Provider (BLS) for CPR and\nAED (expires July, 2014) Nonviolent Crisis Intervention (CPI) (expires December, 2013) HIPAA/OSHA Compliant Microsoft Word\n2007/Keyboarding 37wpm : N. Orange County Regional Occupational ProgramÂ\nCertified Nurse Assistant/Medical Core Program Â Â Â Â\nMedical Terminology. Medical Abbreviations. Knowledge of Body Systems/ Basic Anatomy and Physiology.",
    "certifications": "Medical Assistant Diploma\nCertified Nurse Assistant Â\nAmerican Heart Association Healthcare Provider (BLS) for CPR and AEDÂ\nNonviolent Crisis Intervention (CPI)\nHIPAA/OSHA DiplomaÂ"
  }
}