{
  "file_name": "24516163.pdf",
  "sections": {
    "general": "ASSISTANT STORE MANAGER\nCore Strengths\nVisual retail experience in fashion and design\nExperience in store remodel, store reopening, store transition\nStamina to engage in frequent lifting\nAbility to interpret a variety of diagrams\nMicrosoft Office, MS Word, MS PowerPoint, MS Excel, MS Publisher, MS Outlook\nAdobe Photoshop, Karat, CAD, Easy Weave, Easy Knit, Color Reduce and Clean\nFashion Illustration, Flat Pattern Design",
    "work experience": "10/2010 to Current\nAssistant Store Manager Company Name ï¼​ City , State\nCoached team to increase sales to a 2.4% growth over last year.\nAnalyzed sales daily to develop daily goals for the store and associates.\nPrepared monthly scorecard for TM visit resulting in a average score of 95.\nFocused on Bailey's mission to be the friendliest store in the mall increasing store's conversion 25% over last year to 26.6% for the year.\nCreated training to bring awareness of additional categories.\nLived the core values set by the Bailey's.\n10/2010 to 10/2013\nAssistant Store Manager Company Name ï¼​ City , State\nDrives for positive results through effective coaching and reacting to the needs of the business.\nBuilds and develops high performing teams by setting challenging goals and holding associates accountable.\nConsistently maintains and grow a personal base through the use of client books.\nImplements the monthly VMG to make sure the store is visually appealing and help build upts.\nPrepare, directs, and participates in weekly management meetings.\nPositively and consistently demonstrates a neat, professional, and fashionable image.\nPerforms all other duties and responsibilities as directed by the SM, DSM, and RSM.\n04/2008 to 10/2010\nAssistant Store Manager Company Name ï¼​ City , State\nEnsure Making Women Feel Beautiful is the top priority at all time.\nUnderstands and demonstrates Chico's FAS, Inc Values with both customers and team.\nMaintains constant and timely communication with the SM.\nPrepares weekly and monthly communication for recap with the SM.\nAble to perform all functions in the Guiding Principles for Stores (GPS) and MARS Principles for Stores (MPS).\nEncourage and coaches the store associates in developing their retail skills.\n02/2007 to 04/2008\nDepartment Manager Company Name ï¼​ City , State\nEfficiently manage everyday activities including daily maintenance and inter-department projects.\nImplement all key impact statements, monthly and seasonal merchandise, according to standards, with primary goal of projecting the store\nas best in the defined market.\nRotate merchandise to create fresh statements based on sale promotions and new inventory within point of purchase categories.\nSchedule associates with corporation set labor hours to ensure all department needs are efficiently met.\nConduct preliminary interviews in absence of Training Supervisor.\nAssist with training new associates from performing basic transactions to core recovery standards.\nProvide excellent customer in a timely manner often acting on customer dissatisfaction in absence of store manager.\nTracked daily diamond inventory including checking in new diamond and other fine jewelry inventory.\n11/2005 to 01/2007\nDepartment Manager Company Name ï¼​ City , State\n09/2002 to 11/2005\nVisual Merchandising Specialist/Retail Sales Company Name ï¼​ City , State\nCoordinate effective interior displays that are sensitive to customer and market needs, ensuring company fashion trends are implemented.\nImplement seasonal set/sell planners with strong focus on wall and aisle statements with critical attention to trends and color direction.\nAssist Visual Manager in implementing and executing effective and compelling visual presentation and merchandising of store.\nAssist Visual Manager in merchandise changes, planogram layouts, overall maintenance of visual displays in the store.\nUpdate and maintain store visuals according to corporate standards.\nPlan floor moves, fixture placement, and other visual display placement, arrange displays and fixtures on the selling floor.\nOversee placement of all merchandise and fixtures in the house wares and children's departments.\nGuide customers through the gift registration process based upon their specific wants.\nEducational Background\nDecember 2002\nBachelor of Science : Textile Products Design University of North Carolina at Greensboro ï¼​ City , State Textile Products Design 3.4",
    "skills": "Adobe Photoshop, basic, CAD, coaching, Color, conversion, client, direction, Fashion, focus, GPS, Illustration, image, inventory, market,\nMARS, meetings, merchandising, MS Excel, Microsoft Office, MS Outlook, MS PowerPoint, MS Publisher, MS Word, neat, retail, selling, sales,\nstore manager, Supervisor, visual displays, visual display"
  }
}