{
  "file_name": "24544244.pdf",
  "sections": {
    "general": "PASSENGER SERVICES OFFICER\nProfessional Summary\nA hard working and self-motivated Australian professional willing to learn and develop new skills. I am a dedicated, organised and methodical\nindividual. I have good interpersonal skills, am an excellent team worker with an active and dynamic approach to work. I am flexible, reliable and\npossess excellent time keeping skills. As an aspiring business professional, I am looking to utilize my current analytical skills and knowledge as well\nas further develop these skills in a practical and fast-paced environment.",
    "skills": "accounting, general accounting, approach, business solutions, business strategies, coaching, Good communication skills, communication skills, oral,\nComputer Literate, Client Management, clients, Customer service skills, Data entry, Dispatching, English, essays, fast, financing, leadership skills,\nmanaging, marketing, mentor, Access, Excel, Microsoft Office, PowerPoint, Word, negotiation, organizational, presenting, presentations, problem\nsolving, problem solving skills, problem-solving skills, Retail Sales, safety, Selling, sales, scientific, self motivated, team player, time management,\nwritten\nAdditional Information\nNationality: Australian Visa: Tier 5 Youth Mobility (exp: 24/7/2016) Note: Eligible for EU passport",
    "education": "Bachelor of Applied Science (Aviation) : Aviation Business Management Current Royal Melbourne Institute of Technology - City\nGPA: GPA: 3.4/4.0\nAnalytical and conceptual thinking, with a conscientious approach to managing workloads. Â Â Â\nAbility to handle, analyse and interpret complex data, before presenting it back based on the overall analysis made.\nAdvanced problem solving and numeracy skills.\nAccomplished communication skills, both written and verbal developed through numerous essays and presentations. Â·Â Â Â Â Â Â\nProficiency in all areas of Microsoft Office, including Access, Excel, Word and PowerPoint.Â\n3.5 GPA\nUniversity of Westminster -\nCommencing a 3-month scholarship at the University of Westminster. This will be undertaken via distance learning.\n2011 - Successfully obtained a Certificate III in Tourism Retail Sales : Physics, Mathematical Methods, English Literature, English Mainstream,\nChemistry and Biology 1 2009 Parade Secondary College -\nPhysics, Mathematical Methods, English Literature, English Mainstream, Chemistry and Biology Australian Tertiary Admission Rank: 83.40\nQualifications\nDiploma : Management 1 2012 - Management"
  }
}