{
  "file_name": "24703983.pdf",
  "sections": {
    "general": "ACCOUNTANT",
    "summary": "Experienced accounting professional with proficient, analytical and problem solving abilities. Results oriented and flexible in a rapidly changing\nenvironment.",
    "skills": "accountant, accounting systems, accounting system, accounts payable, balance sheet, conversion, financial statements, Excel spreadsheets, excel,\nMicrosoft Office, Outlook, sales, tax returns, year-end",
    "experience": "03/2015 to 07/2017\nAccountant Company Name ï¼​ City , State\nProcessed daily corporate customer payments using CDK and Rental payments using TSD.\nRan monthly customer statements.\nResponded to and followed up on customer inquiries.\nProcessed daily cash journal entries.\nResponsible for running monthly aging reports for the accounts payable department and stores.\n10/2004 to 04/2015\nAccountant Company Name ï¼​ City , State\nProcessed and paid state, city and county tax returns.\nProcessed yearly property tax returns.\nResearched and responded to customer and the sales department inquiries.\nRan monthly customer statements.\nReconciled balance sheet accounts.\nProcessed monthly journal entries using Agate a specialized software.\nHelped with month-end and year-end closings.\nCreated various requested excel reports.\n05/2000 to 04/2004\nAccounting Manager Company Name ï¼​ City , State\nSupervised one staff accountant.\nResponsible for the timely balancing of two accounting systems.\nManaged the reconciliation of all balance sheet accounts.\nProcessed and paid the monthly state, county and city tax returns.\nAccountable for the accounts payable area.\nDeveloped and maintained various Excel spreadsheets.\nImplemented and oversaw system enhancements.\n02/1989 to 04/2000\nAccountant Company Name ï¼​ City , State\nProcessed monthly financial statements.\nReconciled all balance sheet accounts.\nProcessed and paid monthly state, county and city tax returns.\nResearched and responded to customer inquiries regarding monthly statements.\nImplemented and tested accounting system conversion.\nEducation and Training\nAssociate of Applied Science Normandale Community College ï¼​ City , State"
  }
}