{
  "file_name": "25070914.pdf",
  "sections": {
    "general": "PUBLIC RELATIONS EXECUTIVE\nProfessional Summary\nA highly skilled public relations, communications and special events executive with 15 +years of public relations, business development and\noperations experience. She has strong strategic thinking and planning skills; able to achieve goals with high efficiency and within tight parameters.\nOutstanding interpersonal management skills; establishes rapport and credibility quickly. Ms. Alexander has excellent team and project leadership\nqualities. Highly articulate with written and spoken word, quick thinking, and possesses sound judgment. Ms. Alexander maximizes her business\neffectiveness; and is experienced with managing and working with databases and software including Excel, Power Point, Outlook and Cision.",
    "skills": "photo, artist, Arts, Avenue, billings, budgets, budget, bi, cable, CA, client, clients, databases, event management, Special Events, fashion, film,\nLegal, Magic, Managing, Marketing strategies, marketing plans, market, materials, Media Relations, Works, Paralegal, press kits, press, press\nreleases, PR, Producer, proposals, publications, Publicity, quality control, Recording, strategy, TV, television, video\nAdditional Information\nPlay a vital role in event and awards show facilitation (Soul Train Music Awards, MTV Awards, GRAMMY, NAACP Image Awards,\nAmerica Music Awards, and BET, etc.), including artist coverage on red carpets and artist bookings at ancillary activities. Direct the\nproduction and approvals of press releases, videos, photography, press kits and other PR tools necessary to communicate image, product,\nand spokespeople Clients have included: NBA All-Star Weekend/Los Angeles (2011) & Dallas 2010), BET Awards, Russell\nSimmons/Phat Farm Fashions (Gifting Suite), ASCAP (Music Expo, Pop Music Awards and Film & Television Music Awards), Tony\nRock (Actor/Comedian) and Roshanak Filmswork.",
    "education": "Bachelor of Science : Business | Management University of Phoenix - City , State Business | Management\nAssociate : Arts - Law Los Angeles City College -\nLegal Studies/Paralegal (Entertainment) 3616 Cardiff Avenue | #109 | Los Angeles, CA | 90034-4085 :\nAssociate of Arts : Law | Legal Studies/Paralegal (Entertainment) Los Angeles City College - City , State"
  }
}