{
  "file_name": "25127518.pdf",
  "sections": {
    "general": "ACCOUNTANT",
    "summary": "Experienced, detail-oriented Accountant who effectively manages multiple projects, and possesses superior organizational and communication\nskills is seeking a challenging position.",
    "skills": "accounting, Accountant, Accounting software, accounts payable, Accounts Receivable, Billing, budgets, Cash management, closing, contracts,\ndraw, cost analysis, credit, Financial Accounting, Financial Reporting, financial statements, Forecasting, General Ledger, grants, Job Costing, MS\nOffice Suite, office, payroll, Pivot Tables, Processes, recording, Sage, taxes, tax returns, Verbal Communication Skills, Written",
    "experience": "Accountant Sep 2012 to Current\nCompany Name ï¼​ City , State\nPromoted from Account Clerk to Accountant.\nPerforms General Ledger reconciliation.\nTrains new employees on accounting principles and company procedures.\nCreates periodic reports comparing budgeted costs to actual costs.\nWeekly draw down cash from the State of Missouri utilizing the Financial Reporting System.\nFacilitates Accounts Receivable, including billing and collections.\nProcesses Accounts Payable using Sage software.\nManages many budgets for several grants, awards and contracts.\nDocuments fiscal procedures and revises SLATE's fiscal manual as needed.\nForecasting for several programs and departments as requested.\nAdministrative Assistant Jun 2006 to Jun 2011\nCompany Name ï¼​ City , State\nManaged office supplies, vendors, organization and upkeep.\nCash management for various projects.\nManaged school picture program.\nManaged parking tag program.\nDirected guests and routed deliveries and courier services.\nAnswered and managed incoming and outgoing calls while recording accurate messages.\nGreeted numerous visitors, including VIPs, vendors and interview candidates.\nFacilitated the changes to the student handbook each year.\nImplemented the staff and student ID program.\nAccounting Manager May 2005 to Jun 2006\nCompany Name ï¼​ City , State\nProcessed and reconciled Accounts Payable.\nProcessed and reconciled Accounts Receivable including deposits.\nFacilitated all Billing and Collections.\nMaintained integrity of general ledger, including the chart of accounts.\nFiled tax returns and prepared governmental reports in compliance with strict standards.\nGenerated financial statements and facilitated account closing procedures each month.\nAnalyzed and researched accounting issues to improve accounting operations procedures.\nPerformed cost analysis as needed.\nAdministrative Assistant And Billing Specialist Jan 1997 to May 2004\nCompany Name ï¼​ City , State\nAccurately performed billing for three departments.\nFacilitated collections for all delinquent accounts.\nSet up new accounts including credit requests.\nCreated account merge and billing process for IESI after they bought several small companies, facilitating a smooth merge of all companies.\nPerformed complete payroll including payroll taxes.\nManaged the accounts payable and accounts receivable.\nReconciliation of vendor statements.\nEducation and Training\nAssociate of Applied Science , Accounting St. Louis Community College ï¼​ City , State Accounting\nHonors Project Completed in Financial Accounting"
  }
}