{
  "file_name": "25207620.pdf",
  "sections": {
    "general": "INFORMATION TECHNOLOGY CERTIFIED TECHNICIAN",
    "summary": "Over Nineteen years of experience in Information Technology.Information Technology professional with well-developed interpersonal,\ncommunication, organizational and presentation skills. Solutions-focused, team oriented Senior Technical Support Analyst with broad-based\nexperience and hands-on skills in the successful implementation of highly effective desktop support operations. A broad understanding of computer\nhardware and software, including installation, configuration, management, trouble-shooting, and support. Extensive experience with HP products to\ninclude Desktop, Laptop, high-end MFP devices and Web JetAdmin, Areas of direct expertise include Project Coordination & Design, In-depth\nTechnical Support, Corporate Desktop Support, Microsoft OS experience including installations-configuration-imaging, migration, and registry\nediting. Network and Citrix experience. Recommendations listed on Roz Arasmo - Estee Lauder Companies, Inc., Human Resources\nAdministrator It is with great pleasure do I take this opportunity to write this recommendation on such an extra ordinary individual who is not only\nan awesome person to know but a wonderful colleague as well. During the almost ten (10) years of knowing Bill, he has not only displayed a great\ntalent within the IT organization at Estee Lauder, but has distributed excellent skills and customer service to everyone throughout the company. He\nis extremely well thought of from every level of management to Senior management. His dedication and diligent to excellence has proven superior\ntime and time again. When called upon he demonstrates top support in a timely and professional manner not to mention that he completes his tasks\nthoroughly with accuracy never having to be called back again for the same issue. We have been privileged to have such an awesome professional\nwithin our organization. ____________________________________________________________________________________________\nLorilee Dickson - Director, Change Management and Communications at Estee Lauder Bill is a diligent and hard-working professional with\nexcellent customer service skills and exceptional knowledge of the IT industry. Each time I requested support, he was quick to respond and\ncompleted each request completely and with urgency. His thorough approach and attention to detail are an added bonus to the computer support\nhe provides on a regular basis.",
    "skills": "A+, A+ Certification, Antivirus, CNA, Hardware, Hardware Installation, Customer Service, DOS, Hardware Support, Information Technology,\nInternet Explorer, IP, Mac OS, MCP, MCSE, Microsoft Office, Windows 7, Windows 8.1, Enterprise, Network, Networking, Novell, SAP,\nSoftware Documentation, Symantec, Desktop support, Technical Support, Technician, Troubleshooting, User Interface",
    "experience": "Information Technology Certified Technician 03/2010 ï¼​ Current Company Name\nDesktop support, software/hardware installations and configurations for Manhattan area.\nSenior Technical Support Technician 01/2006 ï¼​ 01/2011 Company Name\nSenior Desktop Support Analyst\nresponsible for software & hardware assets for company.\nDedicated technician to 500+ end users.\nSenior Technician for SAP Project 2006-2010.\nEducation and Training\n2017 Computer Career College - MCSE,CNA, A+,CNA, Information Technology : City University of New York - CIS - Computer and\nInformation Systems Security / Information Assurance Computer and Information Systems Security / Information Assurance\n1987 Rollins College - Finance Finance\n1962 Certifications MCSE, MCP, CNA, Comptia A+, A+Network, A+ Security, HIPPA, Series 7,63,24 Microsoft, Comptia, Novell, SEC\nSeries 7,63,24 : Hofstra College - Business Administration Business Administration",
    "certifications": "Technical Support (Advanced, 20+ years' experience) Training (Advanced, 15 years' experience) Microsoft Office (Advanced, 11 years'\nexperience) Hardware Support (Advanced, 20+ years' experience) Hardware Diagnostics (Advanced, 20+ years' experience) Hardware\nInstallation (Advanced, 20+ years' experience) Software Documentation (Advanced, 10 years' experience) Enterprise Software Organization\n(Intermediate) CompTIA A+ Certification (Advanced, 12"
  }
}