{
  "file_name": "25328428.pdf",
  "sections": {
    "general": "HOME HEALTHCARE TECHNICIAN",
    "summary": "Certified Nursing Assistant with 3+ years work in fast-paced environment handling confidential paperwork, administering medication and providing\nquality patient careHardworking, skilled at wound care, mobility assistance and charting. Highly flexible and willing to work all shifts. E xperience\nserving chronically ill patients, including assisting with daily living activities and household tasks. Patient and highly compassionate. Â Home health\ncare and hospice care settings. Established record of reliability and creating positive rapport with patients, family and staff. Â Currently certified\nwithÂ National Health Association.Â Â SixÂ years experience with physically disabled client. Monitored vital signs, assisted with feeding,\nbathing/grooming, positioning and range of motion exercises. Looking for a permant Â care position, with a health care facility that I can stay with\nand give my time and skills to.Â",
    "skills": "Patient-focused care,Â\nCompassionate and trustworthy caregiver ,\nDetail-oriented ,Â\nEffectively interacts with patients and families,\nCharting and record keeping\nMedical terminology\nTime management\nWound care",
    "experience": "September 2015\nCompany Name City , State Home Healthcare Technician\nI am currently working full Â time as a home health Patient care technician, I am looking for a position in a medical center or office setting.\nThey currently do not offer benefits, and no paid holidays and no paid vacation.\nI would like a full time position, with benefits package.\nApril 2015\nto\nMay 2015\nCompany Name Professional ExPerience\nCertified Nursing Assistant with home health care and hospice care experience.\nProven record of reliabitity and strong ability to establish rapport with patients, family and staff.\nAlso Certified in Phlebotomy, EKG and CPR.\nMarch 1998\nto\nJuly 2002\nCompany Name City , State Admitting Clerk I Emergency Room Clerk\nI loved my job at Carraway because people needed someone who understood the problems they were having and not judge them.\nI interacted with not only the patient but the Nurses and Doctors also the families of the patients.\nSome of these families were recieving the worst news of their lives, some were getting wonderful news, so I was there to celebrate and to\nmorn or just for them to lean on for a moment.\nFebruary 1989\nto\nMarch 1993\nCompany Name City , State Certified Nursing Assistant\nI cared for residents of all ages, helping with their daily activities such as bathing, dressing, oral care, excerise.\nI cleaned the room, changed the bed linens, dusted, put things away for them.\nI would read to them, help them with anything they needed help with.\nEducation and Training\n2015\nJeremiah's Hope Academy City , State , United States Patient care tech./ EKG Tech., Phlebotomy Tech. This program taught me Patient care\ntechnician with Phlebotomy, EKG and BLS CPR. I did very well inall my classes and in my clinicals I also was taught extensive medical\nTechnology. Also teaching me that heathcare is very inportant in everyones daily lives.\nWallace State Community Ccllege City , State , United States Paralegalisum I did not graduate because my husband and I had parents that got\nvery sick, so I had to stop school and take care of our parents. Â While doing this I realized I wasnted to go back into the medical field so I could\nmake a difference.\n1993\nDora High School/ Wallace Community College City , State , United States GED : General Studies General Studies. I went to Dora High School\nin 1978 but did not return. I then took my GED and achieved that in 1993."
  }
}