{
  "file_name": "25462793.pdf",
  "sections": {
    "general": "ACCOUNTANT",
    "summary": "Accountant with over a decade of diverse professional experience including corporate and small business accounting, tax preparation and\naccounting services. Dedicated and reliable team member who enjoys learning and taking on new challenges.\nHighlights\nAccounts Receivable/Payable\nMaster's Degree\nGeneral Ledger Accounting\nSales Tax Reporting\nGAAP Knowledge\nPeriod End Close\nTeam Oriented\nTax Preparation\nFinancial Statement Preparation\nHigh Attention to Detail Microsoft Office programs\nProficient in Microsoft Windows operating systems\nExperienced with accounting, bookkeeping, and ERP programs",
    "experience": "Company Name August 2011 to Current Accountant\nCity , State\nResponsible for consistent, accurate and timely period end close Calculate, process and analyze journal entries and accruals Maintain\ngeneral ledger for multiple entities worldwide Prepare account reconciliations for multiple accounts across multiple entities Work as member\nof team to prepare 10-Q and 10-K reports Prepare XBRL instance document for submission to SEC Responsible for completion of\nvarious U.S.\nGovernment surveys Monthly sales tax reporting.\nCompany Name April 2007 to July 2011 Accountant\nCity , State\nSupported company ownership by providing accounting insight and technical knowledge Responsible for all accounting functions, including\nAR, AP, GL, payroll, period-end close processes, account reconciliations and sales tax reporting Monitor accurate and appropriate\nrecording of revenues and expenses Monitor cash flow and balances; project future cash balances and needs Monitor and analyze monthly\noperating results against budget Professional Experience, cont.\nCompany Name January 2006 to October 2006 Staff Accountant\nCity , State\nMaintained general ledger for multiple clients Prepared journal entries and adjusting journal entries Responsible for monthly reconciliations\nPrepared financial statement compilations Prepared individual income tax returns Calculated and prepared monthly payroll deposits\nPrepared quarterly and annual payroll reports for multiple clients Prepared annual Form 1099 for multiple clients Assisted in preparation of\nfinancial and operating reports.",
    "education": "Certified Public Accountant Colorado License Number 25320\nColorado State University May 2005 M.S : Business Administration Accounting City , State Business Administration Accounting\nCertificate in Taxation\nRegis University May 2003 B.S : Accounting Accounting\nUniversity of Colorado at Boulder August 1998 B.S : Business Administration Business Administration",
    "interests": "Fall 2011-Present Local Cub Scout Pack & Boy Scout Troop - Boy Scouts of America Pack Committee Chair, Den Leader, Fundraising Chair,\nMerit Badge Counselor",
    "skills": "Account Reconciliations, accounting, accounting systems, Accounts Receivable, accruals, AP, AR, Attention to Detail, bookkeeping, budget, cash\nflow, oral communication, Certified Public Accountant, CPA, clients, ERP, financial, Financial Statement Preparation, general ledger, General\nLedger Accounting, GL, Government, Microsoft Office programs, Microsoft Windows, operating systems, payroll, presentations, processes,\nrecording, reporting, Sales, surveys, Tax, Tax Preparation, tax returns, written\nAdditional Information\nVolunteer Service Fall 2011-Present Local Cub Scout Pack & Boy Scout Troop - Boy Scouts of America Pack Committee Chair, Den\nLeader, Fundraising Chair, Merit Badge Counselor"
  }
}