{
  "file_name": "25525152.pdf",
  "sections": {
    "general": "EDITORIAL ASSISTANT",
    "summary": "Focused Journalist successful in developing feature articles, short stories, editorial pieces and broadcast scripts. Strong technical command of the\nEnglish language and familiarity with a wide range of writing styles. Committed to maintaining journalistic excellence and integrity.",
    "skills": "Proficient with video editing software: Final Cut Pro and Edius.\nDesktop Publishing Software: Photoshop, Illustrator, HTML\nPhotojournalism and videography\nCopy editing and proofreading\nManaging skills: advanced problem-solving, great organizational skills.",
    "experience": "Editorial Assistant 08/2017 Company Name City , State\nHead of submissions department.\nAct as the first point of contact for author's questions, concerns ect. during the submission process.\nUpdate and maintain company's database.\nReview samples to determine if suitable for publication.\nProduction Assistant 01/2017 to 08/2017 Company Name City , State\nProvided video production and digitization services to faculty, staff, and departments at The University of Tennessee.\nIntern 01/2016 to 06/2016 Company Name City , State\nContributed articles and photos to Sydney local magazine Peninsula and Northshore Living.\nIntern Reporter 08/2015 to 12/2015 Company Name City , State\nCaptured visual content and edited general assignment stories to be shown on air.\nGathered and verified factual information regarding stories through interviews, observation and research.\nColumnist 08/2013 to 12/2016 Company Name City , State\nPublished weekly op-ed in school newspaper titled School of Sarcasm.\nTopics covered campus life.\nReceived highest readership for three consecutive years.\nFreelance Writer 08/2014 to Current Company Name City , State\nWrote unique articles for Wojdylo media, pertaining to social media advancements.\nDeejay 01/2014 to 06/2014 Company Name City , State\nPresented local news on campus public radio.\nOrganized playlists for radio and announced song titles.\nEducation and Training\nBachelor of Science : Journalism 2017 The University of Tennessee City , State Bachelor of Science in Communication and Information with a\nmajor in Journalism and Electronic Media and a minor in English.\nActivities and Honors\nSelected to participate in College of Communication and Information Global Scholars Study Abroad Program in Sydney, Australia for Spring\n2016."
  }
}