{
  "file_name": "26456899.pdf",
  "sections": {
    "general": "ENGINEERING LAB TECHNICIAN",
    "summary": "To obtain a position in my field of Electronics with a company that offers opportunities for advancement based on strong technical skills and work\nperformance.",
    "skills": "Alpha, automotive, basic, C+, C++, CAD, CD, oral, DC, DVD, electronics, fiber optics, functional, GPS, hand tools, Java script, Linux, Logic,\nmachinery, Access, Excel, Outlook, PowerPoint, Microsoft Word, Multimeters, oscilloscopes, Oscilloscope, OSi, plumbing, Quality, QA,\nrepairing, ssh, software developers, software development, software installation, soldering, SQL, test tools, transformers, transmission,\nTroubleshoot, troubleshooting, USB, view, Visual Studio, wiring, written communication skills",
    "experience": "Engineering Lab Technician Jan 2014 to Jan 2016\nCompany Name ï¼​ City , State\nRun software tests, physical checks and Beverage QA tests on new technology being developed.\nBuild test cases for new software builds.\nPerform regression, functional and smoke testing.\nUse refractometers to test brix.\nUse oscilloscopes to test wave patterns in circuits.\nSupport different platforms with software installation, light plumbing and testing.\nTrained in All Beverage Quality test tools, including Refractometer, Oscilloscope and Function Generators, Multimeters and all basic hand\ntools.\nRun various test cases on NEW Platforms to ensure stability in units before field release.\nResponsible for Mechanically troubleshooting Lab Fixtures within the Freestyle Platform.\nCalibrate Alpha and Beta prototype units to perform at optimal expectation.\nWork closely with software developers testing strategies in the implementation of software.\nMicrosoft test manager to write test cases and create bugs for software development.\nMicrosoft Team Foundation Server to add tasks to PBI's.\nTera Term software application to provide ssh/serial connection to Linux platform devices.\nGShell software to view modify on sub machines.\nEngineering Validation Test Technician Jan 2012 to Jan 2014\nCompany Name ï¼​ City , State\nTest and validate new technology from automotive manufacturers.\nRun environmental tests on infotainment devices.\nBuild various wire harnesses for testing equipment.\nOperate thermotron chambers to test stability in head units.\nPerform continuity tests on wiring assemblies.\nRun X-axis, Y-axis and Z-axis vibration tests.\nTest DVD, CD, GPS, USB, and IPOD infotainment devices for manufacturers specifications.\nElectromechanical Technician Jan 2010 to Jan 2012\nCompany Name ï¼​ City , State\nBuild and calibrate 9500 series mercury porosimeter instruments.\nBuild 2020 series chemisorption and physisorption instruments.\nElectromechanical assembly.\nAssemble PC Boards.\nUse hand tools to build, calibrate and test entire units to completion.\nTroubleshoot components when failures occur in unit boards.\nAssemble plumbing and servo valves.\nDriver/Mall specialist Jan 2001 to Jan 2009\nCompany Name ï¼​ City , State\nDrive and maintain a 30 ft.\npumper truck.\nInteract and service customers on a daily basis.\nHandled complicated machinery constantly.\nEducation and Training\nAssociate of Science Degree , Computer and Electronics Engineering Technology 2013 ITT Technical Institute ï¼​ City , State Computer and\nElectronics Engineering Technology\nBachelor of Science Degree , Electronics and Communication Engineering Technology September, 2013 Electronics and Communication\nEngineering Technology Maintained an A average every quarter since enrolling *Obtained highest honors certificate every quarter 3.7",
    "publications": "M.K.I. Waste Oil Systems Steve Brawley (C.E.O. of M.K.I. Waste oil systems) (678)-898- 2283"
  }
}