{
  "file_name": "26829561.pdf",
  "sections": {
    "general": "INVENTORY ANALYST\\MATERIALS PLANNER",
    "summary": "Industrial Engineer with wide experience in manufacturing, quality, material planning and inventory control. Reach revenue goals through hard work\nand process improvement. Expert in MRP II, proficient in MS office and Exact Macola. Bilingual English/Spanish.\nAreas of Expertise\nMaterial Planning\\MRP\nFirm knowledge of APICS concepts.\nInventory Accuracy\nKnowledgeable of Lean Manufacturing principles and the Theory of Constraints.\nManufacturing planning and control.\nProcess improvement\nERP systems implementation\nAccomplishments\nAs Material Planner/Inventory Analyst: Achieved 99% inventory accuracy through weekly cycle counting and process improvement.\nEliminated production disruption caused by material shortage.\nAs Operations Manager: Improved customer service by automating Quote- Order Entry- Billing process for a small business.\nAs Project Manager: Reduced implementation time by 50%.",
    "experience": "06/2008 - 08/2013\nCompany Name ï¼​ City , State Inventory Analyst\\Materials Planner\nAnalyzed MRP output and exceptions. Worked with Procurement to expedite and prevent shortages, revised and corrected safety stock\nlevels, audited inventory transactions and posted corrections. Managed sub-contractors.\nImplemented weekly cycle counting. Achieved 99% inventory accuracy through BOM analysis and process improvement.\nEliminated material shortage trough in depth analysis of process flow and transactions.\nMentored a comprehensive use of the software (Exact Macola)\n11/2005 - 05/2008\nCompany Name ï¼​ City , State Operations Manager\nScheduled Job installation, placed and kept track of purchase orders and productions orders. Kept track of budget vs expenses. Prepared\nexecutive reports.\nImplemented Quickbooks - Contractor Edition.\nAchieved: Improved cost control and project management with Quickbooks.\nAchieved: Improved customer service through automation of the Quote - Order Entry - Billing Cycle.\n02/1998 - 03/2005\nCompany Name ï¼​ City , State Project Manager / Senior Consultant\nSuccessfully managed numerous software implementations of Exact Macola (ERP), MP2 (maintenance), Goldmine (CRM).\nAs senior consultant trained customers and automatized operations for medium and large companies.\nAchievement: Reduced implementation time to 50%.\n03/1994 - 02/1998\nCompany Name ï¼​ City , State Warehouse Manager / Production Manager\nManaged logistics and operations in the Distribution Center.\nSetup and launched production lines until fully operative.\nAchievements: Implemented the Quality Control System and personnel training. Reached desired efficiency in short time.",
    "education": "1993\nPontificia Universidad Catolica Madre y Maestra City , Dominican Rep. Industrial Engineer",
    "certifications": "APICS Courses: Attended workshops for Master Planning of Resources, Detailed Scheduling and Planning, Execution and Control of\nOperations, Strategic Management of Resources, certification pending.\nManufacturing Planning and Control, Exact Software, 1998.\nEnterprise Resourcing Planning, Exact Software, 1999.\nDatastream - MP2 , Certified Consultant , Santo Domingo, D.R. 2002\nTechnical Skills\nSkills Experience Total Years Last Used\nCrystal Reports\nMS Office\nProject Management / MS Project\nQuickbooks - Contractor Edition\nCRM - Goldmine"
  }
}