{
  "file_name": "27004930.pdf",
  "sections": {
    "general": "BUSINESS DEVELOPMENT MANAGER\nProfessional Summary\nExperienced, driven and successful Sales Professional recognized for consistently growing sales revenues and profitability. Frequently selected by\nmanagement to open new territories and rapidly develop sales pipelines through the use of innovative and imaginative sales and marketing\nprograms that achieve maximum market exposure and penetration. Parlays commitment to community and passionate for causes supported into\nstrong networking and business alliances. Proficiencies: Solution Based Sales Key Relationship Management Business Development Project\nManagement Product Knowledge Territory Management Customer Education & Training Marketing & Brand Positioning Stakeholder\nEngagement",
    "skills": "billing, book, budgets, coaching, contract administration, Customer Relationship Management, CRM, client, clients, Client liaison, customer\nsatisfaction, customer service, delivery, directing, Government, Information Technology, invoicing, leadership, Managing, marketing, Market,\nmentoring, office, organizational, policies, Project Management, Relationship management, RFP, Sales, sales and management, staffing,\nTelecommunications, training programs, Author\nAdditional Information\nCommunity Leadership Rock Steady Boxing, Volunteer Coach for program designed to provide betterment of life for boxers diagnosed\nwith Parkinson's. Assisted with the distribution of sponsorship information to contacts as well as annual table captain for two personal\ntables. Junior Achievement of Indianapolis, Volunteer for JA of Indy as well at BizTown as a mentor to students. Families First, Volunteer\nand hold seat of Advisory Council Board Member. Helped gain donated items for silent/live auction at annual event. Helped with set up and\norganization of annual event. Christian Chamber of Commerce, Yearly sponsor of monthly lunch series MyComputerCareer.com, Guest\nSpeaker discussing importance of LinkedIN and possible advantages and disadvantages of social media in the job marketplace Cardboard\nBox Ministries, Mentor to organization and currently hold seat on Board of Directors",
    "education": "Associate's degree : Early Education Ashford University - City , State\nBachelor of Science : Ashford University - City , State"
  }
}