{
  "file_name": "27024099.pdf",
  "sections": {
    "general": "QUALITY ANALYST/SENIOR RECORD KEEPING SPECIALIST",
    "summary": "Administrative professional eager to leverage over 20 years of experience and business management degree to secure a higher level position that\nwill demonstrate leadership skills. Highly organized, efficient and skilled in a variety of office support tasks.\nProfessional Highlights\nProcedure\ndevelopment\nPersonable\nCreates vision for performing art shows and acquires appropriate facilities for expected guests.\nTeam building\nRelationship building\nMotivates and manages teams for targeted outcomes.\nFlexible\nRecruit and supervise associates to ensure effective mentoring of all performers. Dedicated\nClient relationships\nLead coach for upwards of 60 performers per venue. Troubleshooting and\nproblem solving\nOversees all record keeping.\nProductivity\nimprovement specialist\nHandles approval of budgets, payroll accounts, costume selections, stage sets, playbills press releases and\nQuality assurance and\npurchases of insurance contracts required for facility rentals.\ncontrol\nOrganized\nReviews and approves rental contracts for vendors, captures sales records for ticket type orders, manages\nResults-oriented\ntimelines and schedules.\nCost reduction and\ncontainment",
    "experience": "May 2010\nCompany Name City , State Quality Analyst/Senior Record Keeping Specialist\nExcel within deadline-intensive environment, ensuring the accurate and on-time completion of QC related tasks and volumes related to\nservice level agreements.\nProvided weekly team building to motivate peers toward team mindsets resulting in praise by management and associates.\nFacilitate team huddle and use lean capacity management principles to flex workloads between Pay-In QC processes.\nDocument standardization of processing to eliminate waste.\nAttend daily/weekly meetings related to implementation of process improvements as a result of problem solving.\nAssist in updating standard operating procedures related to the Asset Transfer process.\nAssisted in developing visual management boards related to four separate processes to monitor production and capacity management.\nResponsible for researching and reporting trends that will effect work processes; provide effective and efficient action plan to eliminate\nwaste and implement within necessary turn-around time.\nTapped for projects company-wide.\nRecognized for high-quality work, organizational strengths and exceptional customer service delivery related to the TIAA-CREF Way.\nJanuary 2007\nto\nMay 2010\nCompany Name City , State Customer Service Representative\nProvided quality service to customers related to asset transfer form requests and NIGO resolution. Lead associate for NIGO reporting to\nupper management and responsible for reduction of NIGO queues by working with financial consultants and related associates.\nJanuary 2001\nto\nJanuary 2007\nCompany Name City , State Customer Service Representative\nActed as a liaison to supervise 15 institutions requesting enrollments and information related to posting client premiums.\nAccurately performed calculations related to gains or losses.\nPerformed rollover/transfer payments to and from contracts to serve client requests.\nProcessed refund payments for reconciliation of unclaimed payments.\nJanuary 1990\nto\nJanuary 2001\nCompany Name City , State Receptionist/Administrative/Telephone Service Counselor\nProfessionally responded to telephone/written communication and in person visits from participants and institutions regarding payments,\neligibility, policy loans and individual life insurance products.\nReceived excellent reviews for customer service and resolution of client complaints.\nMarch 2004\nto\nCurrent\nCompany Name City , State Performing Arts Director/Project Manager\nCreates vision for performing art shows and acquires appropriate facilities for expected guests.\nMotivates and manages teams for targeted outcomes.\nRecruit and supervise associates to ensure effective mentoring ofall performers.\nLead coach for upwards of 60 performers per venue.\nOversees all record keeping.\nHandles approval of budgets, payroll accounts, costume selections, stage sets, playbills press releases and purchases of insurance contracts\nrequired for facility rentals.\nReviews and approves rental contracts for vendors, captures sales records for ticket type orders, manages timelines and schedules.",
    "education": "University of Phoenix City , State Pursuant of Bachelors Degree : Business Management Project Management Business Management Project\nManagement\nBerkeley College City , State Associates Degree : Business/Office Administration Business/Office Administration\nWork History\nCompany Name\nCompany Name\nCompany Name",
    "skills": "Customer service, people and goal-oriented, proven ability to mentor and coach, verbal and written communications"
  }
}