{
  "file_name": "27139412.pdf",
  "sections": {
    "general": "BUSINESS DEVELOPMENT EXECUTIVE",
    "summary": "An achievement driven professional highly skilled in sales, product development, strategic marketing and Salesforce lead management. Creative\nwith an extensive knowledge of industry sales points, both in and out of consumer markets. Dynamic communicator who consistently exceeds\ngoals and expectations.",
    "skills": "Brand development\nAnalyzing market trends\nEstablished track record of exceptional sales results\nAccount Management\nExcellent negotiating tactics\nSkilled multi-tasker\nSalesForce lead management\nStrong interpersonal skills",
    "experience": "Company Name January 2017 to Current Business Development Executive\nState\nResponsible for growing Ceridian's business throughout the Canadian Enterprise Market Collaborates with internal stakeholders to develop\nstrategic GTM Works with internal marketing team to develop campaigns for the targeted market Manages the introduction of new\nprograms and/or features within Ceridian to consumer base Conducts market research, profiles customers, makes presentations and\nparticipates in sales calls and marketing events to establish customers and determine market segment revenue potential Develops and\nimplements marketing and sales strategy for securing and/or increasing market share, sales and profit Participates in quarterly QBR's.\nCompany Name November 2015 to January 2017 Solutions Analyst\nCity , State\nReviewed new customer orders and manually enter data into SAP.\nProcessed transactions pertaining to designated vendor.\nProvided information and guidance on vendor products and programs.\nCompany Name October 2012 to October 2015 Product Marketing Specialist\nCity , State\nOwned the communication of Vendor Partner business strategy to internal partners (Sales, Purchasing, and Marketing Services) Consumer\nand sales rep marketing at 5LINX convention seminars including marketing, branding and consumer relations.\nMet and interacted regularly with Vendor Partner reps, management, and executives to make formal presentations on product trends,\nperformance, profitability and results of product line promotions Assumed leadership role in the department and vendor meetings on\nassigned projects.\nCompany Name December 2011 to July 2012 Project Coordinator/ Sales\nCity , State\nCreated publications that were focused on key business sectors reaching corporate-level executives worldwide.\nDelivered content through print and online media.\nDeveloped and maintained long-term relationships with vendors and clients.\nConsistently hit and exceeded sales goals.\nBuilt strong client relationships and provided value-adding services.\nDeveloped sales strategies and negotiated and closed profitable projects.\nEducation and Training\nMiami Dade College 2013 Marketing Management Real Estate City , State Marketing Management Real Estate"
  }
}