{
  "file_name": "27502951.pdf",
  "sections": {
    "general": "INTERNATIONAL CERTIFICATION PROGRAM MANAGEMENT\nProfile\nI am an experienced professional with 14 years of aviation & aerospace with expertise in international governmental liaison, aircraft certification,\nregulatory compliance, aircraft sales and import/export compliance. As a professional pilot with over 800 hours of total time, multi-tasking,\nproblem solving and risk management are a foundation of my career.",
    "skills": "account management, Autocad, billing, , catalogs, civil aviation authority, computer networking, customer satisfaction, Delivery documentation,\ngovernment, inventory control, invoicing, LAN, meetings, all Microsoft, MS Office, Windows operating systems, network, Process development,\nProgram Management, quality, Safety, Sales support, Technical support, Regulatory Compliance.",
    "professional experience": "International Certification Program Management 07/2010 to Current Company Name City , State\nDemonstrated experience in all aspect of the International aircraft validation / acceptance process from application submittal to granting of a\nvalidated type certificate.\nLead subject matter expert on foreign regulations with regards to certification & operations.\nManaged external contract engineering design groups with regards Type Design changes.\nI developed and managed internal engineering disciplines, FAA, and foreign authority project teams during the validation process.\nDeveloped departmental procedures based on international bilateral agreements, governmental regulation and operational requirements.\nAs the IC Program Manager coordinated certification activities with internal functions and direct FAA involvement.\nDevelop certification procedures as required and reviewed company documentation to meet FAA & foreign civil aviation authority\nrequirements.\nReviewed compliance documentation, design data, Certification Plans, Compliance Reports, Drawings, wrote internal company\ncoordination memos prior to domestic and foreign government submission.\nI developed compliance packages and submitted directly to the FAA and foreign authority.\nImproved guidelines in implementing certification programs while maintaining budgetary and schedule constraints.\nEnsured compliance to multi-national agreements and regulatory frame work Experienced in US federal regulations 14CFR 61, 91, 23,\n135.\nKnowledgeable in European governmental regulations with regards to aircraft certification, and operations.\nSuccessfully obtained aircraft First of Type approvals in Europe, Mexico, New Zealand, Qatar, Malaysia, Colombia, Brazil, China, Russia,\nand Argentina.\nMaintenance & Avionics Coordinator 05/2000 to 08/2005 Company Name City , State\nDeveloped and managed maintenance and avionic customer accounts, processed invoice payments, credits and net account billing.\nPrepared maintenance/avionics invoices.\nManaged subscription based navigational data for company charter operations & customer based aircraft.\nCoordinated invoicing, account management of all maintenance and avionics repairs for a FAA 145 repair station.\nManaged pilot supplies, purchase orders, inventory control cycling of life limited products.\nEducation and Training\nBachelor of Science : Professional Aeronautics 2009 Embry-Riddle Aeronautical University\nMinors: Aviation Safety, Management, International Relations\nAssociate of Arts : Liberal Arts 2004 Johnson Country Community College City , State\nProfessional Aeronautics 1999 Spartan School of Aeronautics City\nAffiliations\nProfessional Associate of Dive Instructors, Aircraft Owners and Pilots Association, Embry-Riddle Aeronautical University Alumni, Cherokee\nFlyers, Inc.(President, Vice President, Director of Membership, Assist. Treasurer), Civil Air patrol.",
    "certifications": "FAA Certificated Commercial/Instrument Pilot - Single-Engine Airplane, PADI Certified Dive Master."
  }
}