{
  "file_name": "27835351.pdf",
  "sections": {
    "general": "MAINTENANCE, HOMECONSTRUCTION",
    "summary": "Hardworking Maintenance/Handy Man brings over 5+ years of experience in Maintenance industry to worksite. Resourceful experience handling\nmaterials, operating machinery and supporting overall team and project needs. In-depth knowledge of compliance mandates governing site and\nworker safety. Singularly focused on helping crews complete skilled work under deadlines.",
    "skills": "Forklift driving\nEquipment repair\nCodes compliance\nConstruction trade expertise\nStandard operating procedures understanding\nFlooring Installation\nBasic welding skills\nFraming\nPower and hand tool use\nConstruction\nUnderstanding schematics\nCarpentry\nMechanical Repair\nCoordination\nTroubleshooting strength\nMultitasking\nHand tool operations\nMaintenance & Repair\nOrganizational ability\nTraining & Development\nMaintenance scheduling\nFriendly, positive attitude\nMechanical aptitude\nPeople skills\nSystem installations\nFlexible\nEquipment maintenance\nBasic math\nSafety-oriented mindset\nConflict resolution\nMaterials handling",
    "experience": "Company Name | City , State Maintenance, Home Construction 08/2020 - Current\nDiagnosed problems with mechanical and electrical systems and equipment using advanced troubleshooting abilities.\nPerformed performance and safety inspections on equipment and machinery to maintain operational baseline.\nChanged HVAC filters and cleaned condensation drains to perform preventative maintenance on HVAC systems.\nMaintained facility interior, including shampooing carpets, washing walls, waxing and stripping floors and dusting furniture and fixtures.\nUsed electrical drawings to troubleshoot and repair electro-mechanical and other systems.\nFramed new construction of single-family homes and townhomes.\nCompleted indoor and outdoor residential and commercial construction projects.\nCut roofing paper to size and nailed and stapled paper to roof in overlapping strips to form base for roofing materials.\nMopped and poured hot asphalt and tar onto roof base while applying asphalt and tar and gravel to roof.\nResolved both technical and contractual issues in constructive, positive manner.\nShaped materials to exact measurements for job requirements using hand tools and power equipment.\nExamined buildings and project specifications to determine measurements and dimensions.\nInstalled building structures such as windows, trim and cabinetry alone or with assistants to meet job deadlines.\nOperated terrain telescoping forklift, backhoe, skid steer and tractor.\nPrepared, cut and installed custom cabinetry, built-in bookcases and staircases.\nSelected lumber based on particular species, characteristics, size, applications and applicable adhesives.\nSet windows and layouts for stairs and common rafters.\nCut and installed tile and hardwood flooring for over 6 residential and commercial buildings.\nInstalled cabinets, base cabinets and crown molding.\nWorked independently on projects and tasks within 1-person carpentry team.\nSafely operated power saws, planers, jointers, routers and pneumatic equipment for 365+ days without accident.\nCut timber, panels and other wooden materials according to measured dimensions.\nInstalled floor joists, trusses and rafters.\nConsistently constructed square and level projects.\nSafely used band, circular, jig, reciprocating, chop and compound miter saws.\nCompany Name | City , State Maintenance Technician 01/2018 - 08/2020\nCollaborated with building managers to assess ongoing needs and plan preventive maintenance schedules.\nDiagnosed problems with mechanical and electrical systems and equipment using advanced troubleshooting abilities.\nExecuted daily operations of preventive maintenance on electrical panels, motor controls and switch gears.\nPerformed performance and safety inspections on equipment and machinery to maintain operational baseline.\nReplaced wall sockets, ran lines and completed basic carpentry to finish installations.\nInstalled new systems, replacement parts and components to maintain proper operation.\nMaintained compliance with internal and regulatory safety standards, including OSHA.\nRoutinely inspected equipment for preventive and emergency maintenance needs.\nChanged HVAC filters and cleaned condensation drains to perform preventative maintenance on HVAC systems.\nAssessed system operations to identify potential areas requiring maintenance services.\nCarried out repair work on food grade equipment, typically returning machines and tools to service within 1-2 hours.\nInspected electrical components to identify defects and hazards and make necessary adjustments.\nCompany Name | City , State RV Technician 01/2017 - 01/2018\nManaged shop jobs to complete work orders on time and keep tasks prioritized.\nDocumented diagnostic testing and repair work to maintain accurate records on all vehicles.\nPerformed electrical, plumbing, carpentry and appliance maintenance.\nConducted troubleshooting tasks to diagnose issues and determine appropriate fixes.\nReconstructed floors, walls and roofs to repair damage such as flooding.\nInstalled and repaired plumbing, including water lines, drains and fixtures.\nTested and troubleshot equipment to locate source of problems and develop correction plans.\nUsed caulking compounds and piping to repair gas lines for safe RV operation.\nRead work orders to understand and plan for specific service needs of different customers and RVs.\nInstalled water heaters, furnaces and other equipment in RVs.\nCompany Name | City , State Roofer, Plywood, Door Hanger 02/2015 - 01/2017\nPerformed quality work in alignment with company procedures and values.\nRead and interpreted blueprints to effectively plan and execute projects.\nImproved knowledge and productivity through continuous education and learning from foreman and senior assemblers.\nAssembled building material components, including wall panels and roof and floor trusses.\nInstalled heat trace tape to tubing and controls and bent large tubing with power bender.\nInserted and positioned materials and clamped, spliced and fitted parts using hand and power tools.\nEducation and Training\nNorthridge High School | City High School Diploma 06/2009"
  }
}