{
  "file_name": "27847081.pdf",
  "sections": {
    "general": "HR SPECIALIST/ HORIZONTAL ENGINEER\nProfessional Summary\nPassionate HR Specialist with over 10 years' extensive experience in completing reference checks, preliminary phone interviews, job advertisement\npreparation, recruitment assistance and the like. Highly skilled in performing human resource and/or clerical functions for personnel matters\nimpacting business decisions. Extremely proficient in creating, managing and administering HR systems, aligning policies and procedures with\ncompliance laws. Proven record of maintaining department's data integrity. Possess positive attitude, strong organizational skills and attention to\ndetail with accuracy.",
    "skills": "administrative support, agency, charts, closing, coaching, communication skills, Interpersonal Skills, Oral Communication, copying, clients,\nCustomer Service, data analysis, database, Detail-Oriented, email, Employee relations, employee training, Engineer, filing, financial, Government,\ngraphs, hiring, Human Resource, HR, interpretation, macros, meetings, Excel, Outlook, PowerPoint, Word, Works, Multi-Tasking, organizational,\nPayroll, Performance management, personnel, presentations, processes, progress, project plans, proposals, quality, Read, recruiting, recruitment,\nreporting, SAP, shipping, Staffing, supervisor, telephone, Time Management, Writing Skills\nAdditional Information\nAwards/Recognition Received a Promotion for doing an outstanding job in the company. 2011 Received recognition for being for pushing\nout product in the company. 2012 Received $100 gift card weekly for having the highest production for the week. 2012\nAccomplishments\nProcess Improvement\nCreated new departmental procedures manual.\nAssessed organizational training needs.\nSupervision\nSupervised team with over 100 staff members.Â\nCreative Problem Solving:\nResolved product issue through consumer testing.\nComputer Proficiency\nUsed Microsoft Excel to develop inventory tracking spreadsheets.",
    "education": "Bachelor of Science : Business Administrattion , 2018\nGrantham University - City\nGPA: 3.7\nCoursework in Speech and Communication, Sociology and Psychology\nCoursework in Professional Prospecting Skills\nCERTIFICATION : HUMAN RESOURCE , 2008\nAIT - City"
  }
}