{
  "file_name": "27902692.pdf",
  "sections": {
    "general": "NETWORK ADMINISTRATOR",
    "summary": "Analytical Network Administrator adept at resolving complex network issues. Critical thinker who addresses customer support issues quickly and\nwho consistently exceeds performance standards.\nHighlights\nExceptional\ntelephone\netiquette\nServer administration, Technical documentation, Network security, Network management, Data backups, Disaster\nPatient and\nrecovery, Project Management, LAN Knowledge, Proxy Servers, Networking Knowledge, Network Design and\ndiligent\nImplementation, Network Troubleshooting, Network Hardware Configuration, Network Performance Tuning Microsoft\nTroubleshooting\nOffice expert\nproficiency\nMicrosoft Certified Solutions Associate (MCSA) Certificate\nWindows\nDHCP/DNS Ethernet and Firewall proficient\nXP/Vista\nMS Office proficiency\nProficient in\nMicrosoft Certified Solutions Associate (MCSA): [Name of Microsoft technology]\nAVG, Printers,\nMicrosoft Certified Technology Specialist (MCTS): [Name of Microsoft technology]\nPC Security\nsystems\nAccomplishments\nExceeded monthly goals by successfully handling more than 80 trouble tickets per week.",
    "experience": "Network Administrator Feb 2006 to Mar 2016\nCompany Name\nEstablishes networking environment by designing system configuration; directing system installation; defining, documenting, and enforcing system\nstandards.\nMaximizes network performance by monitoring performance; troubleshooting network problems and outages; scheduling upgrades; collaborating\nwith network architects on network optimization.\nSecures network system by establishing and enforcing policies; defining and monitoring access.\nReporting network operational status by gathering, prioritizing information; managing projects.\nMaximizing corporate network services uptime.\nGiving over the phone, email and remote support to customers.\nImplementing network security measures to protect data, software, and hardware.\nUtilizes Active Directory to manage user accounts, create groups, and computer accounts Administering a Microsoft Windows Server network of\nservers.\nInvestigating problems and then making technical recommendations.\nResolving network operational issues.\nInstalling and testing server software on a variety of platforms.\nProfessional Accomplishment: Successfully migrated users and computers from Novell NetWare to Microsoft Active Directory Successfully\nupgraded Windows Server 2003 Server to Server 2008 Successfully upgraded Windows Server 2008 Server to Server 2012 Successfully\nupgraded network infrastructure and configured Cisco 2950 switches for 66 Federal Contract Towers in the State of Florida Successfully\nmigrated Computers and users from windows XP to Windows 7.\nResolved customer complaints and concerns with strong verbal and negotiation skills. Trained new employees and explained protocols clearly and\nefficiently. .\nTroubleshot hardware issues and worked with service providers to facilitate repairs.\nCreated new account, reset passwords and configured access for users. Troubleshot hardware issues and worked with service providers to\nfacilitate repairs. Developed documentation for common processes for both support staff and end-users.",
    "education": "Computer Information System /Network Engineering Barry University\nProject Management Professional Florida Atlantic University\nSix sigma GreenBelt Florida Atlantic University",
    "certifications": "Microsoft Certified Systems Administrator Microsoft Certified Systems Engineer Microsoft Certified Technology Specialist ITIL Foundation V3\nCertified Comptia A+ Certification",
    "skills": "A+ Certification, Active Directory, Cisco, hardware, designing, directing, Disaster recovery, email, ITIL, LAN, managing, access, Microsoft\nCertified, Microsoft Certified Systems Engineer, Windows 7, Microsoft Windows, windows XP, Network Administrator, Network management,\nNetwork Hardware, Network Design and Implementation, Network security, Network Troubleshooting, Network, Networking, Novell\nNetWare, optimization, policies, Project Management, Proxy, Reporting, scheduling, Servers, Six Sigma, switches, system configuration,\nTechnical documentation, phone, troubleshooting, upgrades, Windows Server"
  }
}