{
  "file_name": "28206098.pdf",
  "sections": {
    "general": "CUSTOMER ADVOCATE\nCareer Overview\nEnthusiastic customer service/telesales representative with in-depth knowledge of sales, account management and training. I have over 15 years of\nexperience in retail, real estate, medical, insurance and sales customer service.\nCore Strengths\nStrong organizational skills\nSeasoned in conflict resolution\nSharp problem solver Invoice processing\nEnergetic work attitude Adaptive team player\nLarge cash/check deposits expert Telecommunication skills\nCustomer service expert\nTelephone inquiries specialist\nAccomplishments\nCustomer Assistance Â\nWorked with company systems such as Live Support and diligently completed all assigned tasks, working overtime as needed.\nQuality Communication Â\nInteracted with 50+ affiliate stations in US and Puerto Rico, ensuring reliable and high-speed delivery to residential and small-business\ncustomers.\nComputed Data Reports Â\nProvided required weekly, monthly and quarterly reports listing sales figures and client track records.\nSales Â\nConsistently generated additional revenue through skilled sales techniques.\nCustomer Service Â\nResearched, calmed and rapidly resolved client conflicts to prevent loss of key accounts.\nMulti-tasking Â\nCashiered with two cash registers at once in tandem to maximize customer flow.\nDatabase Maintenance Â\nAssisted in the managing of the company database and verified, edited and modified members' information.",
    "work experience": "CUSTOMER ADVOCATE\nMarch 2010 to January 2011 Company Name ï¼​ City , State\nResponsible for working on the phone all day in a call center to assist members and physicians by responding to telephone and written\ninquiries in a prompt, accurate and objective manner * Spending approximately 90% of the scheduled time on the phone according to\nbusiness need,customer service* Experience working with various lines of business, i.e.\nCDHP, Medicare, Wellness, and Disease ManagementDuties include Medical Claims Billing & Coding, Medical Benefit Quotes*\nConducting research,as well as a vast knowledge of medical terminology and anatomy* Data entry and typing * Interpersonal, verbal and\nwritten communication skills.* Analytical and organizational skills and independent decision making skills.\nCUSTOMER SERVICE AGENT\nMarch 2002 to September 2002 Company Name ï¼​ City , State\nGreet and check-in passengers* Check-in passenger baggage* Assist passengers with misplaced baggage* Verify passenger departure\ndocumentation* Assist unaccompanied minors (UMs)* Comply with all security requirements* Reschedule passengers with flight\ninterruptions* Assist passengers on arriving international flights* Documentation for all international departures* Produce all required, work-\nrelated documentation* Monitors (CRTs) and keyboards for passenger processing (carrier supplied)* Carrier specific reservation/ticketing\nsoftware * scales for weighing passenger baggage * Ticket and baggage tag printing equipment.\nPATIENT CARE ASSISTANT TECHNICIAN\nOctober 2000 to December 2000 Company Name ï¼​ City , State\nProvide basic patient care including Assisting with patient care, planning and assessments including - recording vital signs, height, weight,\nProvide basic patient care including Assisting with patient care, planning and assessments including - recording vital signs, height, weight,\ninput output, collect and test specimens, report and record patient's condition and patient treatments.* Check deliver food trays, assist with\nfeeding the patient if necessary, and refill water and ice* Assist patients with their mobility - turn and positioning, do range of motion\nexercises, transferring patients to and from wheelchair, assist with ambulation* Discontinuation of IV's, Clean and Irrigate lacerations Set up\nRapid Infuser, Heptafiler Setup* Answer phones * Locate equipment * Transport Non Critical Patients and Assist with Critical Patients*\nFoley Catheters Dressing Changes and Feed patients assist with Comfort Measures / Safety Measures* Attend to the Psyche patients and\nEscort patients to treatment areas, Clean Rooms, Collect specimens, Chest Tube Setups Relieve MR's, Clinitech Documentation and\ncollection Change Sharp boxes and O2's * Decontamination procedures * EKG's, Assist with O2 delivery, Clean Instruments and Post-\nMortem Care* Copy charts for admissions Splint Assistance, Suction, Crutch Walking Instructions and Adjustments take Vital Signs *\nAssist with Pelvic Exams perform Phlebotomy.\nEducational Background\nPatient Care , 10/2000 Maric College ï¼​ City , State , USA GPA: GPA: 3.0 GPA: 3.5\nGPA: 3.0 GPA: 3.5\nCum LaudeRelevant Coursework, Licenses and Certifications:PATIENT CARE ASSISTANT TECHNICIAN / CERTIFIED NURSES\nASSISTANT : Paraleglal , 2004 Penn Foster ï¼​ City , State , USA",
    "skills": "anatomy, basic, Billing, call center, charts, Interpersonal, CA, customer service, Data entry, decision making, delivery, Documentation, EKG's,\nmedical terminology, Monitors, organizational skills, Paralegal, Assist patients, PATIENT CARE, Phlebotomy, positioning, Coding, range of\nmotion, research, Safety, SAN, Collect specimens, TECHNICIAN, telephone, phone, Answer phones, typing, take Vital Signs, recording vital\nsigns, weighing, written, written communication skillsProfessional and friendlyCareful and active listenerStrong public speakerMulti-tasking"
  }
}