{
  "file_name": "28243590.pdf",
  "sections": {
    "general": "CONSULTANT",
    "summary": "Over 20 years experience working with IFC on many sectors - oil and gas, mining, renewable energy and",
    "skills": "accounting system, Bulgarian, Consulting, client, Database, equity, Senior Management, Finance, financial statements, forecasting, German,\ngovernment, investments, migration, Russian (fluent, spread sheet, word processing",
    "experience": "Consultant , 12/1996 to Current Company Name ï¼​ City\nConducted risk and impairment analyses of IFC's portfolio of loan and equity investments and recommended to senior management the\nspecific loss reserves to cover impaired individual investments.\nAnalyzed financial statements of client companies and coordinated with Investment Officers to validate information from IFC files.\nParticipated in the development of a new loan loss reserve forecasting tool based on loan migration analysis.\nTook part in the preparation of the FY97 Loss Reserve Review Paper.\nParticipated in discussions on the status of investee companies with the Investment Departments.\nPrepared project status reports to external auditors.\nPolicy Analyst , 03/1991 to 07/1994 Company Name ï¼​ City\nManaged a team of seven professionals to establish and operate one of the Company's first joint ventures with the Austrian partner Berthold\n& Stempel.\nWorked on the introduction of leasing in the hotel and catering divisions of the company.\nWorked with Senior Management on the introduction of a new accounting system.\nLecturer , 01/1987 to 03/1991 Company Name\nTaught a course in Microeconomics.\nParticipated in a number of projects on companies' restructuring and regional development issues with local enterprises and government\nagencies.",
    "languages": "Bulgarian and Russian (fluent); German (working knowledge).\nEducation and Training\nMBA : Finance , November 1996 GEORGETOWN UNIVERSITY ï¼​ City , State Finance 3.67 Finance Club, Consulting Club. * SEED\n(Students for Eastern European Development) --Fund-raiser.\nMS : Economics , February 1987 Varna University School of Economics Varna Bulgaria Economics 3.85/4.00 Graduated in the top 5%. * Gold\nMedal from the Bulgarian Ministry of Education awarded for academic excellence."
  }
}