{
  "file_name": "28628090.pdf",
  "sections": {
    "general": "ENGINEERING MANAGER\nProfessional Summary\nElectrical Engineer with 20+ years of experience in semiconductors microlithography and strong project management background. Scope of work\nrequired extensive background in equipment engineering maintenance and process sustaining. Utilized experience in cross-function activities with\nother engineering, production and support organization for the completion of start-up semiconductor factory construction and equipment's.\nOutstanding communication skills in task-milestone reports provided senior level management with clear forecast of project completion. With\nadditional experience in application marketing engineering, led team of business development managers and R&D engineer to grow DUV business\nfor DOW chemical's globally from $ 300k to > $ 20 million in 3 years. Management skills Excellent leadership skills in cross-functional, team-\nbased environment, multi cultural, with the ability to effectively communicate, influence and motivate at all levels of the organization. Strong\nunderstanding of financial measurements and goals that can be directly correlated to implementation of plans. Proven ability to analyze statistics and\ntrend data with measured outcomes Dedicated Operations Manager demonstrating effective leadership in all aspects of the job. Excels at cutting\ncosts and streamlining operations. Tech-savvy Project Manager versed in all aspects of project management from inception to completion. Excels\nin recruiting and talent acquisition, as well as process reengineering and improvement. Skilled Operation Manager with solid experience managing\nall levels of multiple projects including budgeting and administration.",
    "skills": "BASIC, COBOL, FORTRAN, PASCAL, Prolith (Modeling), Power Point, Word, Excel and Lotus Notes,Statistical Analysis: JMP, DOE\n(design of experiment), PCS, SPC++, six sigma, data view, Crystal ball",
    "education": "B.S : Management information system , 1991\nWORCESTER STATE University, MASS -\nGPA: GPA: 3.1 Management information system GPA: 3.1\nB.S : Electrical engineering technology , 5 1987\nCENTRAL NEW ENGLAND COLLEGE - State\nGPA: GPA: 2.89 Electrical engineering technology GPA: 2.89 Dale Carnegie: Effective Speaking and Human Relation, 1995."
  }
}