{
  "file_name": "28745844.pdf",
  "sections": {
    "general": "ADMINISTRATIVE ASSISTANT",
    "summary": "Performance-focused leader eager to offer dynamic customer service / administrative assistance, business support, data / recordkeeping, and client\nrelations talents toward maximizing your success within a growth-oriented role. ADMINISTRATIVE OPERATIONS * ACCOUNT\nMANAGEMENT * DATA / RECORDKEEPING * BILLING / INVOICES * CUSTOMER SERVICE APPOINTMENT SCHEDULING *\nSUPPLIES ORDERING * INVENTORY CONTROL * WORK PRIORITIZATION * BUSINESS BOOKKEEPING REGULATORY\nCOMPLIANCE * MULTI-LINE TELEPHONE MANAGEMENT * PROCESS IMPROVEMENT * STRATEGIC ANALYSIS / PLANS\nIntegral team player who plans, prioritizes, and completes tasks within fast-paced environments. Excellent communicator who seamlessly interfaces\namong executives, business peers, and customers. Solutions-focused professional who offers a quick-learning nature to succeed in diverse\nbusiness areas. Ambitious self-starter who expertly handles confidential responsibilities while maintaining quality service. I am seeking a Customer\nCare Professional role, and am submitting my resume for your review. I am excited to build a rewarding career with your company, and am\nconfident that my professional skills can help to achieve your objectives. I can offer cross-functional experience in Customer Service/\nAdministrative Operations, Account Management, Data / Recordkeeping, Business Bookkeeping, Billing / Invoices, Supplies Ordering, and\nInventory Control, and am well-versed with Customer Service, Workflow Prioritization, Strategic Analysis / Planning, Process Improvement, and\nRegulatory Compliance, among other areas. To complement my background, please note that I attained a Medical Assistant Certificate from Ross\nMedical Education Center and am certified in CPR / BLS by the American Red Cross. Most recently, as an Customer Care / Administrative\nAssistant with Rollizo's Information Technology Services (RITS), I expertly performed all forward-thinking business tasks, including scheduling\nclient meetings, cost-effectively managing office and supply inventories, handling billing and data management, and providing operational support.\nAs this is just a sampling of my job history, please refer to my enclosed resume for additional experience. You will find me strict and self-\ndisciplined enough to follow precisely all company policies, and to be a solutions-driven professional who can demonstrate a track record of\norganizing complex business initiatives, defining key priorities, and meeting targeted goals. In addition, I can plan, coordinate, and complete high-\nlevel projects within fast-paced, deadline-oriented environments while streamlining processes to increase overall productivity, efficiency, and\nquality of end results. For the sum of these aforementioned reasons, I believe I will prove to be an incredible asset to your company.\nPersonal Information\nI look forward to hearing from you, and thank you in advance for your careful consideration. Sincerely, Tina L. Gayden",
    "skills": "administrative support, bookkeeping, counseling, CPR, clientele, client, clients, customer service, data entry, data management, Email, image,\nInternet Applications, managing, meetings, mentoring, Microsoft Office, office, quality, scheduling\nAdditional Information\nI look forward to hearing from you, and thank you in advance for your careful consideration. Sincerely, Tina L. Gayden",
    "experience": "Administrative Assistant\nJanuary 2012 to January 2013 Company Name ï¼​ City , State\nUtilized broad scope of industry knowledge and dynamic customer service and administrative support acumen toward performing forward-\nthinking business tasks, including scheduling client meetings, cost-effectively managing office and supply inventories, handling tense client\nrelated issues and data management, and providing operational support.\nAdvocate / Medical Assistant\nJanuary 2010 to January 2011 Company Name ï¼​ City , State\nStrategically steered confidential patient pregnancy testing services, including objectively counseling and mentoring clients per individual\nneeds, as well as accurately maintaining all client records and medical files.\nOptimized operations efficiency by performing key data entry, bookkeeping, and appointment scheduling.\nHome Healthcare Aide\nJanuary 2007 to January 2012 Company Name ï¼​ City , State\nCultivated a high-quality business image with superior services by exceeding home healthcare standards, including completing errands and\ntransporting clients to appointments, as well as performing housekeeping.\nHome Healthcare Aide\nJanuary 2007 to January 2008 Company Name ï¼​ City , State\nPlayed a vital role in performing routine housekeeping duties (e.g.\nwashing dishes / clothes, making beds) for diverse clientele, including participating in frequent grocery shopping excursions per individual\nclient needs.",
    "education": "Medical Assistant Certificate ROSS MEDICAL EDUCATION CENTER CPR / BLS Certification - American Red Cross Microsoft Office *\nEmail / Internet Applications"
  }
}