{
  "file_name": "28895997.pdf",
  "sections": {
    "general": "BRANCH BANKER",
    "summary": "Secure a position that will utilize my strong communication and organizational skills, customer service background and ability to work well with\npeople.",
    "skills": "Book, coach, customer service, Detail oriented, documentation, financial, meetings, Excel, Microsoft Word, policies, retail, selling, sales",
    "experience": "07/2004 to Current\nBranch Banker Company Name ï¼​ City , State\nProvide exceptional customer service to all business and retail customers Understand financial needs of customers while building and\ndeepening relationships Open and service customer accounts in an efficient and professional manner Actively participate in outbound sales\nefforts to expand customer base Prepare and participate in weekly team sales meetings and daily huddles Loan Officer-Applications,\nSubmissions, Customer documentation, Close, Book.\n06/2003 to 07/2004\nBranch Supervisor Company Name ï¼​ City , State\nManaged and coach team while maintaining workforce stability by insuring knowledge of bank products, procedures, and polices Managed\ndaily branch operations including but not limited to cash standards, regulations, compliance and weekly, monthly, quarterly, and annual\naudits Understand financial needs of customers while building and deepening relationships by cross-selling bank products and services\nDevelop and expand new and existing consumer and commercial accounts.\n10/1986 to 09/1998\nRetail Banking Officer Company Name ï¼​ City , State\nOversee Branch operations and manage teller staff to ensure following bank's policies and procedures Open and service customer accounts\nin an efficient and professional manner Provide exceptional customer service to consumer and commercial customers Identify and refer\nprospects to business partners Loan Officer-Applications, Submissions, Customer documentation, Close, Book.\nEducation and Training\nDiploma Hammonton High School ï¼​ City , State"
  }
}