{
  "file_name": "29149998.pdf",
  "sections": {
    "general": "HR ASSISTANT",
    "summary": "Highly motivated, and a dynamic Human Resources professional with diverse credentials seeking a position with a growing organization to make a\npositive impact on company policies, and experience career growth. Accomplished human resources and administrative professional with over 3\nyears' experience. Attentive to detail, able to take initiative, prioritize multiple tasks and manage workload. Resourceful team player with a can-do\nattitude. Results-driven with strong communication, analytical, and interpersonal skills while maintain the utmost confidentiality.\nHighlights\nCompensation knowledge\nMS Office Suite\nAR/AP proficiency\nOracle knowledge\nGreat communication skills\nGreat analytical skills *New Hire Training\nFiling & Records Management\nSpreadsheets/Reports\nOffice Management\nCustomer Service\nQuickBooks, Peachtree\nNew Hire paperwork",
    "experience": "03/2016 to Current\nCompany Name ï¼​ City , State\nSourced, recruited for call center to all departments throughout the company.\nResponsible for finding the right candidates and matching them to temporary or permanent job placement for the company.\nMaintaining computer system by updating and entering data in BrassRing an responsible for complete on boarding and exit interview\npaperwork.\nCompiling reports and spreadsheets in order to keep track of drug test and background checks that are completed for on-boarding\nprocess.\nComplete initial phone interviews to evaluate applicants' qualifications.\nScheduling job interviews for field managers after seeing that applicant meet the job requirements.\nAdminister and manage scores tests given to applicants before making the job offer.\nHelp organize job fair and manage files for applicants that are not qualified.\nCircle K -Naples, FL Provides convenient services to the community.\n02/2011 to 10/2014\nHR Assistant\nMaintained employee compensation, benefits, PTO, timecards and promotion opportunities.\nExplained and held trainings for new and existing employees on benefit programs and company rules and regulations.\nManaged Background Checks from ordering paperwork to documenting results in the system.\nRequested and completed spreadsheet for drug tests results.\nManaged internal Human Resources records for two stores and oversaw all investigations and disciplinary actions.\nCompleted exit interview paperwork.\nManaged and processed time card for payroll processing by manager in a timely manner.\nProcessed new hire paperwork, completed on-boarding process and managed their records.\nInvolved in hiring process by coordinating job posting on the website, reviewing resumes, and performing telephone interviews and\nreference checks.\nFurther developed strong communication and customer service skills as result of working with clients.\n01/2007 to 01/2010\nAR/AP Representative Company Name ï¼​ City , State\nLeading orthopedic medical device company Processed invoices and credit memos in accurate in timely manner.\nReview documents for product returns and loaner fees.\nSolveed incorrect billing, back up cash applications.\nMade collection calls to clients periodically Lien, Waiver and NTO.\nProcessed invoice through payment cycle.\nInsured that all venders are paid in a timely manner.\nReconciliation of vendors.\nManaged vendor/supplier relations; and oversaw the timely, accurate processing of invoices, purchase orders, expense reports, credit\nmemos and payment transactions.\n01/2004 to 01/2007\nOffice Assistant Company Name ï¼​ City , State\nElectrical company Updated the database with customer calls.\nWorked with NTO vender helped with reconciliation and ledger Balanced and transmitted daily revenue.\nAR/AP Filling lien, waiver and managed collection.\nCoordinated complex travel schedules, accommodations and trip logistics for candidates.\nEntered personnel and subcontractor data into a central database.\nEvaluated timecards for accuracy on the regular and overtime hours.",
    "education": "Associates of Science : Human resources and Organizational Leadership RASMUSSEN COLLEGE ï¼​ City , State Human resources and\nOrganizational Leadership\n06/2016\nAdministration leadership, Communications in your profession, Accounting, Employment Laws, Human resources 1 and Organizational\nDevelopment. Member of Society for Human Resource Management (SHRM) PHR certificate after graduation Volunteer Work to mentor kids\nand young adults to succeed in their school or career path Score seminar on Human Resources -\"How to Hire Smart\" Rasmussen College",
    "skills": "Accounting, ADP, analytical skills, AP, AR, Benefits, billing, Call center, Great communication skills, Interpersonal skills, credit, clients, Customer\nService, customer service skills, database, Detail-oriented, Employee Relations, expense reports, Filling, Filing, hiring, Human Resource\nManagement, Human Resources, Human resources 1, processing of invoices, leadership, ledger, logistics, mentor, MS Office Suite, Office\nManagement, Oracle, Organizational Development, payroll processing, Peachtree, personnel, promotion, QuickBooks, Recruitment, Scheduling,\nSpreadsheets, spreadsheet, telephone, phone, website"
  }
}