{
  "file_name": "29165698.pdf",
  "sections": {
    "general": "GENERAL MANAGER",
    "summary": "Dedicated enthusiast with years of experience in sports, health, and fitness related settings. Passionate about helping others set and reach their\ngoals in a wide variety of ways. Respected builder and leader of customer-focused teams who are committed to providing superior customer\nservice. Lead by example and ensure the execution of all safety, security, quality and company operation policies.",
    "experience": "January 2015 to November 2015 Company Name ï¼​ City , State\nGeneral Manager\nMarch 2015 to November 2015\nAssistant Manager\nJanuary 2015 to March 2015\nPromoted to manager position to recruit, hire, train and develop a high performing staff consisting of Assistant Managers, Member Service\nRepresentatives, Trainers and Custodians.\nResponsible for the oversight of gym operations to ensure an exceptional \"Judgement Free\" member experience as well as a financially\nsuccessful club.\nAccountable for leading a team of employees in a positive, motivating manner with continuous assistance in employee training and\ndevelopment.\nCreated and maintained a welcoming atmosphere for all members, prospective members and guests and ensured staff followed superior\ncustomer service guidelines.\nManaged marketing efforts by ensuring that the staff was aware and trained on all marketing promotions.\nTracked statistics and reports (weekly, monthly, annually).\nPrepared all HR related forms and sent to Corporate Payroll Team Ordered supplies using specific budget based on club requirements.\nDRxD Pharmacy Associate\nDecember 2013 to October 2014 Company Name ï¼​ City , State\nResponsible for the presentation & coordination of the bedside discharge medication delivery program for assigned.\nunits/services & patients, with reporting responsibility to the Integration Manager or Coordinator.\nFor patients accepting DRxD program, ensured patient enrollment, bedside delivery of medications & successful completion of program\nrequirements at discharge.\nEffectively collaborated and worked in concert with other DRxD associates and pharmacy personnel to ensure successful delivery of the\nprogram.",
    "education": "BS : Kinesiology , 12/12 University of Montevallo ï¼​ City , State Kinesiology Completed numerous courses in sports, health, and fitness with\nconcentration in health promotion.\nFirst Aid/CPR/AED Certified",
    "skills": "budget, Conflict Resolution, CPR, Customer Service, delivery, employee training, First Aid, forms, health promotion, HR, Leadership,\nTeambuilding, marketing, Multi-tasking, Payroll, personnel, reporting, statistics, Supervision, Time Management"
  }
}