{
  "file_name": "29415426.pdf",
  "sections": {
    "general": "CLIENT ADVOCATE / ESCALATION SPECIALIST",
    "summary": "Experienced with over 10 years in high-level executive support roles. Organized, professional, and committed to delivering high quality results with\nlittle supervision.Â Jack of all trades and wearer of many hats.\nHighlights\nResults-oriented Dedicated team player\nSelf-directed Strong interpersonal skills\nStrong problem solver Microsoft Office proficiency",
    "experience": "Client Advocate / Escalation Specialist Nov 2015 to May 2016\nCompany Name - City , State\nTakeover of escalated calls from customer service\nCoached customer service representatives to improve skills\nBusiness Manager, HR Coordinator, Training Coordinator, Receptionist Jun 2008 to Oct 2015\nCompany Name - City , State\nManaged administrative, accounting, financial, and purchasing functions for the office and the individuals supported\nAssisted with recruiting and orientating new employees\nPerformed bi-weekly payroll, reconciled payroll, created payroll reports used for budgeting and to adjust staffing\nManaged and audited employee personnel and training files\nMaintained employee training database and ensured employees were current in training\nPurchased office and janitorial supplies\nActed as receptionist and managed a multi-line telephone system\nRecords Management / Document Management System Implementer Jan 2007 to Nov 2007\nCompany Name - City , State\nAssisted in building a DMS library that fit the global model for the site\nAssisted with department and site-wide document audits\nTelerecruiter Feb 2005 to Jun 2005\nCompany Name - City , State\nContacted blood donors, scheduled future appointments, and updated contact information.\nTrained new telerecruiters.\nStudent Administrative Assistant Vice Chancellor Sep 2001 to Sep 2004\nCompany Name - City , State\nIndependently created database and audited university resident alien files in university's HR department during free time, which saved the\nuniversity a minimum of $200,000 in potential fines\nManaged the university's utilities, legal bills, and contract database\nCreated and maintained database for university's Business Travel Account",
    "education": "Bachelor of Arts , Political Science Pre-Law 2017 University of New Orleans - City , State\nClasses are online and will not interfere with work.\nCertificate , Paralegal 2016 East Tennessee University - City , State",
    "skills": "Strong clerical, management, and administrative skills\nMicrosoft Office\nCustomer service"
  }
}