{
  "file_name": "29524570.pdf",
  "sections": {
    "general": "WEB DESIGNER\nProfessional Summary\nTrained Quality Assurance Specialist with a demonstrated history of working in the pharmaceuticals industry. Skilled in Risk Assessment,\nRegulatory summary writings, Documentation, Quality Assurance, Quality System, and Data Analysis. Strong quality assurance professional with a\nMasters in Computer Science and Bachelors in Electronics.",
    "skills": "ASP.NET, Adobe Acrobat, Dream Weaver, API, ASP, basic, C, C language, C++, Clinical Research, Controller, CSS3, Client, Data\nManagement, Data Base, Database, Database management, Digital Video, Editor, Embedded C, Embedded System, computer graphics, HTML,\nHTML5, Logic, Access 2000, C#, Excel, Exchange, Office, power point, MS Word, works, NHS Trust, Oracle 9, ORACLE, ORACLE8.0,\nPLSQL, Page, PLC, programming, quality, recording, research, risk analysis, risk assessment, scheduling, Simulation, SQL, System Design, Visio,\nVisual basics, Visual Basic 6.0, Visual Basic6.0, Web designer, website, Web designing, Author",
    "education": "Masters : Computer Application , Computer Application\nMCA : CMR Institute of Management studies, University of Banglore, INDIA. P.G -\nTitle :Green House Controller, Platform: Embedded C - CX15, Client: NeSt Cyber Campus, Trivandrum, Kerala, India . Including 6 months\ntraining. Mini projects: Data Base Management Systems: Airline Reservation- Visual Basic6.0 and SQL. Information System Design and\nImplementation : Employment Exchange -Visual Basic 6.0 and ORACLE8.0 Simulation and Modelling : Chemical Reactor developed by C.\nInteractive computer graphics: Galixean Game using C++ language. System programming : Editor developed in C including all basic requirements\nof an editor. Computer Architecture and Parallel Processing : Page Replacement Algorithms developed in language C.\nC P U scheduling graph developed in C language. :\nBachelor : Electronics (BSc) , 1999\nElectronics (BSc)\nDigital Video graphy Other courses Data Management for Clinical Research , Vanderbilt University. Oracle 9i SQL/PLSQL training with Oracle\nCertified Associate, at Caledonian University, Glasgow Embedded System with CX15 (Keil Compiler) (6-months training from Nest\nCybercampus : Mahatma Ghandhi University - City , State\nDesign of a PLC (Program Logic Controller) based on control system for automatic connector assembling machine .\nDatabase management - Visual basics, Oracle, SQL, Access 2000 ( Pentasoft, India) Web designing- ASP, HTML, Dream Weaver (Pentasoft,\nIndia) ECDL Certification and SQA qualification- Flexicentre Glasgow :"
  }
}