{
  "file_name": "29746235.pdf",
  "sections": {
    "general": "SECURITY AIDE I\nProfessional Summary\nA Compassionate Security Aide that has strong experience working with developmentally disabled adults and creating individualized recreational\nplans to assist them with community integration.",
    "skills": "Academic, administrative, clerical, Coaching, CPR, data entry, laboratory equipment management skills, excel, reading, Rehabilitation, Reporting,\nresearch, Safety, sound, spread sheet.",
    "education": "Bachelor of Science : Wellness-Kinesiology , 05/2017\nLincoln University - City , State\nWellness-Kinesiology\nDiploma : Coaching , 2013\nGC Foster College of Physical Education and Sports - City\nCoaching Completed 70 Credit hours in physical education and sports, GC Foster College of Physical Education and Sports Spanish Town,\nJamaica\nINTERNSHIPPhysiotherapist Rehabilitation, Athletic Trainers Room : 12/2015\nLincoln University - City , State\nSet up equipment for students athletes*Assisted in treatment for students athletes *Treatments include wrapping and taping ankles, applying ice\npacks and conducting on ultra sound treatments.\nShadow/Intern of Occupational Therapist and Physiotherapist rehabilitation Treatments , 12/2017\nJCMG Orthopaedic Center - City\nOverseer",
    "objective": "To obtain a position as Recreational Therapist where I can maximize my skills and also contribute to the development of the organization.\nAccomplishments\nTrack and Field, Team Member 2014 – 2017\nNCAA Track and Field Outdoors, All American Award 2014\nNCAA Track and Field Indoor Second Team, All American Awards 2015 - 2017\nNCAA All Academics Awards 2014 – 2017\nThe National Consortium for Academic and sport Award 2015\nLincoln University Track and Field Award 2015\nAll-MIAA First Team Award 2016-2017",
    "certifications": "CPR Certificate 2017\nBasic Psychiatric Training Course Certificate 2017\nLincoln University School of Education Honors Convocation Certificate of Excellence 2017\nAdditional Information\nVOLUNTEER WORK Officiate at Jefferson City High School Cross Country Meet LU Homecoming Parade MANRRS Recycling Club,\nconducts recycling weekly throughout the University campus Volunteer Track Coach at Old Harbour High School Volunteer Massage\nTherapy Treatment to Old Harbour High School Track Team"
  }
}