{
  "file_name": "29775391.pdf",
  "sections": {
    "general": "EXÉCUTIVE BANQUETTE SOUS CHEF\nProfessional Summary\nInterested in: permanent full time, specialized in banquettes operations such as big and small events, ceremony's, massive functions, banquettes\ndesigns. High skilled baking, pastry's, roasting, cooking, grilling, cold larder etc, garnishing, tasting, customer service. Experienced on all sections,\nall type of venues, cuisines, food service. Over 14 years of experience in the hospitality industry. Major experience in events, functions, catering,\nweddings, conventions, corporate occasions etc. Accomplished Chef with strong combination of culinary experience and management skills.\nExperience in high pressure kitchen environment, ensuring that the standards of hygiene are maintained & improved where possible. Ensuring\nexcellent standard of food consistency. Demonstrated continuous commitment to reducing food & labour costs. Trained employees in food\npreparation procedures in line with high end establishment standards. A fast learner, flexible, highly motivated, capable of operating independently\nor as a willing and supportive member of a team. Get the job done. Energetic culinary professional with a blend of creativity, passion for food and\nexceptional cooking skills. Works well as a dynamic leader in high-pressure settings. Expert in managing kitchen staff and preparing foods at\nreduced cost without compromising quality and taste. Motivated banquette sous chef offering over 13 years experience in the food industry.\nFocused on high standards for taste and quality, while maintaining profitable margins. Superior communication and leadership skills.",
    "skills": "Fluent in English, Hebrew, interior design, Languages, letters, organizing, speaker, quality, requirement, strategy, trainer, written\nAdditional Information\nSchedule Create and implement menus Liaise with suppliers Work within budgeted guidelines Select, train and motivate the kitchen brigade\nEnsure profitability Oversee all aspects of food preparation and production in the outlets\nAn innovative and logical thinker, with a sharp cooking mind Excellent interpersonal and communication skills, complementing the ability to\nbuild relationships across cultural boundaries Good organizational and time management skills, able to prioritize multiple tasks and meet\ndeadlines Ambitious and focused with a 'can do' attitude, and a strong work ethic Interests Swimming, tennis, gym, travel, cooking &\nexploring new cuisines Music & writing",
    "education": "Diploma : 2009 academia international - City , State\nCulinary Arts Certificate\nCoursework in Culinary and Restaurant Management\nCoursework in Hospitality Management\nFood Services Technology classes\nBasic Vocational Certificate: Bakery Assistant\nBasic Vocational Certificate: Lead Baker\nBasic Vocational Certificate: First Cook\nCoursework in Professional Cooking and Baking\nCoursework in Hotel Management and Restaurant Food Service\nCoursework in Hotel Administration\nCoursework in Business Administration and Management\nCulinary Arts coursework\nHotel and Restaurant Administration coursework\nCoursework in Sales and Marketing Management\nFood Systems Management coursework\nCertified Nutrition Consultant\nPersonal Training certificate\nAdvanced coursework in Food Systems Management\nExtensively trained in Pediatric Feeding and Nutrition\nHospitality Management, hotels, tourism and food services. specialization in commercial cookery, Academia International Melbourne, Australia.\ncertificate 4 & 5. OH&S Short course in - Food Garnishing -Specialty Knives Banquet interior design, major in business and private conventions.\nResponsible service of alcohol Australia certificate (RSA) : 1 2004 Shalon Secondary College - City"
  }
}