{
  "file_name": "30128072.pdf",
  "sections": {
    "general": "INTERN\nHighlights\nMicrosoft Office and Stata programs",
    "experience": "Intern\nJune 2014 to August 2014 Company Name - City\nAssisted lawyers in their cases paperwork and legal documents.\nTranscribed court notes and minutes,.\nmanaged schedules.\nAttended to local courts with lawyers to evaluate legal proceedings.\nHoet, Pelaez, Castillo y Linares Law Firm.\nIntern\nMay 2013 to August 2013 City\nOrganized documentation for legal filings and procedures for lawyers and their cases.\nCollaborated with.\nseveral of the associates by going to local courts and following their assigned cases.\nMay 2015 to August 2015 Company Name - City , State\nPerformed deli servings, event organization, inventory control, and new staff training.\nAccomplishments\nActive member of the Latin American Association at Boston University (LatAm) 2015-Present Basic Training of the Israeli Army Sept\n2013-Dec 2013 Leadership Camp in Israel Aug 2012 Models of the United Nations 2013 Community Service Experiences 2012-2013.",
    "education": "Economics and Political Science , 2014 Present Boston University GPA: GPA: 3.3 Economics and Political Science GPA: 3.3\nHigh School Diploma : July 2013 Colegio Moral y Luces - City , Venezuela GPA: GPA: 16.18/20 GPA: 16.18/20",
    "languages": "Spanish (Native), English (fluent) and Hebrew (basic)",
    "interests": "Piano playing Sports: High School's varsity team player and captain of the soccer team. FRATELSA sport club player Mathematics Olympics:\nRepresented school at National Math Olympics for 5 years\nAdditional Information\nMusic: Piano playing Sports: High School's varsity team player and captain of the soccer team. FRATELSA sport club player Mathematics\nOlympics: Represented school at National Math Olympics for 5 years",
    "skills": "basic) Computer Skills, documentation, staff training, English, Hebrew, inventory control, Law, legal, legal documents, notes, Microsoft Office,\nSpanish, Stata"
  }
}