{
  "file_name": "30163002.pdf",
  "sections": {
    "general": "HR GENERALIST",
    "summary": "Young, dedicated and focused office administrative assistant who excels at prioritizing, completing multiple tasks simultaneously and following\nthrough to achieve project goals. Seeking a role of increased responsibility and authority. SKILL HIGHLIGHTS Microsoft Office proficiency\nSelf-directed Excel spreadsheets Professional and mature Meticulous attention to detail Strong interpersonal skills Results-oriented Keen\nunderstanding of grammar Strong problem solver Dedicated team player Executive presentation development Ability to maintain confidentiality\nACCOMPLISHMENTS Received a merit raise for strong attention to detail, exemplary customer service and team-player attitude (Extra Mile\nAward-2009, 2011) Increased office organization by developing more efficient filing system and customer database protocols.",
    "experience": "HR Generalist\nApril 2013 to October 2013 Company Name ï¼​ City , State\nServed as central point of contact for employee relations matters.\nProcessed onboarding and new hire paperwork to ensure all employees were in company system for employment and payroll purposes.\nManaged the receptionist area, including greeting visitors and responding to telephone and in-person requests for information.\nServed as central point of contact for all outside vendors needing to gain access to the building.\nSupplied key cards and building access to employees and visitors.\nManaged all employee personnel files.\nMade copies, sent faxes and handled all incoming and outgoing correspondence.\nCreated PowerPoint presentations used for business development.\nOrganized files, developed spreadsheets, faxed reports and.\nscanned documents.\nMaintained up-to-date employee spreadsheet.\nOffice Administrative Assistant\nJune 2009 to August 2012 Company Name\nManaged the receptionist area, including greeting visitors and responding to telephone and in-person requests for information.\nScreened telephone calls and inquiries and directed them as appropriate.\nDesigned electronic file systems and maintained electronic and paper files.\nMaintained the front desk and reception area in a neat and organized fashion.\nDispersed incoming mail to correct recipients throughout the office.\nMade copies, sent faxes and handled all incoming and outgoing correspondence.\nCreated PowerPoint presentations used for business development.\nOrganized files, developed spreadsheets, faxed reports and scanned documents.\nReceived and screened a high volume of internal and external communications, including email and mail.\nServed as central point of contact for all outside vendors and clients needing to gain access to the building.\nPlanned meetings and prepared conference rooms.\nMaintained an up-to-date office contact chart.\nAnswered client questions regarding retirement and military buy-back options and resolved any issues.\nDeveloped employee handbooks.\nProcessed retirements and military deposits.\nMentored, coached and trained team members to increase productivity.\nIdentified inefficiencies and made recommendations for process improvements.\nWaitress\nAugust 2010 to December 2010 Company Name ï¼​ City , State\nAssisted guests with making menu choices in an informative and helpful fashion.\nMaintained knowledge of current menu items, garnishes, ingredients and preparation methods.\nDelivered exceptional service by greeting and serving customers in a timely, friendly manner.\nAppropriately suggested additional items to customers to increase restaurant sales.\nPromptly served all food courses and alcoholic beverages to guests.\nAnswered questions about menu selections and made recommendations when requested.\nEffectively communicated with kitchen staff regarding customer allergies, dietary needs and other special requests.\nRegularly checked on guests to ensure satisfaction with each food course and beverages.\nManaged closing duties, including restocking items and reconciliation of the cash drawer.\nSkillfully anticipated and addressed guests' service needs.\nConsistently adhered to quality expectations and standards.\nDelivered exceptional, friendly and fast service.\nAccurately recorded orders and partnered with team members to serve food and beverages that exceeded guests' expectations.\nStocked and maintained silverware, linen and condiments.",
    "education": "BACHELOR OF ARTS\nPSYCHOLOGY : 12 2012 North Carolina Agricultural & Technical State University ï¼​ City , State , United States",
    "skills": "business development, central point of contact, closing, client, clients, email, employee relations, fashion, fast, faxes, meetings, access, mail, office,\nPowerPoint presentations, neat, payroll, personnel, quality, receptionist, reception, sales, spreadsheets, spreadsheet, telephone, employee\nhandbooks"
  }
}