{
  "file_name": "30288581.pdf",
  "sections": {
    "general": "MECHANICAL ENGINEERING TUTOR",
    "summary": "Driven and a self-motivated Mechanical Engineer with experience teaching Mechanical Engineering courses to undergraduate students. Seeking\nopportunities to use those concepts in the field of Construction and Management.\nHighlights\nMicrosoft Office (Word, Excel, Power Point, Outlook), AutoCad,",
    "experience": "September 2014 to September 2015\nCompany Name Mechanical Engineering Tutor\nSubjects tutored- Mechanics, Probability and Statistics, MATLAB, Operations Research, Calculus.\nHelped students understand the basic concepts of Physics and Calculus.\nJuly 2013 to April 2014\nCompany Name Assistant Professor\nAugust 2011 to July 2012\nDeveloped coursework and took lectures for 120 undergraduate students.\nSubjects taught Heat and Mass Transfer, Strength of Materials.\nMentored a group of 4 undergraduate students for their final year project titled \"Generating Fuel from Algae\".\nFaculty In-charge Mechanical Engineering students association (MESA) chapter.\nPresident-Indian Society of Heating, Refrigeration and Air Conditioning Engineers college chapter.\nApril 2010 to August 2013\nCompany Name Intern\nDesign Project: Development of Central Chilled water plant system layout for a 45000sq.\nft.\nRetail outlet.\nStudied the project life cycle management of the System.\nHeaded the Intern team and presented weekly progress reports to the Lead Design Engineer Academic Projects: Analysis of LASER\nCladding at IIT Bombay.\nStudied the effects of Laser Cladding by Preplaced powder method on mild steel.\nCalculated the effects of different parameters affecting the LASER clad.\nReduced the usage of powder by 30% and LASER power by 20% Banking Database Management System.\nDesigned a banking database management system for bankers which could calculate the credit score for new customers.\nDesigned and created a database in MySQL.\nImplemented GUI in Excel using VBA Optimization and Scheduling of Shifts for Police Department.\nDetermined optimum shift timings for police officers and allocated appropriate shifts.\nAnalyzed publicly available data from a website.\nDeveloped models for optimizing the availability of police officers.\nUsed Excel and AMPL for solving these models and scheduling the officers based on each model.",
    "education": "May 2016\nArizona State University\nIndustrial Engineering\nMaster of Science Industrial Engineering 3.15\nMay 2011\nUniversity of Mumbai\nMechanical Engineering\nBachelor of Engineering Mechanical Engineering 3.9 Sustainable Energy Sources, Project Life Cycle Management, Design of Engineering\nExperiments, Probability and Statistics, Heat and Mass Transfer",
    "interests": "Volunteer Teacher, Akanksha Foundation, May 2008 - Aug 2013 *Helped students from the underprivileged sections of the society to\nunderstand basic concepts of Mathematics *Coach for their Cricket and Field Hockey teams",
    "skills": "Academic, AutoCad, banking, basic, Calculus, credit, database, Database Management System, Engineer, Experiments, GUI, LASER, layout,\nMaterials, MATLAB, Mechanical Engineering, Excel, Microsoft Office, Outlook, Power Point, Word, MySQL, Optimization, Physics, Police,\nprogress, Research, Retail, Scheduling, Statistics, VBA, website\nAdditional Information\nActivities: Volunteer Teacher, Akanksha Foundation, May 2008 - Aug 2013 *Helped students from the underprivileged sections of the\nsociety to understand basic concepts of Mathematics *Coach for their Cricket and Field Hockey teams"
  }
}