{
  "file_name": "30529547.pdf",
  "sections": {
    "general": "SALES REPRESENTATIVE",
    "summary": "Bi-lingual,efficient service teams. Skills Hard working ,Friendly and enthusiastic able to learn new tasks Customer and Personal quickly,represent\nestablishment with friendly, professional matters at Service all times.Â",
    "experience": "Sales Representative Oct 2017 to Oct 2017\nCompany Name ï¼​ City , State\nCashier , selling lottery tickets to customers.\nManaged the receptionist area, including greeting and responding to information asked.\nDoing basic mathematics , adding , subtracting and multiplying.\nHanding money and prices.\nFront Desk Receptionist Dec 2015 to Aug 2016\nCompany Name ï¼​ City , State\nâ​​ Greet persons entering establishment and direct them to specific destinations.\nâ​​ Operate telephone or forward calls, taking messages, or scheduling reservations.\nâ​​ Receive payment and record receipts for services. â​​ Hear and resolve complaints from customers.\nâ​​ Transmit information or documents to customers, using computer, mail, or facsimile machine.\nâ​​ Collect, sort, distribute guest mail.\nâ​​ Enroll individuals to participate in our hotel rewards program.\nâ​​ Calculate and quote rates for hourly,weekly rates.\nâ​​ Perform duties, such as straightening magazines to maintain lobby or reception area clean.\nRoom Service Dec 2015 to Aug 2016\nCompany Name ï¼​ City , State\nTake food orders and relay orders to kitchen staff.\nPlace food servings on plates or trays.\nExamine trays to ensure that they contain required items.\nStock service stations with items such as ice, napkins, or straws.\nRemove trays and stack dishes for return to kitchen after meals are finished.\nTotal checks, present them to customers, and accept payment for services.Â Determine where guest would like to eat their meals and help\nthem get situated.\nClean or sterilize dishes, equipment.\nTeam Member Jan 2015 to Dec 2015\nCompany Name ï¼​ City , State\nTrain workers in skills such as taking orders, communication, Observe and influence guest behavior, communicating and interacting with\nthem.\nPrimarily serve and prepare food for customers Cleaning work stations and answering questions about menu items, policies, and services.\nEducation and Training\nAssociate Of Arts Mar 2016 Tint School of Makeup & Cosmetology Grand ï¼​ City , State Nail Technician\nHigh School Diploma Jul 2015 Moises E. Molina High School ï¼​ City , State",
    "skills": "Critical Thinking, facsimile machine, mail, policies, reception, scheduling, taking messages, Technician, telephone, Time Management"
  }
}