{
  "file_name": "31813535.pdf",
  "sections": {
    "general": "SR. BUSINESS DEVELOPMENT DIRECTOR\nAccomplishments\nCyber security classified systems - Department of Defense: held Top Secret, Secret Clearances Windows server networks, Disaster\nRecovery, Microsoft Office applications Guest Teacher Lee County Schools Career Counseling High School and College level Low Vision\nsupport software, Guide, Zoom Text, Jaws support Classroom lecture training on Aviation and commercial business topics EH&S Tier 1,2\nauditor Private Pilot.\nProfessional Summary\nTop producing sales professional and expert in the aerospace Â industry. Dynamic communicator who consistently exceeds goals and company\nexpectations.\nMotivated business developer with solid experience managing all levels of large-scale projects, including budgeting and administration.\nClient-focused Sales Representative with 8+ years of providing solutions to customers. Solid understanding of the [ systems and program areas].",
    "skills": "Â Budget, business development, product sales, configuration management, consultation, contracts, customer satisfaction, ontime delivery, direct\nsales, engineering, environmental health and safety, information security, instructor, insurance, logistics, marketing materials, Material science,\nMicrosoft Windows, Radar, network installation, project management, quality management, Six Sigma lean manufacturing",
    "education": "Doctor of Business Administration Management (D.B.A : Argosy University - City , State\nMBA : Avaition , 2004\nEmbry Riddle University - State\nBachelor of Science : Computer Science , 1984\nSouthern Adventist University - City , State\nComputer Science\nAdditional Information\nAWARDS & ACHIEVEMENTS Process Improvement Gold Site Recertification Award (Space Shuttle- Pratt & Whitney) 2009 Eagle\nAward (Process Improvement Gold Certification, Space Shuttle) 2006 - 2008 Eagle Award (Cost saving to company of $500,000) 2002\nHigh Performance Achievement Award (F22 & F35 Tactical Fighter Jets) 2001 Managed state-of-the-art supercomputing facility\nconstruction (Pratt & Whitney) 2000 Private Pilot Certificate Ongoing",
    "certifications": "Certified Airman certificate (private pilot) single engine\nSix sigma"
  }
}