{
  "file_name": "32109048.pdf",
  "sections": {
    "general": "CLAIMS SERVICE MANGER\nProfessional Summary\nService-oriented manager Â who delivers high quality customer service by accurately assessing client needs and recommending the most useful\npolicies and products. Â Excellent investigation and attention to detail skills.Â",
    "skills": "C, call center, closing, contracts, CPT coding, Criminal Justice, customer service, database, documentation, email, fax, faxing, insurance, ISO,\nLaw, Legal, Lexis Nexis, Medical billing, Access, Excel, mail, Office, outlook express, PowerPoint, Works, police, problem resolution,\nprocesses, fluent in Spanish, supervision, telephones, phone\nAdditional Information\n\"John's outstanding client focus has led our USA Bank branch to outperform others and surpass annual profit goals.\" - Henry Adams,\nFinancial Manager, USA Bank",
    "education": "Current\nMaster of Science : Criminal Justice\nSul Ross State University - City , State\n1 2011\nBA : Criminal Justice Sociology\nOur Lady of the Lake University -\nCriminal Justice Sociology\nMinor in Sociology\n1 1998\nEagle Pass High School -\nCourses include: Criminal Law, Criminal Investigations, Theories of Criminal Justice, Corrections, Crimes against Children and Adults, Tort and\nLiabiity\n2011\nBachelor of Arts : Criminal Justice\nOur Lady of the Lake University - City , State\n2011\nInternship : Medical Death Investigations\nBexar County Medical Examiners Office - City , State\nAssisted the on-duty Bexar County Medical Investigator with the collection of information pertaining to scene investigations, interview of witnesses,\nphysicians, police officers and relatives Scene photographs and intake photographs for morgue check-in or out Evidence collection from scene\ninvestigations Log and count medications Office duties that include faxing medical records, police reports, answering telephones and delivering\nreports to the Medical Examiner.United Services Automobile Association Auto Claim Adjuster II- 1st Party Injury.\nAffiliations\nStudent Associate Member of the Association of Certified Fraud Examiners.",
    "certifications": "TX Casualty and Property License"
  }
}