{
  "file_name": "32308556.pdf",
  "sections": {
    "general": "HR VOLUNTEER ASST. MANAGER\nProfessional Summary\nI am dedicated to every project I have worked on with strong undergraduate and graduate credentials including five years experience in Assisting\nManagement of Human Resources. I look to expand my knowledge increasing chances of future career opportunities by completing a Doctorate in\nbusiness program. Educating myself as a full time student puts me in the position to operate in industries such as Manufacturing, Government, and\nHealthcare, those industries alone would increase my earning potential. Being educated in these aspects of business will help me operate any\norganization as needed with my Masters Degree in Business Administration, along with being able to comprehend what is needed for the\norganization to succeed. My aspiration while completing this MBA program is helping me allow myself to work in top management positions along\nwith allowing me to show the skills gained through education.",
    "skills": "Advertising, BA, benefits, Business Administration, Business Strategy, cash flow, Economics, Employee relations, Finance, firing, hiring, Human\nResource Management, Leadership, Logistics, Managerial Accounting, Marketing Management, Operations Management, Organizational,\nPerformance management, policies, Product Design and Development, profit, receiving, Scheduling, Strategic, Strategic Management\nAdvertising, BA, benefits, Business Administration, Business Strategy, cash flow, Economics, Employee relations, Finance, firing, hiring, Human\nResource Management, Leadership, Logistics, Managerial Accounting, Marketing Management, Operations Management, Organizational,\nPerformance management, policies, Product Design and Development, profit, receiving, Scheduling, Strategic, Strategic Management",
    "education": "BA Entrepreneurship, Specializing in Logistics | Ashford UniversityDates From - (2010) To\n2015\nkey points of education: Advertising New Business Strategy Organizational Management Organizational Dynamics\nMBA - Business Administration\nGrand Canyon University\nCity , State\n2018"
  }
}