{
  "file_name": "32441790.pdf",
  "sections": {
    "general": "EDITOR",
    "summary": "Detail-oriented and organized. Accurate and well versed in database management. Strong organizational, technical and analytical skills.\nSuccessfully manages multiple data entry projects at once. Goes above and beyond given job responsibilities to achieve superior results and\nmaintain company-wide data integrity. Focused on delivering high quality results in a timely manner.\nHighlights\nStrong Financial Administration\nGrant Management\nBudget Management Human Resources Administration\nGoal Planning Workshop and Orientation Presentations\nBusiness and Office Administration Excellent Organization Skills\nCommunity Outreach Editing and Proofreading Microsoft Office Products\nTeam Leadership Pleasant demeanor\nStrong problem solver Filing and data archiving\nCustomer service-oriented",
    "experience": "Editor Sep 2002 to Current\nCompany Name ï¼​ City , State\nOversee layout, design and content of featured publications.\nSelect relevant material for each issue, considering cost and benefit.\nGenerate ideas for feature articles with the writing staff.\nCommission work by freelance and in-house writers.\nManage writing staff and liaise with artists and photographers.\nArrange for copyright permissions.\nRaise the profile of the magazine.\nNetwork and recruit for sponsorships.\nEnsure staff meets established deadlines.\nBookkeeping Specialist Jun 2012 to Oct 2014\nCompany Name ï¼​ City , State\nFinancial Administration and Oversight of...\nAccounts receivable (A/R) and accounts payable (A/P).\nInsurances and contracts.\nMonthly records/planning/reconciliation of all bank accounts.\nDaily invoices and primary databases.\nReimbursements and petty cash.\nHuman resources procedures.\nMaintaining updated volunteer database.\nContract revision.\nPublic Relations Administrator/Bookkeeper Aug 2006 to Feb 2009\nCompany Name ï¼​ City , State\nManage public outreach, recruitment and relations with sponsoring/supporting community programs and events.\nConduct group and individual information meetings.\nAssist potential sponsors with goal planning.\nAssist in identifying and addressing barriers to complete established goals.\nDevelop and present goal setting workshops and orientations.\nProvide bookkeeping support while managing database and conducting relevant analysis.\nProject Manager (Profession Opportunity Grant for Immigration/Refugee Recipients Apr 2003 to Jan 2006\nCompany Name ï¼​ City , State\nProvide resource information for potential students and participants ready for career search.\nCoordinate with professional organization and post-secondary education institutions to recruit and attract skilled job seekers for the grant\nprogram.\nAssist clients in communication with government agencies regarding Immigration/Refugee paperwork.\nConduct follow-up visits with clients, assess refugee settlements, and submit progress reports.\nSupervise and evaluate project staff.\nManagement of all grant-related activities including budget and spending projections.\nConduct outreach, recruitment and awarding of subcontracts.\nCollect, direct and develop all relevant grant data.\nConduct career management activities: Assessment, counseling, job development and management of support services.",
    "education": "Bachelor of Art , Russian Language and Literature/Editing/Public Relations Krasnodarsky Gosudarstvennyi Universitet (Kuban State University)\nï¼​ City , Russia\nRussian Language and Literature/Editing/Public Relations",
    "languages": "Bi-Lingual in English and Russian",
    "skills": "Accounts payable, Accounts receivable, A/P, Bookkeeping, Budget Management, Excellent Communication, Contracts, Counseling, Clients,\nDatabases, Editing, English, Feature Articles, Financial goal setting, Human Resources, Layout and Design, Team Leadership, Managing,\nmeetings, Microsoft OfficeProducts, Networking, Office Administration, Organization Skills, Presentations, Proofreading, Publications,\nQuickBooks, Recruitment, Russian, Workshops."
  }
}