{
  "file_name": "33919379.pdf",
  "sections": {
    "general": "CONSULTANT",
    "objective": "Enthusiastic Pharmacist with a variety of experience in community pharmacy including compounding and managerial experience.Â Enjoys\nmultitasking by working with other healthcare professionals and insurance providers to ensure optimal patient outcomes.Â Thrives on working in a\nteam environment to provide an efficient and positive patient experience.\nLicenses\nIn good standing with both Texas and Idaho State Boards of Pharmacy and a certified immunizer.",
    "professional experience": "09/2016 to Current\nConsultant Company Name ï¼​ City , State Experience in ACHC accreditation and compounding product development.Â Pharmacy workflow\nsolutions and marketing strategies.Â Insurance billing knowledge including specialty medications, expertise in State Board inspections and license\nreciprocity process.\n02/2016 to 08/2016\nPharmacist in Charge Company Name ï¼​ City , State Set up a newly purchased pharmacy that specialized in non-sterile compounding.Â Created\na logical and efficient system to process prescriptions, compounding, product verification, and shipping arrangements.Â Developed many\ncompounded medications such as topical analgesics, scar diminishing creams, and a variety of metabolic supplements.Â Enjoyed managing a team\nto promote a positive and efficient work environment.\n10/2015 to 02/2016\nStaff Pharmacist Company Name ï¼​ City , State Gained initial non-sterile compounding experience.Â Involved with processing, verifying\nprescriptions, and product verification.Â Learned record keeping for compounding ingredients, batch and patient specific compounding.Â\nWorked to create optimal workflow, product marketing, and develop business.\n06/2012 to 10/2015\nStaff Pharmacist Company Name ï¼​ City , State Pharmacist with diverse experience within the company.Â Staffed at a high volume 24 hour store\nand a clinic store.Â As staff pharmacist helped to manage operations, participated in drug utilization review and medication therapy management\nfor multiple stores.Â Promoted immunizations and enjoyed patient interaction and counseling.",
    "skills": "Pharmacy operations\nPrescription compounding and dispensing\nInventory control\nNon-sterile compounded medication development\nBusiness development\nTeam building\nPatient counseling\nMicrosoft Office\nIntercom Plus\nBestRx\nEducation and Training\n2012\nDoctor of Pharmacy University of the Incarnate Word ï¼​ City , State\n2003\nBachelor of Science : Economics Texas A&M University ï¼​ City , State"
  }
}