{
  "file_name": "33964275.pdf",
  "sections": {
    "general": "CO-OWNER/MANAGER/ CHEF\nProfessional Summary\nThank you in advance for allowing me to respond to this amazing opportunity. Creative, motivated and relationship-oriented individual who enjoys\nempowering others to reach personal and business goals. Works well in an environment that emphasizes creativity, autonomy, and decision-\nmaking. Possesses the ability to organize, plan and execute ideas from conception to completion. Utilizes a unique blend of strengths from artistic\nto communicative to fulfill any position, powerfully. Organizations Communities for All Ages - a non-profit, Weed & Seed initiative that provides\nintergenerational strategies for community building. Resulting in expanded social networks, increased civic engagement and leadership among\nmultiple generations. This organization allowed for me to learn the art of alliance building. We chose those alliances that possessed strong\nleadership practices. I am a part of a mentorship program through this organization. Proactive media and communications professional with\n[Number] years in internal and external communications, social media, blogging and editorial media relations. Strategic Marketing and\nCommunications Consultant with a firm grasp of corporate messaging and branding. Possesses a strong work ethic, as well as exceptional writing,\nediting and research skills. Strategic Marketing and Communications Consultant with a firm grasp of corporate messaging and branding. Possesses\na strong work ethic, as well as exceptional writing, editing and research skills. [Job Title] with strengths in special events and promotion planning.\nFrequently attends marketing seminars and conducts outside research to stay current with market trends and consumer needs.",
    "skills": "PC, IMAC, Windows XP, Vista, Microsoft Office Suite, Adobe, Amicus Attorney, Internet resourcing, Social media: Facebook, Twitter,\nInstagram, PowerPoint, POS, QuickBooks.\nAdditional Information\nI would like to continue the tradition of advocacy and commitment to youth through your GeoFORCE program. I find your Coordinator\nopportunity to be incredibly fresh, motivating and inevitably- rewarding. Please review my resume at your leisure. It would be an honor to\nbe part of your program and even more of an honor to work with your kids. Thank you again for your consideration. I look forward to an\ninterview at your convenience. Sincerely,\nThe Good Neighbor Coalition and Southside Community Association - In partnering with the residents, merchants, Councilmen, Mayor of\nFlagstaff, Flagstaff Police Department, the NAU Police, Residence Life, Greek societies-We drew recognition and promotion of\nmulticultural enrichment through these partnerships, education and proactive leadership through the coordination of outreach efforts. Through\ncombined efforts with Murdoch Community Center, Americorp, and the Flagstaff Public School District, we have kept our youth engaged in\nthe renaissance of several of the city's \"blighted\" areas. Friends of Flagstaff Future- Board of Directors, an organization founded to help the\ncity of Flagstaff thrive through responsible growth and environmental sustainability. F-cubed as the group is known also partners with Lowell\nObservatory for a series of educational events bringing astronomical sciences to the public. Learning under the stars. Theatrikos Theater\nCompany Doris Harper- White Community Playhouse- Board of Directors a leading arts organization in Northern Arizona, offering high-\nquality live theatrical productions and educational opportunities, utilizing a diverse base of talent which represents and reflects the community\nat large. Through diligent fundraising we were able to expand youth workshops and bring comedy, music and other creative repertoire to the\ncommunity. Flagstaff Nuestras RaÃ​ces, which is dedicated to promoting and preserving Hispanic culture and history through events,\ngatherings, the performing, visual arts and sciences. The organization draws on the Arizona Hispanic family stories, history, traditions and\ntalents as tools for cultural transmission. Through my affiliation with this organization I have learned much in the way of humility,\nperseverance and loyalty to my heritage and to Latino youth.\nArizona Broadcasters Association Scholarship, Arizona Press Club Scholarship, College of Creative and Communication Arts\n/Telecommunications Scholarships, SPJ-SDX; Society of Professional Journalist-Sigma Delta Chi, AE RHO; Professional Honorary\nBroadcasters Fraternity, Honorary Student Delegate Telecommunications Faculty Board.",
    "education": "Northern Arizona University 1987\nBachelor of Science : Communications Broadcast Journalism\nTelecommunications Emphasis Broadcast Journalism Political Science\nMinor in [Name of minor]\nPolitical Science\nMember of [Club Name] Club\nRecipient of [Scholarship Name] Scholarship\nContinuing education in [Topic]"
  }
}