{
  "file_name": "34419403.pdf",
  "sections": {
    "general": "CONCIERGE/DOORMAN",
    "summary": "Experience working in concierge, military, general office, international & domestic shipping. Excellent interpersonal communication, customer\nservice, and office support skills. Windows/DOS, MS Office, Data Entry, Internet and Internet Research Skills.",
    "skills": "administrative, administrative duties, copying, Customer Service, email, special events, fax, Inspecting, mechanical, medical emergencies, mail,\noffice, weapons, Navy, Quick, receptionist, repairing, transportation, typist",
    "experience": "11/2014 to Current\nConcierge/Doorman Company Name ï¼​ City , State\nProvided professional and consistent concierge service to residents, visitors and contractors.\nRespond to email communications, answer inquiries and offer suggestions.\nEfficiently handle large call volume inquiries from tenants/guests.\nAssist with administrative duties such as light copying & fax requests and other requests as needed.\nProvide updated information for local restaurants, special events, transportation etc.\nMonitor lobby traffic and alerting residents of deliveries and arriving guests.\nProvide all other job duties as requested by administrative/management staff.\nRecord and deliver messages to residents, management, leasing, and relieving concierge.\nProvide guests with information on valet and housekeeping services and ensure that additional housekeeping requests are fulfilled.\nActivate or deactivate remotes or keys for guests checking in and checking out.\n12/2007 to 11/2013\nAviation Ordnanceman Company Name ï¼​ State\nHandle and service weapons and ammunition carried on Navy aircraft.\nInspecting, maintaining and repairing the aircraft's mechanical and electrical armament/ordnance systems.\nStow, assemble and load aviation ammunition that may include anything from aerial mines and torpedoes to missiles and rockets.\nService bomb, missile and rocket releasing and launching devices, and service aircraft guns.\nAssemble and test air-launched guided missiles, and supervise the operation of aviation ordnance shops, armories and stowage facilities.\n01/2005 to 11/2007\nOffice Assistant Company Name ï¼​ City , State\nPerform receptionist duties when needed.\nMaintain trusting relationships with suppliers, customers and colleagues.\nSort and distribute mail in a timely manner.\nResolve office-related malfunctions and respond to requests or issues.\nCreate and update records ensuring accuracy and validity of information.\nEducation and Training\nSep 1999\nHigh School Diploma : International Business Jacqueline Kennedy Onassis ï¼​ City , State International Business"
  }
}