{
  "file_name": "34970271.pdf",
  "sections": {
    "general": "MEMBER ADVOCATE\nEducation and Training\n2009\nUniversity of the Incarnate Word City , State Bachelor of Business Administration\n2011\nUniversity of the Incarnate Word City , State Master of Business Administration",
    "professional experience": "01/2012 - Current\nCompany Name ï¼​ City , State Member Advocate\nRepresent DentaQuest at community events and meetings to provide information to low-income populations about the dental benefits\navailable to Medicaid and CHIP eligible members.\nEstablish, develop, and maintain partnerships with community organizations to identify and coordinate outreach opportunities that will\nfacilitate growth in enrollment.\nConduct presentations to promote preventative dental care through good oral hygiene practices and compliance with Texas Health Steps\ncheckups.\nProvide case management to members in need of care coordination and assist members with claims issues and appeals.\n01/2012\nCompany Name ï¼​ City , State Provider Relations Specialist\nServed as a liaison between the Medicaid and CHIP Managed Care contractor and health care providers.\nResponsible for establishing and maintaining working relationships with the existing provider network.\nResearched and resolved provider inquiries to include credentialing, claims issues, complaints and grievances.\nEducated providers on new protocols, policies, and procedures to facilitate process improvements.\nEnsured provider database and documentation was up to date, accurate, and complete.\nAssisted with the development and implementation of provider training programs.\n01/2011\nCompany Name ï¼​ City , State Business Development/Admissions Coordinator\nResponsible for the development of admission statistics in a long-term acute care hospital setting by developing referral sources and\nconverting referrals into admissions.\nResponded to inquiries from hospital discharge planners, families, and other referral sources.\nConducted facility tours and informed families of potential patients of admission criteria, insurance coverage, and other costs associated with\npatient care.\nVerified insurance benefits, obtained prior authorizations, and ensured that all potential barriers to claims payment were addressed and\nresolved prior to admission.\nCoordinated the admissions process from start to end and alerted department heads of projected admissions, bed changes, discharges, and\nprotocols for compliance with the patient's managed care insurance requirements.\n01/2004 - 01/2009\nCompany Name ï¼​ City , State Beneficiary Services Representative\nActed as a liaison between TRICARE beneficiaries and health care providers.\nProvided customer service support to beneficiaries that visited the local TRICARE Service Center by responding to benefit inquiries,\nresolving claims issues, and assisting with appeals, complaints, and grievances.\nAdvised beneficiaries of health and dental plan options and processed enrollments, disenrollments, primary care provider assignments, and\nother plan changes.\nProvided customer support to the local military treatment facility administrative and clinical staff and assisted case management team with\nreferrals and prior authorizations.\nTraveled within the state of Texas to conduct benefit and enrollment presentations to different military groups, such as active duty service\nmembers transitioning to retirement, new active duty service members and base transfers, and National Guard and Reserve members called\nto full-time active duty services.\nProvided health care providers with assistance on claims issues, appeals, complaints and grievances.\n01/2002 - 01/2004\nCompany Name ï¼​ City , State Office Coordinator\nServed as administrative and clinical support in various office settings throughout hospital organization to include outpatient physical,\noccupational, and speech therapy, inpatient skilled nursing, and outpatient wound care services.\nAcquired insurance authorizations for patient services.\nPrepared all required claims documentation including referrals, treatment plans, and other required correspondence to reduce incidence of\ndenials.\nAssisted other areas of hospital by investigating and resolving claims discrepancies in order to collect on unpaid patient accounts.\nPlayed key role in the opening of hospital's new wound care center by assisting director in all areas of development, including creating\npolicies and procedures, creating forms for clinical and billing staff, and obtaining insurance credentialing for providers.\n01/1999 - 01/2001\nCompany Name ï¼​ City , State Business Office Manager\nManaged business office for skilled nursing, rehabilitation, and long-term care facility.\nBilled Medicaid, Medicare, and private insurance companies for services rendered to patients.\nManaged facility's accounts receivables and accounts payables.\nPrepared administrative reports for directors, Chief Financial Officer, and Chief Executive Officer.\nResponsible for interviewing, hiring, training, and termination of office personnel.",
    "skills": "accounts payables, accounts receivables, administrative, benefits, billing, oral, customer service, customer support, database, documentation,\nFinancial, forms, hiring, insurance, director, meetings, office, network, nursing, personnel, policies, presentations, protocols, speech, statistics,\ntraining programs"
  }
}