{
  "file_name": "35492909.pdf",
  "sections": {
    "general": "TAX ACCOUNTANT\nProfessional Summary",
    "skills": "QuickBooks, CCH ATX, Microsoft Office Suite,\naccount reconciliation, accounting, administrative, bookkeeping, C, CA, consulting, contracts, credit, client, clients, documentation, filing,\nfinancial analysis, forms, funds, general ledger, MA, Mandarin, marketing, Excel, Microsoft Office Suite, payroll, QuickBooks, real estate,\nreporting, sales, tax compliance, tax, taxes, tax returns, telemarketing, venture capital",
    "education": "Master of Professional Accountancy : 06/2016\nUniversity of California\nBachelor of Science : Accounting, Economics , 05/2015\nThe Pennsylvania State University, University Park\nWork History\nTax Accountant , 01/2016 to Current\nCompany Name – City , State\nPrepared and reviewed hundreds of federal and multi-state tax returns for Individuals, Partnerships, LLCs, S Corporations, and C\nCorporations (1040/1040NR/1120/1120S/1065, AZ/ CA/ DE/ FL/ IL/ MA/ MN / NY/ WI state filing) Conducted consulting services for\nclients regarding their filing status and related tax issues Conducted foreign tax compliance, including foreign withholding taxes and foreign\ntax credit (Form 1042S /Form 5471 /Form 5472) Provided comprehensive bookkeeping and accounting services for multiple clients in\nvarious industries (manufacture, real estate, venture capital, hospitality industry, etc.) Managed general ledger transaction and reporting and\nperformed account reconciliation Provided financial analysis for clients and assisted with documentation for annual audit Completed payroll,\npayroll tax deposits, payroll tax returns and 1099/W2 forms Prepared and filed monthly and quarterly sales and use tax deposit and tax\nreturns Assisted clients to setup business, register federal and state tax information and dissolve business.\nIntern , 07/2015 to 08/2015\nCompany Name – City\nPrepared applications for fund transfers and submitted to headquarter to ensure the circulation of funds Collected and sent contracts and\ninvoices to banks Created Excel reports and updated the data for reconciliation.\nWholesale Banking Intern , 05/2014 to 08/2014\nCompany Name – City\nOrganized marketing campaign to develop client relationship and complete business transactions Assisted client relationship manager with\ndaily administrative work Conducted telemarketing and social media marketing to attract potential clients.\nAffiliations\nSelf-motivated tax accountant with more than 3 years of experiences in tax filing for individuals, pass-through entities and corporations. Prepared\nand reviewed hundreds of tax returns. Provided comprehensive accounting service for 20 ongoing clients. Receive all 5-star reviews from clients.",
    "interests": "LEADERSHIP & VOLUNTEER , Pennsylvania State University Chinese Students and Scholars Association April 2013 - April 2014 Recreation\nand Sports Department Coordinator Planned and organized basketball matches and recreation events every semester Composed proposals for\nactivities, coordinated and communicated with other departments Organized and supported 16 university team leagues, comprised of three\nhundred people",
    "languages": "Fluent in Mandarin"
  }
}