{
  "file_name": "35737840.pdf",
  "sections": {
    "general": "ENGINEERING AIDE\nProfessional Summary\nResourceful Facilities Tech with solid background in preventative maintenance repair.Talented Facilities Tech with more than 3 years of experience\ndeveloping and executing maintenance programs. Excellent troubleshooting skills.Detail-oriented professional with strong technical skills and the\nability to learn concepts quickly. Highlights q Mechanically-inclined q Diagnosis and repair q Skilled concrete finisher q Preventative maintenance q\nDexterous with hand tools q Suspension and alignment q Strong attention to detail q Brake systems expertise q Troubleshooting q Brake repair\nand replacement q Responsible and reliable q Strategic thinker q Excellent problem solver q Self-starter q Decisive q Critical thinker\nAccomplishments Machine Troubleshooting q Performed effective troubleshooting of [machines/systems] [number] per [week/month/year].\nRepaired broad range of [machines or systems] including, [types of machines or systems] using [tools].Problem Diagnosis q Used operational\nknowledge of systems, parts and components to solve problems that arose during assembly. Documentation q Reported and documented unsafe\nconditions, equipment and/or injury. Training q Responsible for providing vision and guidance to a group of 20 construction employees, training\nthem on sufficient project plans and procedures. Equipment Maintenance q Performed routine maintenance on equipment on as-needed basis.\nInventory Control q Restocked and organized items as necessary and as directed. Machine Repair q Detected machine malfunctions and problem-\nsolved accordingly. q Repaired, maintained and replaced parts on dies.",
    "skills": "customer service, customer service, documentation, forklift, forms, legal, materials, policies, problem solving skills, progress, quality assurance,\nread, repairs, safety, struts, supervisor, tear",
    "education": "Diploma : General Studies , 1 1986\nMaury High School - State\nGeneral Studies\nIndustrial Maintenance Industrial Engineering, Production Engineering, Mechanical Engineering and Engineering Welding Fabrication, Industrial and\nTool Manufacturing Technology and Process Technology , Lamar Institute of Technology - City , State\nGPA: GPA: 4.0 Industrial Maintenance GPA: 4.0 Industrial Engineering, Production Engineering, Mechanical Engineering and Engineering Welding\nFabrication, Industrial and Tool Manufacturing Technology and Process Technology"
  }
}