{
  "file_name": "37231163.pdf",
  "sections": {
    "general": "SOUS CHEF",
    "summary": "Reliable, high-performing, individual with 5+ yrs providing excellent service in the restaurant and cooking industry. Seeking new opportunities\nwithin the industry to expand my knowledge, provide challenges, and include room to grow. Over a year of experience baking unique and delicious\npastries, cakes, and pies. Capable of adapting to regional tastes and various diets. Continuing education includes a range of certifications for\nhandling food, catering style, slope work, and food plating. Admirable experience in preparation and presentation of cold foods. Exemplary\nknowledge of food hygiene in concordance with proper food handling regulations.Â Skilled in knife techniques including, but not limited to,\nchopping, dicing, cutting, and carving. Able to evaluate and comprehend cooking documents including manuals and recipes. Â Excellent team-\nbuilding and conflict resolution skills.",
    "experience": "Company Name City , State Sous Chef 03/2017 to Current Works with the executive chef to produce diversified menus in accordance with the\nrestaurant's policy and vision. Produces high quality dishes that follow up the established menu and clients' requirements. Helps plan the food\ndesign in order to create a perfect match between the dish's aspect and its taste. Helps train the auxiliary kitchen staff in order to provide best\nresults in minimum time and using at the maximum the available resources. Maintains order and discipline in the kitchen during working hours.\nEnsures the hygiene and food safety standards are met in all stages of food preparation.\nCompany Name City , State Garm Chef 05/2016 to Current Prepare cold food items for a kitchen, such as salads, sandwiches, amuse, soups,\ncheese plates, charcuterie and desserts. Follow day to day recipes of new and existing dishes while finding ways to help improve day to day\noperation of the position. Maintain a clean and organized work environment.\nCompany Name City , State Lead Cook 10/2014 to 05/2016 Exhibited thorough knowledge of foods, beverages, and supervisory dutiesÂ as\nLead Cook while directing operations in kitchen. Responsible for 5 associate cooks during shift. Performed kitchen walk-through to gauge\npreparedness, freshness of food, and cleanliness of work areas. Â Oversaw the preparation and service of all food including, but not limited to,\nstorage of kitchen equipment, maintaining kitchen sanitation, and safety standards.\nCompany Name City , State Front Desk 04/2012 to 06/2013\nGreeted guests in a timely manner. Managed registration process by checking identification and ensured accuracy of provided credentials. Handled\ncheck-ins and checkouts. Operated hotel switchboard, took calls, and provided information. Answered inquiries regarding the hotel services,\ncharges, and dining facilities. Balanced cash at the end of each shift and generated accounting reports.",
    "education": "Culinary Arts Expect to pursue\nGraphic design University of Alaska Anchorage , City , State , United States Completed one year of general requirement classes before deciding\nto pursue other ventures.\nHS Diploma 2004 Seward High School , City , State , United States",
    "skills": "Excellent leadership qualities, passion for culinary arts, excellent customer service skills, enthusiastic people person, self-driven, dedicated."
  }
}