{
  "file_name": "37473139.pdf",
  "sections": {
    "general": "STOREKEEPER II\nProfessional Summary\nThe purpose of this document is to secure a responsible career position that fully utilizes educational knowledge and experience while contributing\nto the goals and values of this organization. Having a friendly attitude and worm personality is an appreciated strong point, as it aided in building\npositive relationships with customers. As a result, repeat and satisfied customers were well known during career at Pioneer Packaging as well as\nwhile working for City of Peoria. Helping people is one of my best characteristics. Obtaining several years experience contacting vendors,\nanswering phones and face to face contact with the public and governmental personnel has honed my customer service abilities. Problem solving\nskills and a positive work ethic makes communication easier. I am devoted and dedicated to serving in any way possible, and strive to accomplish\nassigned tasks quickly and efficiently. Exceptional people skills allow the ability to manage personnel and take care of conflicts, disputes and other\npersonal needs of employees. Procurement and Purchasing: Over 10 years processing purchase orders. Primary vendor contact for Inventory\nControl and Fleet parts room purchases. Highly proficient utilizing inventory procurement practices and procedures.",
    "skills": "Architectural Drafting, AutoCAD, clerical, Customer Service, Data Entry, dispatching, drivers, film, Forklift, Forklift Operator, forms, instruction,\ninventory, Mechanical, mechanic, Excel, Microsoft Office, PowerPoint, Windows, Word, Navy, Naval, packaging, PeopleSoft, PeopleSoft 9.0,\nPersonnel, presentations, procurement, purchasing, quality control, receiving, reconciling, research, Safety, Scanning, Shipping, spreadsheets,\nspread sheets, spreadsheet, supervisor, Trainer, Word Processing, Word Perfect",
    "education": "Bachelor's Degree Business Management Administration Grand Canyon University City , State Business Management Administration\nAssociate Degree National Education Center City , State\nGraduate Naval Aviation A School City , State\nCertified Trainer Forklift Truck Operator Safety AutoCAD Certificate in Architectural Drafting Llewellyn Technology, Certificate, Electro\nMechanical Systems Repair City , State Training also includes repair of Signode banding and tie wrapping machines, Synergy, Minipac-poly shrink\nfilm packaging systems, remove and replace damaged parts and components, and mechanical devices."
  }
}