{
  "file_name": "38744475.pdf",
  "sections": {
    "general": "INTERIOR DESIGNER",
    "summary": "Talented Designer and Retail Merchandiser skilled at using product placement and creating uniquely inspiring displays. Collaborates with company\nheadquarters and sales managers to create product display solutions that boost sales revenue.\nHighlights\nStore layout design\nStore communication\nInteractive displays\nStore maintenance\nCommon store planning\nGraphic displays\nAutoCad\nWorking remotely\nAccomplishments\nSelected for national brand building campaign, responsible for planning, implementing, and producing makeover videos and marketing content.",
    "experience": "Interior Designer 08/2013 to Current Company Name City , State\nInterior Design Specialist at IKEA Sunrise store.\nSupported growth and development as leader of local market research project.\nDesigned unique and centrally planned displays.\nCreated inspiring homes and rooms that showcase products in function and boost sales.\nWorked with vitality to motivate people to visit the store more frequently\nWorked to promote IKEA as leaders of life at home\nRemodeled employee resource center to promote a better everyday life at work.\nNational Marketing Campaign IKEA Home Tour 12/2013 to 12/2014 Company Name City , State\nInterior designer, host, video producer, and video editor for IKEA Home Tour marketing campaign.\nPioneered unique marketing project in various markets in the US.\nSupporting a crew with various skills with little direct supervision.\nPlanning and implementing in-home makeover projects.\nDistributing marketing content for social media.\nCreating brand specific communication.\nSpeaker and promoter for live and on air marketing events.\nContributed to a positive ROI for the project.\nVisual Merchandiser 01/2011 to 08/2013 Company Name City , State\nPlanned, implemented, and maintained store layouts to support commercial priorities.\nAdapted and implemented centrally planned display areas throughout the commercial calendar.\nStrategically merchandised product displays to maximize sales.\nCreated inspirational and clear brand communication within the store showroom and shopping areas.\nAdapted plans on the fly to account to architectural discrepancies.\nDistinguished as a key contributor on assignment to Orlando store marketplace remodel.\nFreelance Designer 07/2007 to 01/2011 Company Name City , State\nResidential interior design .\nSpecialized in layouts and finishes.\nMaximized design for small space living.\nOrganized and coordinated contractors and installers.\nFine art consultation.\nInterior Designer Sales 07/2008 to 07/2009 Company Name City , State\nInterior Designer and Sales Specialist for custom modern and contemporary furniture store.\nSelected high-end furnishings and finishes for residential and commercial interior design projects.\nDeveloped business relationships with local real estate developers.\nCoordinated remodeling projects between clients contractors.\nImplemented in-store sales space for Kartell.",
    "education": "Bachelor's Degree : Bachelor of Fine Arts, Design 2007 University of Central Florida City , State , United States\nWinner of juried art show hosted by the New America Foundation.\nAssociate of Arts : Graphic Design 2004 Broward College City , State",
    "languages": "English (Native or bilingual proficiency) Spanish (Native or bilingual proficiency)",
    "skills": "Adobe Creative Suite\nAutoCAD\nPlanograms"
  }
}