{
  "file_name": "39027764.pdf",
  "sections": {
    "general": "DIRECTOR OF DEVELOPMENT\nProfessional Summary\nReal Estate / Development / Construction Executive Versatile executive with 38 years experience in the real estate and construction industries\npossessing a combination of hands on technical experience coupled with strong organizational and leadership skills to manage project teams from\nconcept to completion. Honest and thoughtful style results in loyal teams that work toward a common goal. Strategic thinker and planner with\nanalytical skills and proven aptitude to manage complex and numerous projects and coordinate the efforts of corporate departments, landlords,\ndesigners, consultants, and contractors to turn over successful projects. Honest and pragmatic approach to conflict resolution and problem solving.\nImmense pursuit and tireless effort to produce successful and timely results. Strong real estate aptitude allows for thorough Due Diligence and\nmarket analysis, for contract, purchase and lease administration. Commercial and Residential project management - Development - Estimating -\nBudget Preparation and Implementation - Profit & Loss responsibility - Value Engineering - Cost Control - Team Building - Employee training -\nSite Selection -- Land Use Entitlement - Permitting - Design and Plan Review - Bidding and Negotiation - Purchase and Lease negotiation -\nPurchase, Lease and Contract Administration Construction Manager familiar with preparing and negotiating contracts with clients and suppliers.\nInnovative Construction Manager adept at finding engaging ways to motivate construction teams to exceed expectations and maintain high\nstandards.",
    "skills": "assembly, branding, budgets, Carpenter, cost control, drafting, Due Diligence, graphics, marketing, merchandising, office, negotiation, operations\nManagement, progress, Reporting, retail, seminars",
    "education": "5 1975\nBS : Building Construction Design and Technology\nEastern Kentucky University - City , State\nBuilding Construction Design and Technology\nBuilding Construction Trades Certificate"
  }
}