{
  "file_name": "39581020.pdf",
  "sections": {
    "general": "SALES ASSOCIATE",
    "skills": "coach, Communication Skills, credit, Leadership Skills, marketing, window, Problem Solving Skills, sales, Teamwork, telephone",
    "experience": "03/2016 to 06/2016\nSales Associate Company Name ï¼​ City , State\nAnswered questions regarding the store and its merchandise.\nGreeted customers and ascertained customers' needs.\nHelped customers with questions, problems and complaints in person and via telephone.\nOrganized racks and shelves to maintain the visual appeal of the store.\nVerified that all customers received receipts for purchases.\nDeveloped positive customer relationships through friendly greetings and excellent service.\nServed as a peer coach for new sales associates.\nCreated visual marketing and styled window displays.\n04/2015 to 11/2015\nCashier/Server Company Name ï¼​ City , State\nConsistently provided professional, friendly, and engaging service.\nExamine plates to ensure that they contain required items.\nLoad plates with accessories such as eating utensils, napkins, or condiments.\nTake food orders and relay orders to kitchen.\nStock service stations with items such as ice, napkins, and straws.\nAssist customers by providing information and resolving their complaints.\nGreet customers entering the establishment.\nMaintain clean and orderly checkout areas and complete other general cleaning duties, such as mopping floors and emptying trash cans.\nReceive payment by cash, check, credit cards, vouchers, or automatic debits.\nGuided guests through menus while demonstrating thorough knowledge of the food, beverages and ingredients.\n12/2016 to Current\nKey Holder Company Name ï¼​ City , State\nDisplayed pieces in visually appealing manner.\nAnswered phones with professionalism.\nDescribed merchandise and services to customers.\nAnswered questions and resolved concerns.\nResponded to safety and loss prevention incidents.\nOrganized in-store promotional events.\nMaintained store in clean and neat manner.\nEducation and Training\nDec 2015\nHigh School Diploma Derby High School ï¼​ City , State\nSeptember 2016\nEric Fisher Academy ï¼​ City , State"
  }
}