{
  "file_name": "41651672.pdf",
  "sections": {
    "general": "INSIDE SALES REPRESENTATIVE",
    "experience": "Company Name March 2012 to Current Inside Sales Representative\nCity , State\nCurrently selling the suite of OpenTable products to an assigned territory with a concentration in Chicago, Minneapolis, and Milwaukee.\nUtilize a consultative approach to communicate the features and benefits of OpenTable products and services.\nEffectively meet sales results by various means such as cold-calling, presenting at company sponsored seminars, following up on company\nprovided leads, meeting in person with restaurant owners, and networking with field representatives along with leveraging customer service\ninto upselling opportunities.\nSolid understanding of OpenTable Electronic Reservation Book and its competitive advantages.\nMet or exceeded monthly, quarterly, and yearly quota for calendar year 2012(125%), 2013(108%) and 2015(100%).\nProficient understanding of salesforce.com CRM application and pipeline management.\nPromoted to Sales Representative from Sales Coordinator within first 6 months of employment.\nCompany Name August 2009 to February 2012 Asset Manager\nCity , State\nManaged a $50M portfolio of real estate properties.\nRepresented investors, developers and business owners in leasing residential and commercial space.\nIncreased company profile with existing client base while networking extensively to forge new alliances to provide multi-faceted real estate\nservices.\nFinancial reporting and owner summaries for 700 units of mixed multifamily and commercial properties.\nDeveloped and negotiated specific project plans for new builds and remodels.\nWeekly property evaluations including special project coordination.\nManaged and trained a team of 6 sales, maintenance, and housekeeping personnel.\nOrganized, hosted and led company sponsored events.\nCompany Name February 2008 to May 2009 Property Manager\nCity , State\nRepresented preferred developers and multi-unit operators including The University of Canterbury, New Zealand.\nDirected and managed a portfolio of 100+ units of university housing.\nResidential lease negotiations.\nRent collection and financial reporting to operators.\nUpdated new and expired documentation as needed.\nCompany Name August 2005 to February 2008 Business Banking Specialist\nCity , State\nResponsible for managing and retaining existing relationships and generating new business in the Business Banking market segment.\nCross-sold bank products, executed strategies with calls and site visits; provided needs assessment, customer qualification and meeting\nfollow-up to maintain, enhance and expand customer relationships.\nServiced the credit and non-credit financial needs of existing clients.\nPersonally interviewed applicants, and closed various types of SBA loans.\nManaged all aspects of location and cultivation of new deposits and loans.\nAnalyzed call logs and sales numbers in compliance with targeted sales quotas.",
    "education": "Colorado State University May 2014 BA : Business Administration Management City , State Business Administration Management",
    "skills": "approach, Banking, benefits, Book, cold-calling, competitive, credit, client, clients, customer service, documentation, features, financial, Financial\nreporting, managing, market, needs assessment, negotiations, networking, personnel, presenting, project coordination, project plans, real estate,\nselling, Sales, salesforce.com CRM, seminars"
  }
}