{
  "file_name": "41910253.pdf",
  "sections": {
    "general": "HEALTHCARE ASSOCIATE",
    "summary": "Energetic, resourceful, and results-driven professional .Skilled at working effectively both independently and collaboratively as part of a team\nwithin fast-paced environments to complete projects and responsibilities while adhering to deadlines and quality standards.",
    "skills": "EPIC, Microsoft Office Suite (Word/Excel/PowerPoint), Healthcare Systems, Insurance/Billing, Sorian Scheduling, Health/Medical Records,\nResearch, Reports, Databases, Data Analysis, and PCs/Windows Applications",
    "experience": "February 2002 to Current\nCompany Name City , State Healthcare Associate\nMaintain full responsibility for demonstrating initiative, strong leadership and communication skills, and medical and healthcare knowledge to\nsupport efficient and productive day-to-day operations.\nDirectly accountable for a diversity of patient/unit support activities including scheduling and discharge, coordinating admission packages,\narranging transportation, completing unit work orders, maintaining inventory, and preparing patient unit census.\nMonitor and improve individual performance in all areas to ensure adherence to the highest levels of customer/patient service, productivity,\nefficiency, leadership, teamwork, and work quality at all times.\nÂ\nÂ\nÂ\nÂ\nExcellent capacity to meet deadlines, build rapport with individuals from diverse backgrounds, and to support practice objectives by\nfacilitating an environment that consistently achieves/exceeds expectations.\nResponsible for maintaining professional and courteous communications, demeanor, and interactions with patients and medical staff while\ncontinuously seeking ways to provide value-added service and support.\nMaintain files, documents, databases, and records to provide highly reliable information quickly and use well-developed interpersonal skills\nto respond effectively to both internal and external requests/inquires.\nCommunicate clearly and effectively, use strong coordination and prioritization skills to complete work, and exercise independent judgment\nand decision making abilities to help facilitate smooth operations.\nStrong organizational, time management, and multi-tasking skills with ability to prioritize work.\nUse well developed interpersonal skills to work effectively with clients, co-workers, and all levels of management.\nAccept new assignments and responsibilities with a positive, cooperative, and team-oriented attitude.\nComplete all tasks and projects in the most efficient manner possible and exercise independent decision making.\nRecognized by management for anticipating problems, presenting effective solutions/recommendations, team collaboration and leadership,\nexceeding work expectations, and consistently delivering outstanding results.\nEducation and Training\nAmerican InterContinental University\nCity , State Healthcare Management BBA Healthcare Management Training: Healthcare Finance, Risk Management, Information Systems,\nManagement, Ethics, Policy Making\nQualifications\nCommunication skills, interpersonal skills, Â Data Analysis, Databases, Decision-Making, Information Systems, Insurance Verification ,\nmaintaining inventory, Leadership, Regulatory Compliance, multi-tasking, organization, Patient Care Support, Project Management, Quality,\nResearch, Risk Management, Scheduling, Sound Strategic Planning, Teamwork, Time management."
  }
}