{
  "file_name": "44147689.pdf",
  "sections": {
    "general": "CONSTRUCTION MANAGER / PROJECT COORDINATOR / INSPECTOR",
    "summary": "To demonstrate my architectural and construction management skills, which will help contribute to an organization's success.",
    "skills": "ADA, agency, blueprints, Bi, Construction Manager, contracts, client, clients, Excellent customer service, Fluent in English, English, Inspector,\ninterpretation, meetings, Microsoft Office Suite, management information system, Paradox, presentations, progress, project development, project\nmanagement, proposals, quality, Rendering, Spanish, specification, Supervisor, Team player, verbal communication skills, written",
    "experience": "01/1995 to 01/2001\nConstruction Manager / Project Coordinator / Inspector Company Name ï¼​ City , State\nMaintained management information system to provide data essential to planning and control of project development.\nScheduled, monitored and reported on the progress of approximately 90 assigned projects.\nEnsured adherence to time schedules and compliance with contracts requirements.\nResponded to all contractors' correspondence on behalf of the agency.\nMonitored the contractor' performance, quality and work progress.\nEnsured compliance with plans and specification for construction projects.\nReviewed and identified any necessary changes to the contract based on field conditions.\nProvided technical guidance to the development staff.\nMaintained accurate records and subsequent authorization of payments.\n02/1989 to 02/1994\nResident Engineer/Construction Proj Mgr Company Name ï¼​ City , State\nSpecial Projects Unit Construction Manager Supervised reconstruction/restoration of $8 million NYC recreational center.\nManaged approximately 15-20 jobs simultaneously.\nCoordinated and inspected contractor work daily.\nConducted weekly site coordination meetings and monthly progress meetings.\nCoordinated contractor work between local utility companies and City agencies.\nNegotiated all change order work and authorized contractor payments.\nManaged interpretation of blueprints and specifications for project contracts.\nEstablished job specifications and established project goals and procedures.\nEnsured projects' compliance with applicable New York City rules and regulations.\nEvaluated and approved contractors' monthly payments.\n01/1989\nArchitectural Assistant Company Name ï¼​ City , State\nPrepared construction documents and presentation drawings to support on-going projects.\nSupported all aspects of client service.\n01/1988\nGeneral Office Assistance / Drafter Company Name ï¼​ City , State\nAssisted in development of bids and proposals presentations for clients' review.\nPrepared construction documents to support on-going projects.\nEducation and Training\nMay 2016\nMasters : Historic Preservation Pratt Institute Historic Preservation\nBachelor of Science : Architecture City College of New York - School of Architecture Architecture\nAsbestos Supervisor Certificate Lead Inspector Certificate ATI - Asbestos & Lead Training Institute ï¼​ City , State\nInstitute of Design ï¼​ City , State Perspective and Rendering\nCertificate International Design Seminar, Poltechnico of Milan, Italy Certificate Mechanics Institute ï¼​ City , State\nActivities and Honors\nProfessional Women in Construction (PWC)",
    "languages": "Bi-lingual in Spanish and English."
  }
}