{
  "file_name": "44145704.pdf",
  "sections": {
    "general": "PROJECT MANAGER/INSTRUCTIONAL DESIGNER",
    "summary": "Dependable and resourceful Project Manager and Instructional Designer adept at organizing and developing quality courses for both in-seat,\nhybrid and online adult learners.\nHighlights\nMicrosoft Live Meeting\nHypertext Markup Language (HTML5)\nAdobe Connect\nCamtasia\nScreenr\nAdobe eLearning Suite 2.5 (to include Adobe Presenter, Captivate, and Dream Weaver)\nCanvas\nMicrosoft Office 1993-2007 (to include PowerPoint, Word, Excel)\nMoodle 1.9 and 2.4\nDropbox\nBlackboard\nVideo training development\nMRDS\nXenDesktop\nMicrosoft Office\nEC Council iLabs\nSharePoint\nVCASTLE\nZoom Web Conferencing\nAccomplishments\nContinues to developed curriculum for several Bachelor and Master Level courses, as well as NCPACE training courses.\nCompleted and earned the following certifications from Lynda.com:\nArticulate Storyline\nInstructional Design Essentials: Models of ID\nInstructional Design Essentials: Storyboarding\nInstructional Design Essentials: Working with SMEs\nIntroduction to Networking\nLearning Management Essentials (LMS) Fundamentals\nPractical Cybersecurity\nUp and Running with Articulate Storyline\nUp and Running with Canvas",
    "experience": "Project Manager/Instructional Designer 01/2011 to Current Company Name City , State\nManage projects/course development.\nDesign, develop, and update in-seat and online curriculum materials, as well as military CBT course.\nConduct assessment and analysis to identify new development needs and recommends training methods accordingly.\nEnsure design of deliverables address the instructional needs of the learners.\nAssure curriculum and delivery methods incorporate best practices in adult learning theories.\nWork with authors, publishers,and SMEs to develop in-seat, hybrid, and online course.\nDesign courses to comply with both organizational, military standards, 508 Compliance.\nWork within design and development processes and standards.\nCreate storyboards and communicate design ideas.\nDesign and produce instructional multimedia .\nDesign and develop instructor lead activities and Capstone courses.\nWrite and edit storyboard scripts for video and learning modules.\nDeveloped learning objectives.\nFacilitated content and quality assurance reviews.\nMaintained in-depth and up-to-date knowledge of the related fields of development.\nInstructional Designer 10/2009 to 01/2011 Company Name City , State\nDesigned, developed and updated a variety of course content learning solutions for military training support for eLearning, Instructor-led\ntraining, virtual training sessions, and self-study programs.\nConducted assessment and analysis to identify new development needs and recommends training methods accordingly.\nEnsured design of deliverables address the instructional needs of the learners.\nAssured training solutions incorporate best practices in adult learning theories.\nWorked with content development managers, authors, and SMEs to develop military training courses.\nDesigned courses to comply with both organizational, military standards, 508 Compliance.\nWork within design processes and military standards.\nCreated storyboards and communicated design ideas with Multimedia personnel.\nDesigned and produced facilitator and participant guides.\nDesigned and produced PowerPoint presentations.\nDesigned and developed instructor lead activities and Capstone courses.\nWrote and edited storyboard scripts for video and learning modules.\nDeveloped learning objectives.\nFacilitated content and quality assurance reviews.\nMaintained in-depth and up-to-date knowledge of the related fields of development.\nElementary through High School English & Writing Teacher. 08/2006 to 07/2009 Company Name City , State\nTaught elementary (all core subjects), and middle and high school English and writing.\nDeveloped and designed lesson plans and curriculum related to each subject area.\nProvided excellent customer service for students and parents, maintained ongoing communication with colleagues, team members, parents,\nand students.\nMaintained student records in an exceptionally organized manner.\nCreated and maintained knowledge of innovating technology, she created and maintained web pages for parent and student use.\nMiddle & High School English as a Second Language (ESL) Teacher. 08/2000 to 07/2003 Company Name City , State\nTaught middle school English and Writing as a second language to non-English speaking students.\nDeveloped and designed lesson plans and curricula related to each subject area.\nProvided excellent customer service for students and parents, while also maintaining ongoing communication between colleagues, parents,\nand students.\nMaintained student records in an exceptionally organized manner.",
    "education": "Masters of Education : Curriculum Design and Instruction; Specialization in Literacy February 2009 Lesley University City , State , United States\nof America\nCurriculum Design and Instruction, specializing in Literacy\nBachelors of Arts : English/French May 1997 Claflin University City , State , United States of America\nEnglish with a Minor in French",
    "skills": "•Technology Orientated\n•Team player, leader, and excellent collaboration skills\n•Creative and innovating\n•Extensive success in product development\n•Software Proficiency – VCASTLE, NetLab, XenDesktop, SharePoint, EC-Council iLabs\n•Blooms Taxonomy\n•Strong attention to detail"
  }
}