{
  "file_name": "48285304.pdf",
  "sections": {
    "general": "FINANCE MANAGER",
    "summary": "Skilled Operations Manager talented at improving team performance through innovative management techniques. Offers thoughtful, comprehensive\nand constructive feedback to staff members to promote productivity and company loyalty.\nHighlights\nOperations Management\nCustomer Relations\nPurchasing & Procurement\nFleet Management\nBudgeting & Forecasting\nAudits\nLogistics\nAccounting\nP&L Management\nBusiness Development\nQuality Assurance & Control\nCollection Management\nProficient in MS Excel, MS Access, MS Project, Quicken, MS PowerPoint, Inoviswork, SAP, Oracle ERP, Kronos\nAccomplishments\nIncreased output by 32 % through reorganization of locations to maximize efficiency.\nReduced staff turnover by 45% in one year by implementing several well-received team and morale-building programs.\nQualified location for 2 million dollar remodel by increasing sales 30% through retraining of sales team\nCreated critical KPIs to track and improve on-time delivery, customer issues and safety statistics.\nBoosted customer satisfaction ratings by 40 % in underÂ 4 months.",
    "experience": "03/2016 to Current\nFinance Manager Company Name ï¼​ City , State\nPartner with Product Management and Purchasing Team in determining financial impact due to product cost reductions, new product roll\nout, etc.\nPerformed financial statement audits of security broker dealers for purposes of SEC/FINRA purposes.\nCompleted monthly, quarterly and annual bank reconciliations for 11 small companies.\nAs appropriate, based on findings make proposal for operational changes (policy, procedures, processes, etc.) Fulfill responsibilities under\nOHSAS 18001, understand and fully support OHSAS 18001 system.\n02/2013 to 03/2016\nDistrict Manager Company Name ï¼​ City , State\nDetermine the hiring needs of the store, interview prospects, and bring on board store associates that will work courteously, efficiently, and\neffectively to meet the store's operational goals.\nDeveloped and managed annual operating budgets for 4 locations in the division.\nRecruited, hired and trainedÂ 20 new employees forÂ DistrictÂ ManagementÂ and Store Management\nEnsure operational policies and procedures are adhered to by all store personnel.\n06/2010 to 11/2012\nOperations Manager Company Name ï¼​ City , State\nEnhance the operational procedure, systems and principles in the areas of information flow and management, business processes and\nenhanced management reporting\nOrganize and intensify efficiency support services by ameliorating functions and coordinating communication between businesses and\nsupport functions\nPerform a meaningful role in long-term planning and establishment initiatives aimed at operational distinction\nSupervise overall planning systems, financial management and control Organizing the budget of the company in collaboration with the\ndirector.\n06/2001 to 06/2010\nGeneral Manager Company Name ï¼​ City , State\nIncreased profits by 20% in first year, resulting in one of the best possible ROI's.\nCut cost of goods sold by 13% by negotiating lower freight rates and increasing standards of product quality.\nIdentified need for comprehensive business management solutions.\nDeveloped training program for new employees that company implemented nation wide.",
    "education": "2008\nBachelor of Arts : Political Science Grand Valley State University ï¼​ City , State\n2012\nJ.D. : Criminal Law Duke University Law School ï¼​ City , State",
    "skills": "Accounting, Budgeting, budgets, budget, Business Development, business management, business processes, business solutions, Customer\nRelations, ERP, financial, financial management and control, Forecasting, hiring, inventory, Kronos, Logistics, director, management reporting, MS\nAccess, MS Excel, MS PowerPoint, MS Project, negotiating, Operations Management, Oracle, Organizing, personnel, policies, processes,\nProcurement, Product Management, progress, proposal, Purchasing, quality, Quality Assurance, Quicken, sales, SAP"
  }
}