{
  "file_name": "51349448.pdf",
  "sections": {
    "general": "SALES COORDINATOR",
    "summary": "Looking for a position as an illustrator in a company where my knowledge and skills can be utilize and enhance.\nHighlights\nMicrosoft Word,\nExcel,\nTime Management\nPhotoshop CS6\nStrong design sense\nInternet savvy\nHighly organized and quick learner\nConceptual thinker\nCreative and Artistic\nStrong leadership abilities\nTeam player.\nAccomplishments\nObtain high position in military to implement certain skill sets to work well with people in everyday life",
    "experience": "03/2016 to Current\nSales Coordinator Company Name ï¼​ City , State Â Able to operate material handling equipment (e.g. hand truck, pallet jack, forklift, etc.).\nÂ Tint paint, and match colors when applicable. Operate a computer and communicate via the telephone, although slightly hearing impaired. Poses\ngreat customer service skills, including problem solving and handling customer complaints. Â Good written and verbal communication skills. Â\n03/2016 to Current\nSecurity Guard Company Name ï¼​ City , State Secures premises and personnel by patrolling property; monitoring surveillance equipment;\ninspecting buildings, equipment, and access points; permitting entry..Prevents losses and damage by reporting irregularities; informing violators of\npolicy and procedures; restraining trespassers.Controls traffic by directing drivers.Completes reports by recording observations, information,\noccurrences, and surveillance activities.\n02/2008 to 02/2016\nMaintenance chief Company Name ï¼​ City , State\nIn charge of the daily Maintenance operation of preventive and corrective services for all of Alameda's/Hawaii Amphibious equipment\nRecord keeping of twenty 55 horse outboard engines.\nManaged 9 people to effectively implement their positions",
    "education": "1 2012\nGeneral Education Santa Rosa Junior College ï¼​ City , State\nBachelors : Fine Art Academy of Art University ï¼​ City , State\nFine Art",
    "skills": "Experience of 4 years in the field of designing as an illustrator\nProven ability to design layouts, logos and web sites\nProfound ability to plan, organize and manage the projects\nSound knowledge of the advance technologies and designing techniques\nExceptionally good communication skills\nAdditional Information\nSea Service Deployment\nMarines Corpse Good Conduct Medal t\nNATO Medal - ISAF Afghanistan\nGlobal War on Terrorism\nAfghanistan and Campaign National Defense Service Medal."
  }
}