{
  "file_name": "51769822.pdf",
  "sections": {
    "general": "HR SPECIALIST",
    "summary": "Energetic Administrative Assistant with 30+ years experience in high-level executive support roles. Organized and professional. Dedicated and\nfocused, who excels at prioritizing, completing multiple tasks simultaneously and following through to achieve project goals. Seeking a role of\nincreased responsibility and authority. Adept at managing multiple projects with ease using expert time management methods.\nHighlights\nStrong organizational, verbal and written communication skills.\nAdministration/\nAnalytical problem solving skills; ability to manage priorities and\nAccounting/HR.\nwork flow.\nAdministration / Office support Purchasing, Inventory (PO/PR)\nAccounting/HR: Payroll - Billing - Collection Sales Management\nIndependent (self-learner).\n/ Marketing /\nReal Estate / Leasing\nCreative, dedicated, flexible, reliable, detail oriented, and\nCommercial & Technical Translations Customer Service\ninnovative team player.\ncertified\nProficient in Microsoft Words, Excel, AS400, Outlook.\nAccomplishments\nDeveloped and implemented a new procedure in accounting by creating a spreadsheet for open balances (collection) and follow through weekly.\nHelped in the reduction of 30% in the cost of unpaid balances.",
    "experience": "HR Specialist\nJune 2014 to June 2014 Company Name ï¼​ City , State\nCoordinated regular and temporary interviews for line management.\nConducted reference check vetting on potential candidates.\nInteracted with potential employees, notifying them on application status and necessary information to complete application process.\nAssisted various departmental functions with payroll, employee relations and compensation files, filing confidential documents.\nLeasing Agent\nOctober 2012 to April 2014 Company Name ï¼​ City , State\nGreeting future residents, answering all questions regarding leasing, presenting models,.\ntaking applications, following up with guests' walk-in, filing, taking work-orders,.\npayments (rent and fees).\nAdministrative Assistant\nSeptember 2006 to October 2012 Company Name ï¼​ City , State\nSupported multiple level management team members (Initiated, coordinated, and executed administrative support to Branch Managers).\nAssisted Engineers and Project Managers with proposals, technical reports, invoicing clients, and collections.\nCompiled information and created spreadsheets for supervisor review, development and implementation of department systems and\nprocedures as needed.\nManaged supervisors' calendars and independently scheduled appointments.\nMaintained training program, training lists and reported on anticipated participation levels.\nPlaced calls to confirm registrations for training programs or to remind participants of event details.\nDeveloped strategic and operational plan to improve the work flow by re-evaluating priorities, resulting in increasing efficiency to meet\ndeadlines when sending out documents.\nDemonstrated a high level of professionalism in dealing with confidential information.\nImplemented a new procedure in accounting by creating a spreadsheet for open balances (collection) and follow through weekly.\nHelped in the reduction of 30% in the cost of unpaid balances.\nFrench Speaking Executive Assistant\nAugust 2005 to September 2006 Company Name ï¼​ City , State\nUpdated CEO calendar, coordinated meetings with French clients.\nBookkeeping duties.\nAbility to maintain and process clients files.\nExhibitor Services Representative\nAugust 2004 to August 2005 Company Name ï¼​ City , State\nAssisted Exhibitors with orders (office and show sites), freight billing, coordinated.\nwith foreman for the set up and striking of exhibitor booths.\nPayroll Clerk\nMarch 1999 to August 2004 Company Name ï¼​ City , State\nProcessed payroll weekly for 1500 employees (full time, part time, unions) using AS 400 payroll system.\nDemonstrated accuracy and fast pace to meet deadlines for payroll transmittals to Corporate.\nAudited hours and PTO information, processed new hiring, terminations, and all data changes to employee reports.\nW-2 and I-9 for new hires, performed various other payroll and bookkeeping functions.",
    "education": "BA : Administration Commercial Administration , 1982 University of Grenoble ï¼​ City , France\nMarketing\nCommercial English\nAccounting\nWork History\nCompany Name",
    "languages": "Fluent (speaking, reading, writing) in English (majored in commercial English), and French (native).",
    "skills": "Office support:\nAccounting, billing, bookkeeping, customer service, employee relations, filing, hiring, HR, Inventory, invoicing, Marketing, meetings, Excel,\nOutlook, Windows, Word, Payroll, PR, proposals, Purchasing, Real Estate, Sales Management, spreadsheets, supervisor, training programs,\nTranslations, written communication"
  }
}