{
  "file_name": "54101961.pdf",
  "sections": {
    "general": "SALES ASSOCIATE",
    "summary": "Actively seeking a Full Time position in Technology within an organization utilizing my skillset and innovation to grow in a success driven\natmosphere.\nHighlights\nWin10, 8, 7, Vista, XP, Server 2013, ipad, tablets Hardware: PC Setup/Configuration/Integration/ Printers, Monitors, Routers, Scanners,\nCables Software: IE 10,9,MS Suite, Adobe Reader, Firefox, Mozilla, Wi-Fi",
    "experience": "Sales Associate Nov 2011 to Current\nCompany Name ï¼​ City , State\nInteract and assist customers, co-workers, Loss Prevention and Management, take direction from supervisor on assigned tasks and notify\nupon completion, notify Loss Prevention of suspicious activity and safety hazards, answer phone, provide customer service on sales floor\nwhile assisting with recovery.\nMaterials Handler Jun 2008 to Mar 2009\nCompany Name ï¼​ City , State\nExtract parts from inventory for kits to be assembled on production floor, audits, notify supervisor of completed tasks, data entry, technical\nsupport.\nMailroom Clerk Oct 2007 to Feb 2008\nCompany Name ï¼​ City , State\nProcess incoming/outgoing mail via electronic processor, distribute interoffice mail, retrieve files for underwriter department, follow up with\nsupervisor with updates on progress, faxing, copying,.\nWarehouse Clerk Dec 2006 to Oct 2007\nCompany Name ï¼​ City , State\nAssist shipping manager prepare outgoing orders, assist supervisor verify incoming supplies from receiving dock and replenish back into\ninventory, record new inventory counts and follow up with supervisor to keep records accurate, replenish supplies to production floor for\nassembly, place supply orders via purchasing manager, distribute interoffice mail.",
    "education": "AS , Network Engineering 2017 Moorpark College Network Engineering\nAS , Computer Information Systems 2007 Moorpark College Computer Information Systems\n1994 Simi Valley High School Graduate",
    "skills": "Adobe, Cables, Hardware, copying, customer service, data entry, direction, faxing, IE, inventory, Loss Prevention, mail, Win, Monitors, PC\nSetup, Printers, progress, purchasing, receiving, Routers, safety, sales, Scanners, shipping, supervisor, technical support, phone, underwriter, Vista"
  }
}