{
  "file_name": "59962788.pdf",
  "sections": {
    "general": "HR EXECUTIVE\nProfessional Summary\nForward-thinking HR Generalist highly effective at adapting to evolving market plans and the needs associated with company expansion.",
    "skills": "C, C++, English, Hindi, Java, Languages, Microsoft Office, SQL, Visual Basic 6.0",
    "education": "2012\nMBA : Human Resource\nCrescent Business School - City , State\nEmphasis in Human Resources\nMinor in Systems\nIn a study of Professional in Human Resources certificate (PHR)\nOrganizational Training and Development seminar\n8.6 GPA\n2006\nHigh School : Computer Science\nLady Sivaswami girls Higher Secondary School - City , State\n7.1 Â GPA\n2010\nB.E : Computer Science Engineering\nLord Venkateshwaraa Engineering College - City , State\nAccomplishments\nOrganization Design & Development Project Management Compensation Management International Human Resource Management\nManagerial Behavior & Effectiveness System Analysis & Design Industrial Project Ashok Leyland (Indian automobile manufacturing\ncompany) Mar'12 - Apr'12 (2 Months) Developed a HR Metrics including a Drill to Detail option, allowing users to \"see the people behind\nthe numbers.\" Integrated trends requiring intervention and facilitated for internal benchmarking Incorporated the aspects of Training &\nDevelopment, Reward System, Benefits, Motivation, Corporate Social Responsibility & Safety for developing the balance score card The\nmetric and scorecard was put into use in the Ennore plant since May & the same was highly appreciated by the plants core team Ashok\nLeyland (Indian automobile manufacturing company) Feb'12 - Mar'12 (1 Month) Completed a Project on \"Organizational Climate\" in\n\"Ashok Leyland's corporate office, Guindy.\nPrepared & conducted a survey with the corporate office employees on the Environment, Management Effectiveness, Involvement,\nRewards and recognition & Commitment aspects Proposed solutions for the aspects where we were lacking behind than the internal\nbenchmarked value Experience (1 year 10 months) Dr.Kamakshi Memorial Hospital Pvt Ltd Nov'12 - Sep'14 Working in the core quality\nteam to obtain National Accreditation Board for Hospitals & Healthcare Providers (NABH) certification Revamping the organizational\nstructure & redesigning effective on boarding processes and tools to facilitate the integration of new employees Core Team member\nfacilitating the feasibility study of an integrated payroll package,EPF,ESI and all Statutory Compliances for the hospital employees.\nActing as a Training Coordinator cum Trainer.\nMaintaining leave records database, all employees credentials,personal records, Training tracker and training calendar etc.\nPreparation of SOP's, HR Manuals, Join score cards,Proposing & Salary increments,Preparation of salary statement.\nArranging and conducting Interviews, Initial Screening the candidates.\nPreparing and Issuing of HR Offer letters,Appointment letters.\nPreparing & Conducting Induction programme of new onboarding employees.\nProper Training upgradation programme for the employees & Evaluating the effective of training programmes.\nPreparation of KPI/KRA's for all the designation.\nAttend to Employee's Grievances & Complaints & provide guidance if necessary.\nInternship SAP implementation for Export department Studied the logistics business process in exports business of Ashok Leyland As core\nteam member prepared the order to cash and Make to deliver As-Is process for SAP implementation Search Engines & web crawling\nCompleted a project in web crawling for faster indexing & for enhancing the speed of search engines Extra Curricular Activities Completed\nCertified Associate in Project Management (CAPM) certification course from Project Management Institute(PMI) Attended Therapeutic\nCommunication Training.\nConducted a National-level workshop on \"Work Life Balance\" to staff and non-teaching staff of Crescent Business School.\nPresented a working paper on \"Industrial Relations in coca cola\" in Vels University.\nAttended a conference on \"Entrepreneurship management\" in ISBR Business School As an active member of HRD CLUB, was responsible\nfor arranging quarterly Conferences & alumni meetings Won the college level event in Tennikoit and acted as a Captain of the team."
  }
}