{
  "file_name": "64471954.pdf",
  "sections": {
    "general": "R\nHEALTHCARE CUSTOMER SERVICE REPRESENTATIVE",
    "summary": "Customer care representative position where my customer relations experience can be fully utilized to improve customer satisfaction and enhance\nthe company brand name.",
    "skills": "Telecommunications knowledge\nMicrosoft Office proficiency\nStrong problem solving ability\nTime management\nHigh customer service standards\nExcellent communication skills\nActive listening skills\nStrong problem solver\nCustomer service expert\nHIPAA compliance\nTelecommunication skills\nType 60 WPM\nReatail and Corporate",
    "experience": "Healthcare Customer Service Representative\nCompany Name Oct 2011 to Current\nHandle inbound calls from customers with inquiries and questions regarding their health insurance, wellness programs, prescription plans and\nhelp provide the best solutions for the customers' health and financial well-being.\nAssist in program development with new products and/or services.\nProcess one-time checking and credit card by phone payments.\nEvaluate information and options and select the alternative that best meet the requirement of the issue(s) presented.\nCustodian\nCompany Name May 2010 to Dec 2011\nEnsured spaces were prepared for the next day by taking out trash, tidying furniture and dusting surfaces.\nSwept and mopped floors and vacuumed carpets.\nWashed and sanitized toilets, sinks and showers and restocked disposables.\nSecured facilities after operating hours by locking doors, closing windows and setting up the alarm.\nCustomer Service Manager\nMay 2004 to May 2011\nAnalyzed statistics and compiled accurate reports.\nRecruited, mentored, and developed customer service agents and nurtured an environment where they can excel through encouragement\nand empowerment.\nKept accurate records and documented customer service actions and discussions.\nProvided services to customers by cashing checks, issuing money orders, assisting with refunds, and sending and receiving money grams.\nSupervised 20+ employees at a time, enforced company regulations and delegated daily assignments.\nEducation and Training\nDiploma : General Educational Rowan-Cabarrus Community College General Educational\nTraining and Onboarding : Healthcare Customer Service OPTUM Received certification for training new hires as they enter customer service roles"
  }
}