{
  "file_name": "67501448.pdf",
  "sections": {
    "general": "BUSINESS DEVELOPMENT COORDINATOR/EVENT COORDINATOR",
    "summary": "Dynamic and creative Business Development Coordinator with a successful career in marketing,promotions,public relations,project and\ncommunications management.\nHighlights\nEvent Management Social Networking\nNegotiation skills Online Marketing Strategies\nCustomer Targeting Â Teamwork\nPolyglot Problem Solver",
    "skills": "Responsible and reliable,Highly motivated for career advancement,Able to deal in a mature manner with problem solving,Willing to learn and\naccept constructive criticism,Willing to help,Good attitude around others,Calm and focused,Good knowledge of social media,Able to use own\ninitiative and work as part of a team,Excellent communication and organizational skills,Versed in all aspects of marketing campaigns from concept\ndevelopment to execution and launch,Skilled marketing professional focused on exceeding revenue goals,Builder of strategic partnership,New\ncustomer acquisition expert who emphasizes a mix online and offline marketing strategies.",
    "experience": "Company Name November 2013 to Current Business Development Coordinator/Event Coordinator\nCity , State\nIdentify Customer care needs.Networking during events and established good and strong relations, in particular with the main\nBusinessassociations and Companies of the city.Screen potential Business deals by coordinating requirements,developing and negotiating\ncontracts,integratingcontract requirement with business operations.Co-develop and implement strategic marketing.Identify specific\nopportunities to direct marketing efforts toward particular based practices areas and clients.Deal with the Chamber of Commerce and The\nItalian Consulate.Researching markets to identify opportunities for events.Leasing with clients to ascertain their precise event\nrequirements.Producing detailed proposal for events.Agreeing to,and managing a budget.Identify professional and trade associations with\nwhich the company should affiliate.Assist with the development of proposals and responses.Identify and evaluate cross-marketing\nprospects, assist with cross-marketing initiatives, and track success ratio.Coordinate content for web, print materials, bc logo etc.\nUpdate and edit firm-wide business development materials (including brochures, email alerts and website).\nCollaborate with others in the marketing department to ensure integrity of the firm brand.\nProtects organization's value by keeping information confidential.\nUpdate job knowledge by participating in educational opportunities,reading professional publication,maintaining personal networks,\nparticipating in professional organization.\nEnhance organization reputation by accepting ownership for accomplishing new and different requests, exploring opportunities to add value\nto job accomplishments.\nIf Needed Assistant Manager in Opening/Closing of the restaurant.\nCompany Name January 2008 to October 2013 Dental Hygienist\nCity , State\nPrepares treatment room for patient by adhering to prescribed procedures and protocols.Prepares patient for dental hygiene treatment by\nwelcoming, soothing, seating, and draping patient.Provides information to patients and employees by answering questions and\nrequests.Maintainsinstrumentation for dental hygiene treatment by sharpening, sterilizing, and selecting instruments.Completes dental\nprophylaxis by cleaning deposits and stains from teeth and from beneath gum margins.Detects disease by completing oral cancer screening;\nfeeling and visually examining gums; using probes to locateperiodontal disease and to assess levels of recession; exposing and developing\nradiographic studies.Arrests dental decay by applying fluorides and other cavity- preventing agents.Maintains patient appearance and ability\nto masticate by fabricating temporary restorations; cleaning and.\npolishing removable appliances; placing, carving, and finishing amalgam restorations; removing cement fromcrowns and bridges.Educates\npatients by giving oral hygiene and plaque control instructions and postoperative instructions;providing reminders of time of next dental\nhygiene visit.Documents dental hygiene services by recording vital signs and medical and dental histories; charting inpatient\nrecords.Maintains patient confidence and protects operations by keeping information confidential.\nCompany Name October 2003 to August 2008 Waitress/Bartender/Cashier/Floor Manager\nCity , State\nDUE srl - Turin Italy Customer care.\nAssigned tasks to associates, staffed projects, tracked progress and suggest new ideas.Planned and executed events and marketing\nprograms.Developed and executed marketing programs and general business solutions resulting in increased companyexposure, customer\ntraffic, and sales.Cash out.monthly meeting with the staff and owners.Mix and serve drinks to customers directly or through waitstaff.Take\norders and serve food and beverages.\nThe DUE srl was a company of multiple business in Turin (ITALY):\nGRAN BAR Piazza Gran Madre di Dio,2 (Wine Bar)\nHAFA CAFE' Via Sant'Agostino, 23/C (Moroccan Bar)\nJAM CLUB Via Murazzi del Po,19 (Bar-DiscoNightclub)\nROCK CITY Corso Dante Alighieri, 19 (DiscoNightclub)\nCashier and Bar Coordinator during big music events, 12/2006 to 10/2011Movement Torino Music Festival - Turin Italy Under the\ndirection of the immediate supervisor, I was coordinating cashier and bar services.Organize, distribute and verify the work of\nothers.Administrative and accounting duties.Resolve cashier and Bar problems.\nThe Movement Torino Music Festival is a big event usually attended by 6000-15000 people.",
    "education": "LICEO LINGUISTICO EUROPEO CADORNA 2002 High School Diploma : Foreign Languages City , ITALY",
    "languages": "ITALIAN (Mother Tongue)\nENGLISH\nSPANISH\nFRENCH\nBachelor of Science\nDENTAL HYGIENE, 2007 UNIVERSITÃ€' DEGLI STUDI DEL PIEMONTE ORIENTALE AMEDEO AVOGADRO - NOVARA ITALY\nMaster in social media and digital marketing . TURIN ITALY"
  }
}