{
  "file_name": "68216398.pdf",
  "sections": {
    "general": "PLANT OPERATOR",
    "summary": "Certified Plant Operator with 6 years in Cryogenic Air Separation Unit Plant with proven ability to meet production deadlines. Eleven years\nmilitary training and a Dedicated System Operator Versatile plant operator well-versed in monitoring and inspecting plant equipment.\nHighlights\nMaximizing Productivity and Profits\nResourceful\nQuality Assurance for product\nPunctual\nLeadership/Supervision\nHonest\nProfessionalism\nAttention to Detail\nDependable\nTeam Player\nHardworking\nAccomplishments\nOperation of a $27 million Air Separation Unit Plant\nMechanical, Chemical EngineerTraining\nAdvanced Oxygen/Nitrogen Training\nLeadership Training\nSafety Training\nRecruit Basic Training\nTow Tractor (aircraft)\nTow Tractor ( equipment)\nForklift\nCDL (expired)",
    "experience": "Plant Operator 06/2009 to 02/2015 Company Name City , State\nMonitored process units and quality control testing performance for plant processes and water quality sampling. Operate and maintained filtration\nprocess units and water system control equipment. Made sound and logical judgments regarding process changes. Closely inspected equipment for\nany mechanical or safety issues. Reviewed the daily computer log and reported any inaccuracies in the process. Responded to and initiated proper\ncorrections to process alarms. Routinely drained unwanted fluids. Coordinated ongoing maintenance and housekeeping of the plant. Read\nautomatic gages at proper intervals to determine flow rate of gas. Recorded daily tank inventory. Daily plant inspections. Started up, shut down\nand checked plant processes. Directed routine preventative maintenance such as adjustments, cleaning and painting equipment. Maintained correct\ntemperature, levels and pressures on process systems and equipment. Recorded all operating data on daily work sheets from laboratory analysis\nand flow metering equipment. Communicated effectively with operators and supervisors on a technical level. Executed field service work including\nall plant motor, compressor, chiller, piping, valve maintenance and repairs with little to no supervision. Performed quality control tests on lab\nequipment and lab analysis. Interpreted results of process control analysis and made adjustments to optimize plant performance. Maintained\ncurrent knowledge about the latest operating and maintenance practices with continuing education courses. Trained new operators and\nimplemented new division operator training program to improve retention rates and increase production.\nSales Associate 01/2008 to 05/2009 Company Name City , State\nSales of all plumbing indoor and outdoor materials.\nselling plumbing supplies and material, unloading trucks and stocking shelves.\nAuto Mechanic 01/2007 to 03/2008 Company Name City , State\nService cars and trucks, tire repair, brake replacement, oil changes, transmission flush, radiator flush, all auto repair.\nAviation Structure Mechanic 09/1996 to 07/2007 Company Name City , State\nMaintain liquid/gaseous oxygen and nitrogen systems. Remove, inspect and re-install oxygen components. Replenish and service liquid/gaseous\noxygen and nitrogen containers, tanks, and holding carts. Daily safety inspection on aircraft and supporting oxygen and nitrogen systems. Apply\noperating procedures for servicing of aircraft, transfer trailers or direct filling equipment with liquid/gaseous oxygen and nitrogen. Perform ground\nchecks and correct operation, mechanical work and upkeep of all aircraft oxygen and nitrogen systems and support equipment. Maintain aircraft\nsafety equipment, canopy and environmental systems. Maintain aircraft fire extinguishing systems.\nSupervise 7 to 15 person work group. Use and supervise the use of computers for record keeping, reports, and inventories. Troubleshoot and\nrepair malfunctioning equipment. Train subordinates in operation, maintenance, and repair of oxygen and nitrogen, canopy, environmental, fire\ndetection and suppression and egress systems. Maintain shop publications, files, technical directives and manuals. Use trucks, forklifts and all\nground support equipment. Maintain liquid/gaseous oxygen/nitrogen systems and safety equipment. Train, supervise personnel on rules and\nregulations, supervise personnel and maintain 15 to 45 aircraft.",
    "education": "2008 University of Montana City , State\nMechanical Classes.\n2005 Navy City , State\nMultiple education courses and training within the Navy.\nHigh School Diploma Trapper Creek High School City , State",
    "skills": "Operating a Air Separation Unit to produce FDA quality Oxygen, Nitrogen, and Argon liquids.\nTroubleshoot/Maintain/Repair all motors, pumps, compressors, heat exchangers, piping and electrical components within plant site."
  }
}