{
  "file_name": "69155584.pdf",
  "sections": {
    "general": "SALES ASSOCIATE",
    "skills": "Motivated Seller Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â\nCustomer Service Oriented Â Â Â Â Â Â\nAttention to Detail Â Â Â Â Â Â Â Â Â Â Â Â Â\nQuick Learner Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â\nRetains Information with ease Â Â Â\nCommitment to Professionalism\nPersuasive Communicator Â Â Â Â",
    "summary": "Motivated strategic sales professional with three years of experience. Focused, driven and detail oriented with great communication skills. Works\nwell as an independent associate or in a team environment. Looking to join a team of hardworking individuals working towards the same goal.Â",
    "experience": "10/2015 to Current\nSales Associate Company Name ï¼​ City , State\nHelped lead the store to a 15% increase for both years employed.Â\nApproach browsing customers and initiate conversations to determine buying preferences.Â\nRecommend specific styles based on customers footwear needs.\nProperly took measurements of the customers foot and inquired about any ailments.Â\nRecommended additional items to increase sales and multiples.\nProvided a level of customer service regardless of difficultly level.\nConsistently in the top for sales each month and kept 'perfect numbers'.Â\nMaintained contact with regular clients and often requested by name.\n12/2014 to 10/2015\nBridal Consultant Company Name ï¼​ City , State\nUsed active listening skills as well as knowledge of merchandise to select dress options for brides, and provide feedback to encourage them\nto purchase.\nMaintained communication post-sale with brides to continue building rapport and ensure optimal customer service.\nConsistently delivered 5-10% over monthly plan goals for length of employment.Â\nKnowledgeable in Bridal fashion, specifically with Maggie Sottero, Casablanca Bridal, David Tutera Bridal, The Dessy Collection, Alfred\nAngelo, Bill Levkoff, Mori Lee.\nAccurately measured and sized, brides and bridal party using various designer size charts.\nExcelled assisting non-traditional customers.Â\n06/2010 to 12/2014\nWaitstaff Company Name ï¼​ City , State\nGenerated top sales ($2000+ per evening) by marketing nightly specials during high volume days (Fridays, Saturdays and Sundays)\nTrained new server staff brand operations, restaurant compliance and customer expectations. One of two head trainers.\nSuccessfully promoted additional drink and menu items to guests to increase product sales.\nEducated existing employees when new standards were rolled out.\nAssured customer happiness through friendly, competent service\nEnsure servers have performed end of night duties accurately.\nEducation and Training\n2006\nHigh School Diploma Stevens High School ï¼​ City , State , USA\nBusiness Management Black Hills State University ï¼​ City , State , USA"
  }
}