{
  "file_name": "73030450.pdf",
  "sections": {
    "general": "SENIOR NETWORK SECURITY ENGINEER\nhttps://www.linkedin.com/in/dilip-nr/\nProfessional Summary\nOverall 7+ years of experience in Network and Security Engineering which includes strong hands-on experience with Palo Alto Firewalls, Cisco\nASA Firewalls, Check Point Firewalls along with comprehensive working knowledge of Load Balancers, Wireless networking, VMware and Data\ncenter management. Areas of expertise include designing manageable networks, Threat prevention and Management, routing, switching,\ntroubleshooting network performance issues and documentation. Overall 7+ years of experience in Network and Security Engineering which\nincludes strong hands-on experience with Palo Alto Firewalls, Cisco ASA Firewalls, Check Point Firewalls along with comprehensive working\nknowledge of Load Balancers, Wireless networking, VMware and Data center management. Areas of expertise include designing manageable\nnetworks, Threat prevention and Management, routing, switching, troubleshooting network performance issues and documentation.",
    "skills": "AD, ADS, anti-virus, Antivirus, Aps, basic, BGP, cabling, CLI, Cisco 2, Cisco 3, Cisco IOS, Cisco, Cisco Routers, Citrix, content, encryption,\nclient, decryption, designing, DHCP, Disaster Recovery, documentation, EIGRP, engineering support, ethernet, event management, fast, features,\nFirewalls, Firewall, Frame-Relay, FTP, Gateways, gateway, GUI, IDS, inspection, IP, LAN, logging, loss prevention, MAC, managing, Access,\nMail, Migration, enterprise, NAC, Network Access Control(NAC), Network administration, network servers, network, Networking, Networks,\nNext, OS, optimization, OSPF, PCI, policies, policy analysis, protocols, Proxy, requirement, router, Routers, Routing, servers, SNMP, SSL,\nSwitches, Cisco switches, TCP/IP, technical support, technical assistance, Technical documentation, Troubleshoot, troubleshooting, upgrades,\nupgrading, View, VPN, VISIO, VM, web servers, Wide Area Network, WAN, wireless LAN",
    "education": "Master's Degree : Computer Science Wright State University - State Computer Science\nBachelor's Degree : Electronics and Communications JNTU - Electronics and Communications",
    "certifications": "CCNA\nCCNP\nPalo Alto ACE"
  }
}