{
  "file_name": "75286906.pdf",
  "sections": {
    "general": "ACCOUNTANT",
    "summary": "Experienced, highly motivated work ethic, with results-driven professionalism, recognized for commitment to excellence, and demonstrates\nexpertise in communicating and collaborating with, peers, and clients. Portrays excellent business acumen, and successfully provide accurate\nAccounts Receivables, Collections and Accounts Payable initiatives that achieves targeted company goals. Self-motivated professional, able to\nwork independently or in a team environment, demonstrating broad based and transferable qualifications.\nHighlights\nExtensive knowledge of Microsoft Windows computer systems and Mac operating system.\nAccount reconciliation\nexpert\nProficient in Microsoft Office (Word, Excel, Power Point).\nGeneral ledger accounting\nFlexible team player\nBasic experience with QuickBooks Enterprise Solutions 9.0, Sage/MAS Software, Peachtree, and Microsoft\nAccess.",
    "experience": "Company Name January 2010 to November 2013 Accountant\nCity , State\nManaged over 10 million per month in revenue.\nAccurately applied payments to vendor accounts.\nResearched and resolved incorrect payments, EOB rejections, and other issues with outstanding accounts.\nSuccessfully boosted collections from 40% to 90% within 2 years.\nTrained new and existing employees on all new procedures and computer programs.\nRan monthly aging reports to compile billing statements for vendors for outstanding invoices.\nUtilize the following: HCFA (CMS 1500)/ICD-9/CPT/HCPCS Coding and UB-04 to prepare and submit claims for MLTC billing.\nEnsure claims are entered and submitted with 48 hours of receipt.\nRun A/P checks for vendor payment using an internal software RealWorld.\nPrepare A/P checks for signature.\nResponsible for running reports for month-end and year-end closing, reconciliation of the GL and journal entries.\nInsure office practices are in compliance with HIPAA regulations.\nDaily use of HHA Exchange, Santrax, Crescent programs.\nInvestigated and resolved discrepancies in monthly bank accounts while under tight deadlines.\nCompany Name March 2006 to November 2008 Accountant\nCity , State\nResponsible for follow-up and explanation of AX, VI & MC credit card accounts and issue Debit Memos to travel agencies for all\nchargeback's debited to EL AL Israel Airlines.\nHandled large volumes of credit card disputes (Inquiries & Chargeback's) by communicating with the credit card department, travel\nagencies and passengers.\nCreated an Excel database in order to update disputes log as they are solved.\nAssisted the supervisor with month end and year end close.\nIncluding but not limited to preparing and entering journal entries, running reports and reconciling airline tickets in the database.\nReconciliation of accounts, such as, Airline Tickets, Personal Expense Accounts, Petty Cash Accounts and more.\nCreated a company procedure manual and trained new and existing coworkers how to do the job according to the new procedures.\nMade sure that the department deadlines are met.\nHandled all aspects of reconciling general ledgers.\nResponsible for checking and paying all personal expenses to employees.\nPerformed payroll for hourly employees using the ADP system.\nCompany Name January 2003 to August 2005 Bookkeeper\nCity , State\nAssist in accounts payable/accounts receivable.\nMaintain spreadsheets and records of store sales and expenses.\nEnsure proper handling of customer calls.\nContact customers to collect money owed.\nPerform various administrative duties.\nReconciled bank statements.\nEnter invoices.\nCompany Name November 2013 to Current Accountant\nCity , State\nReduced closing time for monthly and quarterly close by implementing new consolidation procedures.\nAnalyzed costs and revenues to project future trends.\nReceived, recorded, and banked cash, checks, and vouchers as well as reconciled records of bank transactions.\nCompleted monthly, quarterly and annual bank reconciliations for 11 subsidiary companies.\nReviewed book entries to ensure accuracy of the G/L.\nPrepared monthly and annual expense forecasts, including any necessary recommended action required to manage costs to achieve budget.\nPost journal entries in MAS200, the company general ledger accounting software.\nAssisted management with preparation of month-end financial statements, cash flow statements, budgets.\nCompany Name September 1999 to November 2002 Assistant Bookkeeper\nCity , State\nAssist with payroll processing.\nAssist with accounts payable/accounts receivable.\nPrepare and verify bank deposits, balancing receipts and sending cash, checks or other terms of payment.\nMaintain organizations record keeping.\nPrice or re-price merchandise as necessary.\nHandle merchandise returns and exchanges within company guidelines.\nCustomer service, both on the sales floor and in assigned departments.\nComplete daily paperwork within company guidelines.",
    "education": "City University of New York, Brooklyn College 6 2006 Bachelor of Science : Accountancy City , State Accountancy\nKingsborough Community College 6 2001 Liberal Arts City , State GPA: Dean's List for Excellence in Academic Achievement at Brooklyn\nCollege. Completed ADP Payroll Course. Liberal Arts Dean's List for Excellence in Academic Achievement at Brooklyn College. Completed\nADP Payroll Course.",
    "languages": "Bilingual English /Russian",
    "skills": "Account Management, accounts payable, accounts receivable, administrative, ADP, A/P, Bank Reconciliation, Basic, Billing, Closing, CMS,\nCPT, credit, Customer service, database, Debit, Fluent in English, GL, ICD-9, Invoicing, Mac, Medical Billing, Microsoft Access, Excel,\nExchange, money, Microsoft Office, office, Power Point, Microsoft Windows, Word, Enterprise, operating system, Payroll, payroll processing,\nPeachtree, Coding, QuickBooks, reconciling, record keeping, Russian, sales, spreadsheets, Staff Training, supervisor, VI, year-end"
  }
}