{
  "file_name": "81011612.pdf",
  "sections": {
    "general": "GRAPHIC DESIGNER",
    "summary": "Enthusiastic student majoring in Chemistry; great at performing many task in a timely matter and as efficient as possible. Strong background in\ncomputer tasks and data analysis as well as business management.\nHighlights\nGeneral Chemistry and Organic Basic HTML coding, Microsoft Office, 3D Chemistry Laboratories including synthesis, animation, database\nanalysis. purification, and extraction. Inventory management and sales/profit IR spectroscopy as well as analyzing NMR analysis using SQL\nserver and various POS and Mass Spec. data. software. Graphic designing using Photoshop and Illustrator.",
    "experience": "Graphic Designer\nAugust 2009 to March 2013 Company Name - City , State\nIn charge of advertising and designing and publishing Point of Sale materials.\nGeneral Manager\nAugust 2009 to August 2011 Company Name - City , State\nInstalling POS systems, computer networking, fuel inventory management, and Payroll management.\nGeneral Manager\nMarch 2006 to October 2014 Company Name - City , State\nTeam/ scheduling/ payroll management.\nAccomplishments · Eight year in business management in which I managed to lower the cost of good and increase sales and profit.\nIn charge of Sales operations such as ordering, inventory, and customer service.",
    "education": "Chemistry , 2015 El Camino College - City , State GPA: Recipient of Edison International Green Job Scholarship. · Member of the El Camino\nChemistry Club. · Member of the MESA, Mathematics, Engineering, Science Achievement Program. · Recipient of Honor Transfer Student\naward. Chemistry Recipient of Edison International Green Job Scholarship. · Member of the El Camino Chemistry Club. · Member of the\nMESA, Mathematics, Engineering, Science Achievement Program. · Recipient of Honor Transfer Student award.\nMolecular, Cellular, and Developmental Biology , 2017 University Of California Los Angeles - City , State , USA",
    "skills": "3D, Photoshop, advertising, animation, business management, Chemistry, computer networking, customer service, database analysis, designing,\nGraphic, Basic HTML, Illustrator, Inventory management, inventory, materials, Microsoft Office, NMR, Payroll, POS, profit, coding, Sales,\nscheduling, SQL server"
  }
}