{
  "file_name": "84356308.pdf",
  "sections": {
    "general": "FINANCE MANAGER\nAccomplishments\nTransfer Pricing and Tax seminars, domestic and international, conducted by E & Y and KPMG IFRS, conducted by Institute of Chartered\nAccountants of Pakistan (ICAP) Balanced Score Card- A tool for strategy execution, conducted by ICAP Sukuk- the most rapidly\ngrowing and widely accepted Islamic structure, conducted by ICAP Making Strategy Happen- an intensive immersion into the world of\nStrategy Execution, conducted by MIH Training Academy, a division of Naseba and certified by Institute of Leadership & Management.\nProfessional Summary\nCorporate finance executive and CPA offering 16 years of experience with the wealth of strategic and operational knowledge. Wide-ranging cross\nfinancing experience in auditing & assurance, financial and advisory services with big 4 professional firms (Deloitte & Touché), lead IPO and\nM&A transactions. Strong expertise in public reporting (through Capital Market Authority), capital market transactions, strategic negotiations and\ninternational business.\nProven ability in managing and motivating teams of loyal and productive employees. Excellent leader with a track record of problem solving, and\nconsistently drives bottom-line performance, efficiency, process and profit improvements and enhanced internal controls. Attained well-recognized\nresults as a key advisor to the CEO, member of the senior executive team of a public listed company.\nAffiliations\nBachelor of Science (B.Sc.) from University of the Punjab, Pakistan Member of Institute of Certified Public Accountants of Pakistan Certified\nPublic Accountant (CPA), Membership No. M647 Fellow Member of Chartered Institute of Cost and Management Accountants of Nigeria Cost\nand Management Accountant (FCMA), Membership No. 509 Associate Member of Saudi Organization of Certified Public Accountants Certified\nPublic Accountant (CPA), Membership No. 3664 Associate Member of Association of Certified Public Accountants - UK Chartered Accountant\n- Intermediate (CA, Intermediate-Pakistan)",
    "skills": "Accounting, Accounts Payable, Accounts Receivable, Acquisitions, Administrative, Ad, Auditing, Budgeting, budget, client management,\nContracts, Contract Negotiation, Corporate finance, CPA, client, clients, clients i, decision making, Due Diligence, ERP, senior management,\nfeatures, Finance, financing, Financial, financial operations, Financial Planning, financial reports, Financial Reporting, financial statements,\nForecasting, GL, HR, insurance, international business, Investment Management, leadership, managing, management reporting, Market, meetings,\nMergers, MS Excel, negotiations, next, PAGE 2, Performance Analysis, pricing, problem solving, profit, Project management, quality, reporting,\nretail, Risk Management, sales, Strategic, strategic planning, tax compliance, tax, Treasury, Valuation",
    "education": "Bachelor of Science : Mathematics 1997 University of the Punjab - City\nCertified Public Accountant -CPA : Accounts, Audit and Finance 2012 Institute of Certified Public Accountants - City",
    "certifications": "Fellow Member of Chartered Institute of Cost and Management Accountants"
  }
}