{
  "file_name": "88907739.pdf",
  "sections": {
    "general": "CONSULTANT\nProfessional Summary\nHigh-achieving management professional and effective consultant possessing excellent communication, organizational and analytical capabilities with\nabout 4 years of experience in devising innovative strategies and solutions to resolve complex business challenges. Adept at managing projects,\nvendors, analyzing organizational operations, and performing customer journey, competitor and gap analysis.\nHigh-achieving management professional and effective consultant with excellent communication, organizational and analytical capabilities and about\n4 years of experience in devising innovative strategies and solutions to resolve complex business challenges. Adept at managing projects, vendors,\nanalyzing organizational operations, and performing customer journey, competitor and gap analysis.",
    "skills": ".NET, academic, ADA, Adobe, Apple, approach, Automation, business development, Business Process, Business Strategy, Consulting, content\nmanagement, Conversion, Client, Data Analysis, E-Commerce, senior management, Financial, financial analysis, functional, Google Analytics,\nGovernment, Hub, IBM, International Business, investments, IP, Marketing plan, market research, Market Strategy, marketing, market, MBA,\nC#, Excel, Microsoft Office Suite, Power Point, Word, Network, Object Oriented Analysis and Design, optimization, policies, process\nimprovement, Project Management, proposals, quality, Requirement, Research, RFP, Scrum, SDLC, Speech, MS SQL, Strategy, Strategy\nDevelopment, Vendor Management, Vendor Management, Visio, websites\nBusiness skills: Business Strategy, Product Strategy, Consulting, Data Analysis, Gap Analysis, Customer Journey Analysis, Competitor\nAnalysis, Market Research, Requirement Gathering,Product Management, Vendor Management\nTools: Balsamiq, ALM Octane, Agile Manager, Trello, Version One, Microsoft Office Suite, Visio\nMethodologies: Agile, Kanban, Lean, Human Centered design, Design Thinking",
    "education": "Master of Science : Software Management Carnegie Mellon University - 2014\nRecipient of the Software Management Fellowship for academic excellence at Carnegie Mellon University Selected by Chief Operating Officer to\nconsult on automation strategies for the product offerings [\nMaster of Science : Software Management Carnegie Mellon University - 2014\nRecipient of the Software Management Fellowship for academic excellence at Carnegie Mellon University, GPA:3.8\nMBA : International Business Institute of Technology & Management - 2012\nDistinction - First Class, GPA: 4.0\nMBA : International Business International Business Institute of Technology and Management India GPA: 4.0"
  }
}