{
  "file_name": "93828034.pdf",
  "sections": {
    "general": "WEB DEVELOPMENT COORDINATOR\nHighlights\nAdobe Photoshop, Acrobat, Dreamweaver *Content Management Systems (CMS) *MS Office (Word, Excel, PowerPoint, Outlook) *Quark\nXpress, Interactive Designer\nAccomplishments\nNational conference presenter, Health Care Internet Conference: Leading the Digital Transformation, Nov.\n2014 National conference presenter, Health Care Marketing and Physician Strategies Summit, May 2014 Interactive Media Awards (IMA)\nBest in Class Award for CentraCare web site, 2013 Graduate, St.\nCloud Area Chamber of Commerce Leadership Development Program, 2007 Producer credit for 1999 Telly Award-winning and Aegis\nAward-winning video project, \"Renae's Story\" Writer/creative director/producer credits for four Healthcare Marketing Report Advertising\nAwards (national competition), 1999-2000 Writer/producer credits for six Lake Superior Ad Club (American Advertising Federation)\nCitations of Excellence, 1995-97.",
    "experience": "01/2012 to Current\nWeb Development Coordinator Company Name ï¼​ City , State\nDirect the strategic development of CentraCare Health web properties Consistently deliver a rewarding user experience (UX) with web-\nbased content, services and features Develop social media strategies and manage content assets on social platforms Actively monitor,\nevaluate and report on web analytics; assess successful measures and implement changes Collaborate with executives, leadership and staff\nto achieve best in class digital content and services Spearhead efforts to launch a consumer-focused, health and wellness blog Implement\nnew online features to promote physicians and medical staff Create educational materials and conduct software training for staff Manage,\ninspire and motivate web department staff on ongoing enhancements to our digital footprint.\n01/2000 to 01/2012\nWeb Marketing Specialist Company Name ï¼​ City , State\nDirected and implemented health system web initiatives Built and maintained close relationships with health system leaders/stakeholders on\nweb-related projects Evaluated and recommended content and features for health system web site Measured and increased web site traffic\nSuccessfully managed development and guided the launch of key consumer-focused web features, including online appointment requests,\nprescription refills and bill payment Acted on executive leadership's goal to be transparent with our quality and pricing data, and became the\nfirst in Minnesota to publish this data on our web site.\n01/1997 to 01/2000\nMarketing Specialist Company Name ï¼​ City , State\nDeveloped, implemented and evaluated integrated marketing and advertising strategies for the hospital and key departments/product lines.\nManaged and directed marketing efforts, special events, educational programs and other promotional activities.\n01/1996 to 01/1997\nSpecial Events & Promotions Coordinator Company Name ï¼​ City , State\nDeveloped and coordinated special events and promotions for agency clients.\nPrepared marketing proposals and budgets.\nManaged and coordinated creative department projects and production efforts.\n01/1994 to 01/1996\nAssociate Creative Director Company Name ï¼​ City , State\nDeveloped targeted marketing strategies and creative direction for agency clients.\nManaged and coordinated production efforts.\nProvided award-winning copywriting for ad campaigns, articles, promotional brochures, newsletters and targeted campaign materials for\nagency clients.\n01/1993\nSales Consultant Company Name ï¼​ City , State\nPromoted, sold and increased market share of national product lines distributed by the company.\nCoordinated educational and trade show events.\nServed as a liaison between product manufacturers and customers.",
    "education": "1997\nMaster of Arts degree : Communicating Arts mass communications University of Wisconsin-Superior ï¼​ State GPA: GPA: 3.9 Communicating\nArts mass communications GPA: 3.9\n1992\nBachelor of Science : Mass Communications broadcast and international studies Bemidji State University ï¼​ City , State GPA: Dean's list, NCAA\nDivision III hockey cheerleader GPA: 3.4 Mass Communications broadcast and international studies Dean's list, NCAA Division III hockey\ncheerleader GPA: 3.4\nProfessional Affiliations\nTalented digital content manager with more than 20 years of experience and success across the marketing and communications discipline. Highly\nskilled in web content development, SEO, web analytics, emerging media and digital marketing, as well as traditional marketing and\ncommunications strategies. Proven leader in connecting key audiences to desired products, services and information. Keen understanding of health\ncare industry operations and practices.",
    "skills": "Acrobat, Dreamweaver, Adobe Photoshop, ad, advertising, Agile, agency, brochures, Budget management, budgets, CMS, content, Content\nManagement, copywriting, creative direction, clients, data analysis, Detail-oriented, E-business, educational materials, educational programs, e-\nmail, special events, features, UX, Leadership, marketing strategies, marketing, market, materials, Media planning, Excel, MS Office, Outlook,\nPowerPoint, Word, negotiator, newsletters, prescription refills, pricing, project management, proposals, purchasing, quality, Quark Xpress,\nResearch, software training, Strategic development, Vendor relations, web site, articles"
  }
}