{
  "file_name": "94417768.pdf",
  "sections": {
    "general": "SENIOR PRODUCT DESIGNER\nProfessional Summary\nAs a proven, experienced product designer I am involved in every phase of product design cycles from initial concept to post-production.\nI cost reduce products and expand existing product lines by developing numerous patentable items. Call me if you desire a mature,\ndependable leader having solid, practical experience with an eye to the future and functional marketability.",
    "skills": "Art, assembly, AutoCAD, Brochure, computer literate, databases, debugging, product design, desktop publishing, drafting, Estimating, freehand,\nDrawing, Layout and Design, Layout, Logos, Director, marketing, materials, mathematics, Mechanical, Works, Modeling, personnel, processes,\nresearching, routing, sales, shipping, sketching, spreadsheets, website development, word processing\nAdditional Information\nMember National Honor Society Varsity Wrestling, Cross Country, Baseball Rotary October Boy of the Month Outside Interests Family\nHusband, Father of Three Children with Five Grandchildren Church Lay Leader and Administrative Council Member",
    "education": "Williamsport Area Community College 1979 City , State\nAssociate of Arts : Advertising Art GPA: Dean's List GPA: 3.2 Minors\nMarketing\nGraphic Design\nDrafting\nElective Emphasis in mathematics\nAdvanced Algebra\nGeometry\nTrigonometry\nStatistics\nCalculus\nJersey Shore Area Senior High School 1977 City , State\nGraduate :\n1977 Graduate -- Academic Courses\nMember National Honor Society\nVarsity Wrestling, Cross Country, Baseball\nRotary October Boy of the Month\nAffiliations\nCivic Avis Recreation Association President Educational Member of Keystone Central Technical Advisory Committee Little League Baseball\nFormer Coach (all age levels), League Safety Officer Elementary Wrestling Former Head Coach, Board Member of Parents Auxiliary Empfield\nEnterprises Graphic Design Manager and Consultant Penn. College of Technology Part-time Teacher, Microcomputer Fundamentals Designamics\nOwner / Operator Textile Silk Screen Printing Business\nOutside Interests\nFamily Husband, Father of Three Children with Five Grandchildren\nChurch Lay Leader and Administrative Council Member\nCivic Avis Recreation Association President\nEducational Member of Keystone Central Technical Advisory Committee\nLittle League Baseball Former Coach (all age levels), League Safety Officer\nElementary Wrestling Former Head Coach, Board Member of Parents Auxiliary\nEmpfield Enterprises Graphic Design Manager and Consultant\nPenn. College of Technology Part-time Teacher, Microcomputer Fundamentals\nDesignamics Owner / Operator Textile Silk Screen Printing Business"
  }
}