{
  "file_name": "97449528.pdf",
  "sections": {
    "general": "OFFICE SUPPORT COORDINATOR",
    "summary": "Highly qualified, detail-oriented and hardworking office manager with more than 12 years of experience. Proficient in research, writing, case\nmanagement and client relations. Self-starter with strong problem solving and organizational abilities. Demonstrated ability to handle difficult\nsituation with tact. Skilled in analyzing a task and breaking it down into manageable pieces. Team player with exceptional communication and\ninterpersonal skills.\nHighlights\nTime management\nMeticulous attention to detail\nStrong problem solver\nResults-oriented\nResourceful\nSelf-directed\nMail management\nReport development\nSchedule management\nSelf-starter\nAccomplishments\nGeneral Â\nCoordinated all department functions for team of 10+ employees.\nReceived a merit raise for strong attention to detail, exemplary customer service and team-player attitude.\nSuccessfully planned and executed corporate meetings, lunches and special events for groups of 15+ employees.\nTraining Â\nSuccessfully trained staff in all office systems and databases, policies and procedures while focusing on minimizing errors and generating\nsuperior results.\nEmployee Management Â\nLiaised with HR department to establish employee benefits, training, payroll and termination procedures.\nAdministration Â\nPerformed administration tasks such as filing, developing spreadsheets, faxing reports, photocopying collateral and scanning documents for\ninter-departmental use.\nCustomer Service Â\nHandled customers effectively by identifying needs, quickly gaining trust, approaching complex situations and resolving problems to\nmaximize efficiency.\nMultitasking Â\nDemonstrated proficiencies in telephone, e-mail, fax and front-desk reception within high-volume environment.\nResearch Â\nInvestigated and analyzed client complaints to identify and resolve issues.",
    "experience": "September 2013\nto\nJanuary 2015\nCompany Name City , State Office Support Coordinator\nProvided a courteous, professional contact for the site.\nReferred calls to appropriate agencies.\nAccurately completed tracking of work processed for used by Case Management staff and provided support to the Case Management\nDirector(s).\nCreated forms in user-friendly formats and assisted leadership with the Support Intensity Scale, *Referrals and Long Term Home Health\nprocesses as requested.\nCoordinated meetings and meeting arrangements.\nThis included scheduling, room set up and facilitation assistance as requested.\nPlanned, arranged, and coordinated community projects, team development and other activities as needed.\nPrepared Check Requests following Finance Department policies, procedures, and deadlines.\nEnsured proper coding so that funds are taken from appropriate accounts.\nAssisted with and completed internal file reviews, set-up and archiving.\nRemained knowledgeable and current of DDD Rules and *Regulations, Program Quality Standards, expectations and best practices\nincluding CCMS, Benefits Utilization System BUS), etc.\nApril 2013\nto\nAugust 2013\nCompany Name City , State Financial Foundation Associate / Seasonal\nInterviewed prospective clients to learn about their financial needs and to discuss any existing coverage.\nProcessed applications, payments, corrections, endorsements and cancellations.\nPromoted agency products to customers on the telephone.\nPresented and clearly explained insurance policy options to clients based on their needs and goals.\nPromoted client retention through high-quality service and follow through.\nPresented account proposals in a professional and timely manner.\nAugust 2011\nto\nApril 2013\nCompany Name City , State Human Resource Assistant / Administrative Assistant III\nAnswered employee questions regarding employment records and resolved any issues.\nAdvised managers on organizational policy matters and recommend needed changes.\nServed as a link between management and employees by handling questions, interpreting and administering contracts and helping resolve\nwork-related problems.\nVerified employment and accountable of establishment and preparation of new-hire paperwork.\nEntered, modified, and proofread data in PeopleSoft and BackOffice.\nJanuary 2013\nto\nMarch 2013\nCompany Name City , State ABA Therapist\nApplied Behavioral Analysis to help clients improve their fuctionality\nMay 2010\nto\nAugust 2010\nCompany Name City , State Data Entry Clerk\nVerified that information in the computer system was up-to-date and accurate.\nIdentified and resolved system and account issues.\nRequested pricing from vendors and created offers for clients.\nNovember 2006\nto\nMarch 2010\nCompany Name City , State Office Management Specialist / Office Administrator\nExecuted accounts receivable reporting enhancements and reconciliation procedures.\nPerformed debit, credit and total accounts on computer spreadsheets/databases, using specialized accounting software. Addressed and\nresolved non-routine, complex and unexpected variances.\nProvided reliable and timely project by project expense, capitalization, amortization and spend data for all departments.\nEfficiently implemented short-term tracking factoring in possible long-term tracking strategies.\nCoordinated all department functions for team of 10 employees.\nMaintained detailed administrative and procedural processes to improve accuracy and efficiency.\nVerified and logged in deadlines for responding to daily inquiries.\nSupervised and trained admitting, billing and collection staff.\nCreated databases and spreadsheets to improve inventory management and reporting accuracy.\nImplemented updated online collection procedures for payment, increasing on-time payments by [Number]%.Implemented updated online\ncollection procedures for payment, increasing on-time payments by 98 %.\nManaged incoming and outgoing calls for busy Internet website.Improved communication efficiency as primary liaison between departments\nand clients.",
    "education": "2012\nUniversity of Colorado Colorado Springs City , State , El Paso Bachelor : Psychology\nBA in Psychology\n3.87 GPA / Graduated Magna Cum Laude\n2006\nState Vocational School III Bamberg / Germany City , State , Germany III Bamberg Vocational Field Economics + Administration, Health (2003-\n2006) Graf-Stauffenberg-Business School Bamberg Business Certificate : Administratin/ Business/ Health\nMajor in Business Administration\nMinor in Health and Employment Law\nCoursework includes Economics\nCoursework includes Organizational Behavior\nCoursework includes English",
    "languages": "Bilingual in English and German",
    "interests": "Committed to community service. Extensive volunteer history includes being a Court Appointed Special Advocate for abused and neglected\nchildren and collecting experience as a Neonatal Hearing Screen Volunteer at St. Francis / Penrose in postpartum wing and Neonatal Intensive\nCare Unit.",
    "skills": "Case Management\nExcellent Customer Service"
  }
}